// Class Slate.ButtonWidgetStyle
// Size: 0x410 (Inherited: 0x30)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FButtonStyle ButtonStyle; // 0x30(0x3e0)
};

// Class Slate.CheckBoxWidgetStyle
// Size: 0x8d0 (Inherited: 0x30)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FCheckBoxStyle CheckBoxStyle; // 0x30(0x8a0)
};

// Class Slate.ComboBoxWidgetStyle
// Size: 0x650 (Inherited: 0x30)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboBoxStyle ComboBoxStyle; // 0x30(0x620)
};

// Class Slate.ComboButtonWidgetStyle
// Size: 0x610 (Inherited: 0x30)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboButtonStyle ComboButtonStyle; // 0x30(0x5e0)
};

// Class Slate.EditableTextBoxWidgetStyle
// Size: 0xcc0 (Inherited: 0x30)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x30(0xc90)
};

// Class Slate.EditableTextWidgetStyle
// Size: 0x360 (Inherited: 0x30)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextStyle EditableTextStyle; // 0x30(0x330)
};

// Class Slate.ProgressWidgetStyle
// Size: 0x2e0 (Inherited: 0x30)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	struct FProgressBarStyle ProgressBarStyle; // 0x30(0x2b0)
};

// Class Slate.ScrollBarWidgetStyle
// Size: 0x820 (Inherited: 0x30)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBarStyle ScrollBarStyle; // 0x30(0x7f0)
};

// Class Slate.ScrollBoxWidgetStyle
// Size: 0x3c0 (Inherited: 0x30)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBoxStyle ScrollBoxStyle; // 0x30(0x390)
};

// Class Slate.SlateSettings
// Size: 0x30 (Inherited: 0x28)
struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class Slate.SpinBoxWidgetStyle
// Size: 0x4e0 (Inherited: 0x30)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSpinBoxStyle SpinBoxStyle; // 0x30(0x4b0)
};

// Class Slate.TextBlockWidgetStyle
// Size: 0x490 (Inherited: 0x30)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	struct FTextBlockStyle TextBlockStyle; // 0x30(0x460)
};

// Class Slate.ToolMenuBase
// Size: 0x28 (Inherited: 0x28)
struct UToolMenuBase : UObject {
};

