// Class Solarland.3DMeshWidget
// Size: 0x238 (Inherited: 0x228)
struct A3DMeshWidget : AActor {
	struct USceneComponent* DefaultSceneRoot; // 0x228(0x08)
	struct UStaticMeshComponent* StaticMeshComp; // 0x230(0x08)
};

// Class Solarland.3DMeshWidgetTrack
// Size: 0x2d8 (Inherited: 0x238)
struct A3DMeshWidgetTrack : A3DMeshWidget {
	char pad_238[0x8]; // 0x238(0x08)
	struct FVector BoxHalfExtent; // 0x240(0x0c)
	float PlayerNearbyAlpha; // 0x24c(0x04)
	bool bDebugCollision; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FName MaterialAlphaParamName; // 0x254(0x08)
	struct FName MaterialCountDownName; // 0x25c(0x08)
	float MaxTraceDist; // 0x264(0x04)
	float DistFromGround; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct UStaticMeshComponent* StaticMeshCountDown; // 0x270(0x08)
	struct UTextRenderComponent* DistTextComp; // 0x278(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialIcon; // 0x280(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialCountDown; // 0x288(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialDistText; // 0x290(0x08)
	char pad_298[0x40]; // 0x298(0x40)
};

// Class Solarland.AbilityTask_WaitAbilityEnd
// Size: 0x148 (Inherited: 0x80)
struct UAbilityTask_WaitAbilityEnd : UAbilityTask {
	struct FMulticastInlineDelegate OnEnd; // 0x80(0x10)
	char pad_90[0xb8]; // 0x90(0xb8)

	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEndWithTagRequirements(struct UGameplayAbility* OwningAbility, struct FGameplayTagRequirements TagRequirements, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEndWithTagRequirements // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2644b30
	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd_Query(struct UGameplayAbility* OwningAbility, struct FGameplayTagQuery Query, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEnd_Query // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2644d40
	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd(struct UGameplayAbility* OwningAbility, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEnd // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2644990
	void OnAbilityEnd(struct FAbilityEndedData& EndedData); // Function Solarland.AbilityTask_WaitAbilityEnd.OnAbilityEnd // (Final|Native|Protected|HasOutParms) // @ game+0x2644580
};

// Class Solarland.SolarAbilityTask
// Size: 0x80 (Inherited: 0x80)
struct USolarAbilityTask : UAbilityTask {
};

// Class Solarland.AbilityTask_WaitAttributeChangeWithOldValue
// Size: 0xf8 (Inherited: 0x80)
struct UAbilityTask_WaitAttributeChangeWithOldValue : USolarAbilityTask {
	struct FMulticastInlineDelegate OnChange; // 0x80(0x10)
	char pad_90[0x60]; // 0x90(0x60)
	struct UAbilitySystemComponent* ExternalOwner; // 0xf0(0x08)

	struct UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChangeWithComparison(struct UGameplayAbility* OwningAbility, struct FGameplayAttribute InAttribute, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, enum class EWaitAttributeChangeComparison InComparisonType, float InComparisonValue, bool bTriggerOnce, struct AActor* OptionalExternalOwner); // Function Solarland.AbilityTask_WaitAttributeChangeWithOldValue.WaitForAttributeChangeWithComparison // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2645210
	struct UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChange(struct UGameplayAbility* OwningAbility, struct FGameplayAttribute InAttribute, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, bool bTriggerOnce, struct AActor* OptionalExternalOwner); // Function Solarland.AbilityTask_WaitAttributeChangeWithOldValue.WaitForAttributeChange // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2644f10
};

// Class Solarland.AbilityTask_WaitDelayAndResetOnGameplayEvent
// Size: 0xc0 (Inherited: 0x80)
struct UAbilityTask_WaitDelayAndResetOnGameplayEvent : USolarAbilityTask {
	struct FMulticastInlineDelegate OnFinish; // 0x80(0x10)
	struct FDelegate OnRecalculateWaitDelayOnEventTriggered; // 0x90(0x10)
	char pad_A0[0x20]; // 0xa0(0x20)

	struct UAbilityTask_WaitDelayAndResetOnGameplayEvent* CreateTask(struct UGameplayAbility* OwningAbility, float DelayTime, struct FGameplayTag& EventTag); // Function Solarland.AbilityTask_WaitDelayAndResetOnGameplayEvent.CreateTask // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x2643c20
};

// Class Solarland.AbilityTask_WaitEvaluation
// Size: 0xa8 (Inherited: 0x80)
struct UAbilityTask_WaitEvaluation : USolarAbilityTask {
	struct FMulticastInlineDelegate OnGotDesiredValue; // 0x80(0x10)
	struct FDelegate EvaluationFunction; // 0x90(0x10)
	char pad_A0[0x8]; // 0xa0(0x08)

	struct UAbilityTask_WaitEvaluation* CreateTask(struct UGameplayAbility* OwningAbility, bool bDesiredValue, bool bTriggerOnce); // Function Solarland.AbilityTask_WaitEvaluation.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2643d30
};

// Class Solarland.AbilityTask_WaitInputAction
// Size: 0xa8 (Inherited: 0x80)
struct UAbilityTask_WaitInputAction : USolarAbilityTask {
	struct FMulticastInlineDelegate OnInputAction; // 0x80(0x10)
	char pad_90[0x18]; // 0x90(0x18)

	struct UAbilityTask_WaitInputAction* CreateTask(struct UGameplayAbility* OwningAbility, struct FName ActionName, enum class EInputEvent InputEvent, bool bTriggerOnce); // Function Solarland.AbilityTask_WaitInputAction.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2643e50
};

// Class Solarland.AbilityTask_WaitTagRequirementsMetStatusChange
// Size: 0xf0 (Inherited: 0x80)
struct UAbilityTask_WaitTagRequirementsMetStatusChange : USolarAbilityTask {
	struct FMulticastInlineDelegate OnMetStatusChange; // 0x80(0x10)
	struct FGameplayTagRequirements TagRequirements; // 0x90(0x50)
	char pad_E0[0x10]; // 0xe0(0x10)

	struct UAbilityTask_WaitTagRequirementsMetStatusChange* CreateTask(struct UGameplayAbility* OwningAbility, struct FGameplayTagRequirements& TagRequirements, bool bMetInitially); // Function Solarland.AbilityTask_WaitTagRequirementsMetStatusChange.CreateTask // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x2643fa0
};

// Class Solarland.ActionNode
// Size: 0x70 (Inherited: 0x28)
struct UActionNode : UObject {
	struct FMulticastInlineDelegate OnBeganCallback; // 0x28(0x10)
	struct FMulticastInlineDelegate OnEndedCallback; // 0x38(0x10)
	struct FMulticastInlineDelegate OnResetCallback; // 0x48(0x10)
	struct FMulticastInlineDelegate OnDisposedCallback; // 0x58(0x10)
	char pad_68[0x8]; // 0x68(0x08)

	void Reset(); // Function Solarland.ActionNode.Reset // (Final|Native|Public) // @ game+0x26448e0
	bool Finished(); // Function Solarland.ActionNode.Finished // (Final|Native|Public|Const) // @ game+0x2644210
	void Finish(); // Function Solarland.ActionNode.Finish // (Native|Public) // @ game+0x26441f0
	bool Execute(float DeltaTime); // Function Solarland.ActionNode.Execute // (Final|Native|Public) // @ game+0x2644160
	bool Disposed(); // Function Solarland.ActionNode.Disposed // (Final|Native|Public|Const) // @ game+0x2644140
	void Dispose(); // Function Solarland.ActionNode.Dispose // (Final|Native|Public) // @ game+0x2644120
};

// Class Solarland.ActionWheelWidgetFunctionBase
// Size: 0x38 (Inherited: 0x28)
struct UActionWheelWidgetFunctionBase : UObject {
	struct TWeakObjectPtr<struct USolarUserWidget> BindedWidget; // 0x28(0x08)
	int32_t LastSelectedIndex; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	int32_t GetSuggestActionIndex(); // Function Solarland.ActionWheelWidgetFunctionBase.GetSuggestActionIndex // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	int32_t GetQuickActionIndex(); // Function Solarland.ActionWheelWidgetFunctionBase.GetQuickActionIndex // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	int32_t GetAutoSelectedActionIndex(); // Function Solarland.ActionWheelWidgetFunctionBase.GetAutoSelectedActionIndex // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	bool ExecUseCustomItemCommand(int32_t InItemID); // Function Solarland.ActionWheelWidgetFunctionBase.ExecUseCustomItemCommand // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	bool CheckCommandCanExec(struct ASCMPlayerState* InPlayerState, int32_t InIndex, struct FActionWheelCommand InCommand); // Function Solarland.ActionWheelWidgetFunctionBase.CheckCommandCanExec // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.SolarUserWidget
// Size: 0x400 (Inherited: 0x260)
struct USolarUserWidget : UUserWidget {
	enum class EWidgetLayerLevel WidgetLayerLevel; // 0x260(0x01)
	bool bIsPersistent; // 0x261(0x01)
	enum class EWidgetScope WidgetScope; // 0x262(0x01)
	enum class EInputCapture CaptureInput; // 0x263(0x01)
	bool bHideCursorDuringCapture; // 0x264(0x01)
	char pad_265[0x3]; // 0x265(0x03)
	int32_t MyRoot; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct FString widgetkey; // 0x270(0x10)
	bool bReceiveKeyMap; // 0x280(0x01)
	bool bReceiveShowMouse; // 0x281(0x01)
	enum class EScope ShowScope; // 0x282(0x01)
	enum class ELayoutPreviewType LayoutPreviewType; // 0x283(0x01)
	bool bShowTransBlackAnim; // 0x284(0x01)
	char pad_285[0x3]; // 0x285(0x03)
	struct UWidgetInputManager* InputManagerClass; // 0x288(0x08)
	struct UWidgetInputManager* InputManager; // 0x290(0x08)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap; // 0x298(0x50)
	struct TWeakObjectPtr<struct UWidgetAnimation> PlayingAnimation; // 0x2e8(0x08)
	char pad_2F0[0x18]; // 0x2f0(0x18)
	struct TArray<struct FPlayAnimationParams> PendingPlayAnimations; // 0x308(0x10)
	bool WidgetTickEnabled; // 0x318(0x01)
	char pad_319[0x3]; // 0x319(0x03)
	bool bInterestLocalLang; // 0x31c(0x01)
	char pad_31D[0xb]; // 0x31d(0x0b)
	struct USolarInputActionContext* InputActionContext; // 0x328(0x08)
	char pad_330[0xb0]; // 0x330(0xb0)
	struct TArray<struct USolarUserWidget*> AllSolarUserWidgetChilds; // 0x3e0(0x10)
	struct TArray<struct USolarAdapterWidget*> AllSolarAdapterWidgetChilds; // 0x3f0(0x10)

	void StopListeningForInputHandle(int32_t Handle); // Function Solarland.SolarUserWidget.StopListeningForInputHandle // (Final|Native|Protected|BlueprintCallable) // @ game+0x2971350
	void StopListeningForInputActionEx(struct FName ActionName, enum class EInputEvent EventType); // Function Solarland.SolarUserWidget.StopListeningForInputActionEx // (Final|Native|Protected|BlueprintCallable) // @ game+0x2971280
	void ShowSelfPanelUI(); // Function Solarland.SolarUserWidget.ShowSelfPanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x2971260
	void ShowMouseCursor(); // Function Solarland.SolarUserWidget.ShowMouseCursor // (Final|Native|Protected|BlueprintCallable) // @ game+0x2971240
	void SetZOrder(int32_t ZOrder); // Function Solarland.SolarUserWidget.SetZOrder // (Final|Native|Public) // @ game+0x29711b0
	void SetWidgetVisible(struct UWidget* Widget, bool bVisible, bool bHitTest); // Function Solarland.SolarUserWidget.SetWidgetVisible // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x29710a0
	void SetWidgetTickEnabled(bool bEnabled); // Function Solarland.SolarUserWidget.SetWidgetTickEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x2971010
	void SetWidgetScope(enum class EWidgetScope InWidgetScope); // Function Solarland.SolarUserWidget.SetWidgetScope // (Final|Native|Public) // @ game+0x2970f90
	void SetWidgetLayerLevel(enum class EWidgetLayerLevel InWidgetLayerLevel); // Function Solarland.SolarUserWidget.SetWidgetLayerLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x2970f10
	void SetWidgetKey(struct FString InWidgetKey); // Function Solarland.SolarUserWidget.SetWidgetKey // (Final|Native|Public) // @ game+0x2970e70
	void SetInputActionIsEnabled(struct FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled); // Function Solarland.SolarUserWidget.SetInputActionIsEnabled // (Final|Native|Protected|BlueprintCallable) // @ game+0x2970d50
	void SetBlockInputForOneTick(); // Function Solarland.SolarUserWidget.SetBlockInputForOneTick // (Final|Native|Public) // @ game+0x2970d30
	void ReceiveTick(struct FGeometry& MyGeometry, float InDeltaTime); // Function Solarland.SolarUserWidget.ReceiveTick // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveShow(); // Function Solarland.SolarUserWidget.ReceiveShow // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveHide(); // Function Solarland.SolarUserWidget.ReceiveHide // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	bool PlayAnimationByName(struct FName& AnimationName, float StartAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed); // Function Solarland.SolarUserWidget.PlayAnimationByName // (Final|Native|Public|HasOutParms) // @ game+0x2970970
	void PlayAnimationByExclusively(struct UWidgetAnimation* InAnimation, float StartAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState); // Function Solarland.SolarUserWidget.PlayAnimationByExclusively // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x29707a0
	void OnTouchManagerInitialized(); // Function Solarland.SolarUserWidget.OnTouchManagerInitialized // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnSynchronizeProperties(); // Function Solarland.SolarUserWidget.OnSynchronizeProperties // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnSolarUIOpened(); // Function Solarland.SolarUserWidget.OnSolarUIOpened // (Native|Event|Protected|BlueprintEvent) // @ game+0x834f80
	void OnSolarUIClosed(); // Function Solarland.SolarUserWidget.OnSolarUIClosed // (Native|Event|Protected|BlueprintEvent) // @ game+0x1ad7000
	void OnShow(); // Function Solarland.SolarUserWidget.OnShow // (Native|Event|Protected|BlueprintEvent) // @ game+0x1ad71e0
	void OnLocalLangChangedEx(struct FString InLang); // Function Solarland.SolarUserWidget.OnLocalLangChangedEx // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnHide(); // Function Solarland.SolarUserWidget.OnHide // (Native|Event|Protected|BlueprintEvent) // @ game+0x1ad7180
	void OnExclusivelyAnimationFinished(); // Function Solarland.SolarUserWidget.OnExclusivelyAnimationFinished // (Final|Native|Protected) // @ game+0x2970720
	void OnDeinitialize(); // Function Solarland.SolarUserWidget.OnDeinitialize // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnBackKey(enum class EWidgetBackKeyType BackKeyType); // Function Solarland.SolarUserWidget.OnBackKey // (Native|Event|Protected|BlueprintEvent) // @ game+0x2970290
	int32_t ListenForInputActionEx(struct FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled, struct FDelegate Callback); // Function Solarland.SolarUserWidget.ListenForInputActionEx // (Final|Native|Protected|BlueprintCallable) // @ game+0x29700f0
	bool IsWidgetTickEnabled(); // Function Solarland.SolarUserWidget.IsWidgetTickEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28a31a0
	bool IsSolarUserWidgetAndBindLua(struct UWidget* InWidget); // Function Solarland.SolarUserWidget.IsSolarUserWidgetAndBindLua // (Final|Native|Static|Public) // @ game+0x2970060
	bool IsPlatformSwitch(); // Function Solarland.SolarUserWidget.IsPlatformSwitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2970030
	bool IsPlatformDesktop(); // Function Solarland.SolarUserWidget.IsPlatformDesktop // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2970000
	void HideMouseCursor(); // Function Solarland.SolarUserWidget.HideMouseCursor // (Final|Native|Protected|BlueprintCallable) // @ game+0x296fe40
	struct FString GetWidgetKeyByPanelName(enum class EUIPanelName PanelName); // Function Solarland.SolarUserWidget.GetWidgetKeyByPanelName // (Final|Native|Static|Public) // @ game+0x296fd70
	struct FString GetWidgetKey(); // Function Solarland.SolarUserWidget.GetWidgetKey // (Final|Native|Public|Const) // @ game+0x296fcf0
	struct TArray<struct FVector2D> GetTouchedLocation(); // Function Solarland.SolarUserWidget.GetTouchedLocation // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x296fc70
	enum class EScope GetShowScope(); // Function Solarland.SolarUserWidget.GetShowScope // (Final|Native|Public|Const) // @ game+0x296fc40
	struct TArray<struct FVector2D> GetPointerLocation(); // Function Solarland.SolarUserWidget.GetPointerLocation // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x296fb90
	struct ASolarPlayerState* GetOwningSolarPlayerState(); // Function Solarland.SolarUserWidget.GetOwningSolarPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x296fb60
	struct ASolarCharacter* GetOwningSolarPlayerCharacter(); // Function Solarland.SolarUserWidget.GetOwningSolarPlayerCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x296fb30
	struct UWidgetAnimation* GetAnimationByName(struct FName& AnimationName); // Function Solarland.SolarUserWidget.GetAnimationByName // (Final|Native|Public|HasOutParms|Const) // @ game+0x296f8b0
	struct TArray<struct USolarUserWidget*> GetAllSolarUserWidgetChilds(); // Function Solarland.SolarUserWidget.GetAllSolarUserWidgetChilds // (Final|Native|Public) // @ game+0x296f830
	struct UWidget* FindWidgetFromName(struct FName& Name); // Function Solarland.SolarUserWidget.FindWidgetFromName // (Final|Native|Public|HasOutParms|Const) // @ game+0x296f790
	void ExecuteSolarUIShow(); // Function Solarland.SolarUserWidget.ExecuteSolarUIShow // (Final|Native|Public) // @ game+0x296f770
	void ExecuteSolarUIOpened(); // Function Solarland.SolarUserWidget.ExecuteSolarUIOpened // (Final|Native|Public) // @ game+0x296f750
	void ExecuteSolarUIHide(); // Function Solarland.SolarUserWidget.ExecuteSolarUIHide // (Final|Native|Public) // @ game+0x296f730
	void ExecuteSolarUIClosed(); // Function Solarland.SolarUserWidget.ExecuteSolarUIClosed // (Final|Native|Public) // @ game+0x296f710
	void ExecuteSolarUIClean(); // Function Solarland.SolarUserWidget.ExecuteSolarUIClean // (Final|Native|Public) // @ game+0x296f6f0
	void ExecuteBindCustomControl(); // Function Solarland.SolarUserWidget.ExecuteBindCustomControl // (Final|Native|Public) // @ game+0x296f6d0
	void CloseSelfPanelUI(); // Function Solarland.SolarUserWidget.CloseSelfPanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x296f690
	struct TArray<struct USolarUserWidget*> CacheAllSolarUserWidgetChilds(); // Function Solarland.SolarUserWidget.CacheAllSolarUserWidgetChilds // (Final|Native|Public) // @ game+0x296f610
};

// Class Solarland.ActionWheelWidget
// Size: 0x5f0 (Inherited: 0x400)
struct UActionWheelWidget : USolarUserWidget {
	char pad_400[0x10]; // 0x400(0x10)
	struct UOverlay* Overlay_Point; // 0x410(0x08)
	char pad_418[0x58]; // 0x418(0x58)
	int32_t SelectedIndex; // 0x470(0x04)
	int32_t WheelActionItemCount; // 0x474(0x04)
	int32_t WheelActionItemCountMax; // 0x478(0x04)
	float OperationAreaRadius; // 0x47c(0x04)
	float CancelAreaRadius; // 0x480(0x04)
	float PointMoveSensitivity; // 0x484(0x04)
	float ManualSwitchThreshold_PC; // 0x488(0x04)
	float ManualSwitchThreshold_GamePad; // 0x48c(0x04)
	float ManualSwitchThreshold_Mobile; // 0x490(0x04)
	int32_t groupid; // 0x494(0x04)
	int32_t PageCount; // 0x498(0x04)
	int32_t CurrentPage; // 0x49c(0x04)
	char pad_4A0[0x8]; // 0x4a0(0x08)
	struct FActionWheelConfig WheelConfigs; // 0x4a8(0xe0)
	struct TMap<int32_t, struct UActionWheelWidgetFunctionBase*> ActionWheelWidgetFunctionObjs; // 0x588(0x50)
	struct UDataTable* ActionWheelConfigDataTable; // 0x5d8(0x08)
	bool ActionWheelIsOpened; // 0x5e0(0x01)
	char pad_5E1[0x3]; // 0x5e1(0x03)
	float ValidEmojiUseDistance; // 0x5e4(0x04)
	int32_t ItemWheelGroupID; // 0x5e8(0x04)
	int32_t EmoteActionWheelGroupID; // 0x5ec(0x04)

	void UpdateWheelArrowAngle(float Degree); // Function Solarland.ActionWheelWidget.UpdateWheelArrowAngle // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void SetInputActionGroupEnable(bool InEnable); // Function Solarland.ActionWheelWidget.SetInputActionGroupEnable // (Final|Native|Public|BlueprintCallable) // @ game+0x2644900
	void SelecteActionWheelItem(int32_t page, int32_t Index); // Function Solarland.ActionWheelWidget.SelecteActionWheelItem // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveActionWheelTouchMoved(struct FVector2D& TouchLocalPos); // Function Solarland.ActionWheelWidget.ReceiveActionWheelTouchMoved // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x2644850
	void OnConsumeItemUpdated(); // Function Solarland.ActionWheelWidget.OnConsumeItemUpdated // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnCommandExec(int32_t InGroupID, int32_t InSelectedIndex); // Function Solarland.ActionWheelWidget.OnCommandExec // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnBindedInputActionReleased(int32_t InGroupID); // Function Solarland.ActionWheelWidget.OnBindedInputActionReleased // (Native|Event|Public|BlueprintEvent) // @ game+0x26447c0
	void OnBindedInputActionPressed(int32_t InGroupID); // Function Solarland.ActionWheelWidget.OnBindedInputActionPressed // (Native|Event|Public|BlueprintEvent) // @ game+0x2644730
	void OnBattleHUDVisibilityChanged(bool Visible); // Function Solarland.ActionWheelWidget.OnBattleHUDVisibilityChanged // (Final|Native|Public) // @ game+0x26446a0
	void OnActionWheelPreviousPage(); // Function Solarland.ActionWheelWidget.OnActionWheelPreviousPage // (Final|Native|Public) // @ game+0x2644680
	void OnActionWheelOpened(); // Function Solarland.ActionWheelWidget.OnActionWheelOpened // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnActionWheelNextPage(); // Function Solarland.ActionWheelWidget.OnActionWheelNextPage // (Final|Native|Public) // @ game+0x2644660
	void OnActionWheelMouseRightClicked(); // Function Solarland.ActionWheelWidget.OnActionWheelMouseRightClicked // (Final|Native|Public) // @ game+0x2644640
	void OnActionWheelMouseLeftClicked(); // Function Solarland.ActionWheelWidget.OnActionWheelMouseLeftClicked // (Final|Native|Public) // @ game+0x2644620
	void OnActionWheelConfigInit(); // Function Solarland.ActionWheelWidget.OnActionWheelConfigInit // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnActionWheelClosed(); // Function Solarland.ActionWheelWidget.OnActionWheelClosed // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void LoadCustomActionCommandInfo(struct FActionWheelConfig& ActionWheelConfig); // Function Solarland.ActionWheelWidget.LoadCustomActionCommandInfo // (Final|Native|Public|HasOutParms) // @ game+0x2644440
	void InitActionWheelConfigByGroupID(int32_t InGroupID, int32_t InPage); // Function Solarland.ActionWheelWidget.InitActionWheelConfigByGroupID // (Final|Native|Public|BlueprintCallable) // @ game+0x2644370
	int32_t GetItemNumById(int32_t InItemID); // Function Solarland.ActionWheelWidget.GetItemNumById // (Final|Native|Public|BlueprintCallable) // @ game+0x26442d0
	struct UActionWheelWidgetFunctionBase* GetActionWheelWidgetFunctionObj(int32_t InGroupID); // Function Solarland.ActionWheelWidget.GetActionWheelWidgetFunctionObj // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2644230
	void CommandExec(int32_t InGroupID, int32_t InSelectedIndex); // Function Solarland.ActionWheelWidget.CommandExec // (Final|Native|Public|BlueprintCallable) // @ game+0x2643b50
	void ChangeWheelVisibility(bool Visible, bool IsProactivelyCancel); // Function Solarland.ActionWheelWidget.ChangeWheelVisibility // (Final|Native|Public) // @ game+0x2643a80
	void ActionWheelYAxis(float Movement); // Function Solarland.ActionWheelWidget.ActionWheelYAxis // (Final|Native|Protected) // @ game+0x2643a00
	void ActionWheelXAxis(float Movement); // Function Solarland.ActionWheelWidget.ActionWheelXAxis // (Final|Native|Protected) // @ game+0x2643980
};

// Class Solarland.ActorEffect
// Size: 0x50 (Inherited: 0x28)
struct UActorEffect : UObject {
	struct UActorEffectController* ControllerClass; // 0x28(0x08)
	struct UActorEffectController* Controller; // 0x30(0x08)
	char pad_38[0x18]; // 0x38(0x18)
};

// Class Solarland.ActorEffectController
// Size: 0x28 (Inherited: 0x28)
struct UActorEffectController : UObject {
};

// Class Solarland.ActorEffectSubsystem
// Size: 0xf0 (Inherited: 0x30)
struct UActorEffectSubsystem : UWorldSubsystem {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UActorEffect*> Effects; // 0x40(0x10)
	struct TMap<struct UActorEffect*, struct FActorEffectPool> EffectPools; // 0x50(0x50)
	struct TMap<struct UActorEffectController*, struct FActorEffectControllerPool> ControllerPools; // 0xa0(0x50)

	bool Stop(struct UActorEffect* EffectInstance); // Function Solarland.ActorEffectSubsystem.Stop // (Final|Native|Public|BlueprintCallable) // @ game+0x264bdf0
	struct UActorEffect* Start(struct UActorEffect* EffectClass, struct AActor* AffectedActor); // Function Solarland.ActorEffectSubsystem.Start // (Final|Native|Public|BlueprintCallable) // @ game+0x264bd20
	bool Finish(struct UActorEffect* EffectInstance); // Function Solarland.ActorEffectSubsystem.Finish // (Final|Native|Public|BlueprintCallable) // @ game+0x26499e0
};

// Class Solarland.ActorMarkBase
// Size: 0x480 (Inherited: 0x400)
struct UActorMarkBase : USolarUserWidget {
	char pad_400[0x10]; // 0x400(0x10)
	bool bEnableWeltDetection; // 0x410(0x01)
	char pad_411[0xb]; // 0x411(0x0b)
	float LerpAlpha; // 0x41c(0x04)
	float AngleForArrow; // 0x420(0x04)
	char pad_424[0x10]; // 0x424(0x10)
	struct FVector2D RectangleOffset; // 0x434(0x08)
	float Radius; // 0x43c(0x04)
	struct AActor* CurrentFollowActor; // 0x440(0x08)
	struct APlayerController* CurrentPlayerController; // 0x448(0x08)
	struct FVector2D MarkIconAlignment; // 0x450(0x08)
	struct FVector2D MarkPanelSize; // 0x458(0x08)
	char pad_460[0x18]; // 0x460(0x18)
	float MaxVisibleDis; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)

	void SetUpdateState(bool InShouldUpdateLocation); // Function Solarland.ActorMarkBase.SetUpdateState // (Final|Native|Public|BlueprintCallable) // @ game+0x264bc90
	void InitActorMarkBaseByFixedPos(struct FVector Pos, struct APlayerController* Controller); // Function Solarland.ActorMarkBase.InitActorMarkBaseByFixedPos // (Final|Native|Public|HasDefaults) // @ game+0x2649c60
	void InitActorMarkBase(struct AActor* InActor, struct APlayerController* Controller); // Function Solarland.ActorMarkBase.InitActorMarkBase // (Final|Native|Public) // @ game+0x2649b90
	struct FVector GetFollowActorLocation(); // Function Solarland.ActorMarkBase.GetFollowActorLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x2649b50
	float GetDistance(bool bIncludeZ); // Function Solarland.ActorMarkBase.GetDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2649ab0
	struct AActor* GetCurrentFollowActor(); // Function Solarland.ActorMarkBase.GetCurrentFollowActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2649a80
};

// Class Solarland.ActorMaterialSubsystemDataAsset
// Size: 0xc8 (Inherited: 0x30)
struct UActorMaterialSubsystemDataAsset : UDataAsset {
	struct FGameplayTag DefaultMaterialChangePriorityTag; // 0x30(0x08)
	struct TArray<struct FMaterialChangePriorityGroup> OrderedMaterialChangePriorityGroups; // 0x38(0x10)
	struct TSet<struct FSoftObjectPath> GlobalNoChangeMaterials; // 0x48(0x50)
	struct TArray<struct FForceChangeMaterialInfos> GlobalForceChangeMaterials; // 0x98(0x10)
	char pad_A8[0x20]; // 0xa8(0x20)
};

// Class Solarland.ActorMaterialSubsystemSettings
// Size: 0x60 (Inherited: 0x38)
struct UActorMaterialSubsystemSettings : UDeveloperSettings {
	struct TSoftObjectPtr<UActorMaterialSubsystemDataAsset> ActorMaterialSubsystemDataAsset; // 0x38(0x28)
};

// Class Solarland.ActorMaterialSubsystem
// Size: 0x98 (Inherited: 0x30)
struct UActorMaterialSubsystem : UWorldSubsystem {
	struct UActorMaterialSubsystemDataAsset* Settings; // 0x30(0x08)
	struct TMap<struct AActor*, struct FActorMaterialInfo> ActorMaterialsMap; // 0x38(0x50)
	char pad_88[0x10]; // 0x88(0x10)

	bool SetStaticMesh(struct AActor* Actor, struct UStaticMeshComponent* MeshComp, struct UStaticMesh* NewMesh); // Function Solarland.ActorMaterialSubsystem.SetStaticMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x264bb80
	bool SetSkeletalMesh(struct AActor* Actor, struct USkeletalMeshComponent* MeshComp, struct USkeletalMesh* NewMesh, bool bReinitPose, bool bForceSkipTickAnimation); // Function Solarland.ActorMaterialSubsystem.SetSkeletalMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x264b9c0
	bool SetOriginalMultiplePassMaterial(struct AActor* Actor, struct UMeshComponent* MeshComp, struct UMaterialInterface* Material, bool bNeedMultiplePass); // Function Solarland.ActorMaterialSubsystem.SetOriginalMultiplePassMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x264b860
	bool SetOriginalMaterials(struct AActor* Actor, struct UMeshComponent* MeshComp, struct TArray<struct UMaterialInterface*>& Materials); // Function Solarland.ActorMaterialSubsystem.SetOriginalMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x264b730
	bool SetOriginalMaterial(struct AActor* Actor, struct UMeshComponent* MeshComp, int32_t MaterialIndex, struct UMaterialInterface* Material); // Function Solarland.ActorMaterialSubsystem.SetOriginalMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x264b5d0
	void RemoveNoChangeMaterials(struct TArray<struct FSoftObjectPath>& Materials); // Function Solarland.ActorMaterialSubsystem.RemoveNoChangeMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x264b500
	bool RemoveMaterialChange(struct AActor* Actor, struct FMaterialChangeHandle Handle); // Function Solarland.ActorMaterialSubsystem.RemoveMaterialChange // (Final|Native|Public|BlueprintCallable) // @ game+0x264b430
	bool RemoveAllMaterialChanges(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RemoveAllMaterialChanges // (Final|Native|Public|BlueprintCallable) // @ game+0x264b390
	void RebuildMaterialChangesOnMeshAddedOrRemoved(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RebuildMaterialChangesOnMeshAddedOrRemoved // (Final|Native|Public|BlueprintCallable) // @ game+0x264b300
	void RebuildMaterialChangesOnAllOriginalMaterialsChanged(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RebuildMaterialChangesOnAllOriginalMaterialsChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x264b270
	struct UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameterByIndex(struct UMaterialInstanceDynamic* TargetMaterial, struct UPrimitiveComponent* SourcePrimitiveComponent, int32_t SourceElementIndex, struct FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.OverrideDynamicMaterialInstanceParameterByIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x264b0a0
	struct UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameter(struct UMaterialInstanceDynamic* TargetMaterial, struct UMaterialInterface* SourceMaterial, struct FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.OverrideDynamicMaterialInstanceParameter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x264af10
	void OnActorEndPlay(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function Solarland.ActorMaterialSubsystem.OnActorEndPlay // (Final|Native|Private) // @ game+0x264ae40
	bool K2_SetVectorMaterialParameter(struct AActor* Actor, struct FMaterialChangeHandle Handle, struct FName ParameterName, struct FVector ParameterValue, struct FMaterialFilter Filter); // Function Solarland.ActorMaterialSubsystem.K2_SetVectorMaterialParameter // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x264ab40
	bool K2_SetScalarMaterialParameter(struct AActor* Actor, struct FMaterialChangeHandle Handle, struct FName ParameterName, float ParameterValue, struct FMaterialFilter Filter); // Function Solarland.ActorMaterialSubsystem.K2_SetScalarMaterialParameter // (Final|Native|Public|BlueprintCallable) // @ game+0x264a850
	void K2_RebuildMaterialChangesOnOriginalMaterialChanged(struct AActor* Actor, struct TArray<struct UMeshComponent*> ChangedMeshes); // Function Solarland.ActorMaterialSubsystem.K2_RebuildMaterialChangesOnOriginalMaterialChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x264a720
	struct UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParametersByIndex(struct UMaterialInstanceDynamic* TargetMaterial, struct UPrimitiveComponent* PrimitiveComponent, int32_t SourceElementIndex, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.K2_OverrideDynamicMaterialInstanceAllParametersByIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x264a520
	struct UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParameters(struct UMaterialInstanceDynamic* TargetMaterial, struct UMaterialInterface* SourceMaterial, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.K2_OverrideDynamicMaterialInstanceAllParameters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x264a360
	struct UMaterialInstanceDynamic* K2_CreateDynamicMaterialInstanceOverrideAllParameters(struct UPrimitiveComponent* TargetPrimitiveComponent, struct UMaterialInterface* SourceMaterial, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, int32_t TargetElementIndex, bool bOverridenOnly, struct FName OptionalMaterialName); // Function Solarland.ActorMaterialSubsystem.K2_CreateDynamicMaterialInstanceOverrideAllParameters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x264a100
	struct FMaterialChangeHandle K2_AddMaterialChangeByPath(struct AActor* Actor, struct FSoftObjectPath& MaterialPath, struct FAddMaterialChangeParams Params); // Function Solarland.ActorMaterialSubsystem.K2_AddMaterialChangeByPath // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x2649f10
	struct FMaterialChangeHandle K2_AddMaterialChange(struct AActor* Actor, struct UMaterialInterface* SourceMaterial, struct FAddMaterialChangeParams Params); // Function Solarland.ActorMaterialSubsystem.K2_AddMaterialChange // (Final|Native|Public|BlueprintCallable) // @ game+0x2649d40
	bool EmptyOriginalOverrideMaterials(struct AActor* Actor, struct UMeshComponent* MeshComp); // Function Solarland.ActorMaterialSubsystem.EmptyOriginalOverrideMaterials // (Final|Native|Public|BlueprintCallable) // @ game+0x2649910
	bool ContainsMaterialChangeByPriority(struct AActor* Actor, int32_t Priority); // Function Solarland.ActorMaterialSubsystem.ContainsMaterialChangeByPriority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2649840
	bool ContainsMaterialChange(struct AActor* Actor, struct FMaterialChangeHandle Handle); // Function Solarland.ActorMaterialSubsystem.ContainsMaterialChange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2649770
	bool ContainsAnyMaterialChange(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.ContainsAnyMaterialChange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26496d0
	void AddNoChangeMaterials(struct TArray<struct FSoftObjectPath>& Materials); // Function Solarland.ActorMaterialSubsystem.AddNoChangeMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2649600
};

// Class Solarland.ActorMaterialSubsystemAgentInterface
// Size: 0x28 (Inherited: 0x28)
struct UActorMaterialSubsystemAgentInterface : UInterface {
};

// Class Solarland.ActorMaterialSubsystemAgentComponentInterface
// Size: 0x28 (Inherited: 0x28)
struct UActorMaterialSubsystemAgentComponentInterface : UInterface {

	struct UMaterialInterface* AMS_GetAlternativeSourceMaterial(struct UMaterialInterface* OriginalSourceMaterial); // Function Solarland.ActorMaterialSubsystemAgentComponentInterface.AMS_GetAlternativeSourceMaterial // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x264f490
};

// Class Solarland.ActorParticleEffectSpawner
// Size: 0xb0 (Inherited: 0x28)
struct UActorParticleEffectSpawner : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct FActorParticleEffectSpawnInfo Info; // 0x38(0x70)
	char pad_A8[0x8]; // 0xa8(0x08)
};

// Class Solarland.ActorParticleEffectSubsystem
// Size: 0x50 (Inherited: 0x30)
struct UActorParticleEffectSubsystem : UWorldSubsystem {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UActorParticleEffectSpawner*> Spawners; // 0x40(0x10)

	struct FActorParticleEffectSpawnHandle K2_RequestParticleEffectSpawn(struct AActor* Actor, struct FActorParticleEffectSpawnInfo SpawnInfo); // Function Solarland.ActorParticleEffectSubsystem.K2_RequestParticleEffectSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x264fbe0
	void CancelParticleEffectSpawn(struct FActorParticleEffectSpawnHandle Handle); // Function Solarland.ActorParticleEffectSubsystem.CancelParticleEffectSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x264f660
};

// Class Solarland.ActorReadySubsystem
// Size: 0xc0 (Inherited: 0x30)
struct UActorReadySubsystem : UWorldSubsystem {
	char pad_30[0x90]; // 0x30(0x90)

	void OnGameStateSet(struct AGameStateBase* GameState); // Function Solarland.ActorReadySubsystem.OnGameStateSet // (Final|Native|Private) // @ game+0x264fee0
	void OnActorPropertyChanged(struct UObject* InObject); // Function Solarland.ActorReadySubsystem.OnActorPropertyChanged // (Final|Native|Private) // @ game+0x264fe50
	void OnActorEndPlay(struct AActor* TargetActor); // Function Solarland.ActorReadySubsystem.OnActorEndPlay // (Final|Native|Private) // @ game+0x264fdc0
	void HasDataWaitTooLong(); // Function Solarland.ActorReadySubsystem.HasDataWaitTooLong // (Final|Native|Private) // @ game+0x264f920
};

// Class Solarland.AdvProgressBase
// Size: 0x310 (Inherited: 0x260)
struct UAdvProgressBase : UUserWidget {
	struct UImage* Progress; // 0x260(0x08)
	struct UMaterialInstance* ProgressShader; // 0x268(0x08)
	float Speed; // 0x270(0x04)
	float CurrentHP; // 0x274(0x04)
	float MaxHP; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct TMap<int32_t, float> ActionMap; // 0x280(0x50)
	float AnimCurrentHP; // 0x2d0(0x04)
	float ProgressAdd; // 0x2d4(0x04)
	float ProgressMinus; // 0x2d8(0x04)
	char pad_2DC[0x34]; // 0x2dc(0x34)

	void UpdateMaxHPLength(float NewHPMax, float NewCurrentHP); // Function Solarland.AdvProgressBase.UpdateMaxHPLength // (Final|Native|Public|BlueprintCallable) // @ game+0x2650470
	void SetProgress(float _PreMinus, float _CurrentHP, float _PreAdd); // Function Solarland.AdvProgressBase.SetProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x2650350
	int32_t PreAction(float Number); // Function Solarland.AdvProgressBase.PreAction // (Final|Native|Public|BlueprintCallable) // @ game+0x26502c0
	void Init(float _DefaultHP, float _MaxHP); // Function Solarland.AdvProgressBase.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x264f940
	float GetMaxHP(); // Function Solarland.AdvProgressBase.GetMaxHP // (Final|Native|Public|Const) // @ game+0x264f900
	float GetCurrentHPPercent(); // Function Solarland.AdvProgressBase.GetCurrentHPPercent // (Final|Native|Public|Const) // @ game+0x264f8e0
	void DoActionSmoothly(float Number); // Function Solarland.AdvProgressBase.DoActionSmoothly // (Final|Native|Public|BlueprintCallable) // @ game+0x264f860
	void DoActionDirectly(float Number); // Function Solarland.AdvProgressBase.DoActionDirectly // (Final|Native|Public|BlueprintCallable) // @ game+0x264f7e0
	void DoAction(int32_t ID); // Function Solarland.AdvProgressBase.DoAction // (Final|Native|Public|BlueprintCallable) // @ game+0x264f750
	struct FLinearColor Debug(); // Function Solarland.AdvProgressBase.Debug // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x264f710
	void CleanPreActions(); // Function Solarland.AdvProgressBase.CleanPreActions // (Final|Native|Public|BlueprintCallable) // @ game+0x264f6f0
	void CancelAction(int32_t ID); // Function Solarland.AdvProgressBase.CancelAction // (Final|Native|Public|BlueprintCallable) // @ game+0x264f530
};

// Class Solarland.AerialReconnaissanceMarkWidget
// Size: 0x400 (Inherited: 0x400)
struct UAerialReconnaissanceMarkWidget : USolarUserWidget {

	void K2_MarkStateChanged(bool bInStart); // Function Solarland.AerialReconnaissanceMarkWidget.K2_MarkStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.AirDropAudioActor
// Size: 0x260 (Inherited: 0x228)
struct AAirDropAudioActor : AActor {
	char pad_228[0x10]; // 0x228(0x10)
	int32_t ThisID; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
	bool bSummonedByCharacter; // 0x240(0x01)
	char pad_241[0x7]; // 0x241(0x07)
	struct UAkComponent* AkAudioComponent; // 0x248(0x08)
	struct USolarAkGameObject* SolarAkGameObject; // 0x250(0x08)
	bool bHasLanded; // 0x258(0x01)
	char pad_259[0x7]; // 0x259(0x07)

	void InitSolarAkGameObject(struct UActorComponent* Component, bool bReset); // Function Solarland.AirDropAudioActor.InitSolarAkGameObject // (Final|Native|Public) // @ game+0x264fa10
	void DisappearAirDropArrow(); // Function Solarland.AirDropAudioActor.DisappearAirDropArrow // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.AirDropOutcomeConfig
// Size: 0x110 (Inherited: 0x30)
struct UAirDropOutcomeConfig : UDataAsset {
	int32_t OutcomeID; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct TArray<struct FAirDropSkillDatas> AirDropSkillSetting; // 0x38(0x10)
	struct FWrappedLevelToIdMap ShieldIdConfig; // 0x48(0x50)
	int32_t SniperScopePartOutcomeId; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct TMap<enum class EWeaponPartType, struct FWrappedLevelToIdMap> WeaponPartIdConfig; // 0xa0(0x50)
	struct TArray<struct FWrappedIdCount> SupplyItemArray; // 0xf0(0x10)
	struct TArray<struct FAirDropAllOutcomeConfigArray> OutcomeSeries; // 0x100(0x10)
};

// Class Solarland.SolarDormantActor
// Size: 0x228 (Inherited: 0x228)
struct ASolarDormantActor : AActor {
};

// Class Solarland.SolarItemActor
// Size: 0x408 (Inherited: 0x228)
struct ASolarItemActor : ASolarDormantActor {
	char pad_228[0x48]; // 0x228(0x48)
	struct FSolarItemData ItemData; // 0x270(0xb8)
	struct FVector_NetQuantize DroppedLocation; // 0x328(0x0c)
	float SpawnOffset; // 0x334(0x04)
	struct TArray<struct FSoftObjectPath> DiscardMatPath; // 0x338(0x10)
	struct FSoftObjectPath OutlineMatPath; // 0x348(0x18)
	struct FSoftObjectPath FXPath; // 0x360(0x18)
	float NoneMeshFxOffset; // 0x378(0x04)
	float PositionTolerance; // 0x37c(0x04)
	struct FString FXBPPath; // 0x380(0x10)
	struct USphereComponent* SphereComponent; // 0x390(0x08)
	char pad_398[0x4]; // 0x398(0x04)
	struct TWeakObjectPtr<struct AActor> FXActor; // 0x39c(0x08)
	enum class EItemState ItemCurrentState; // 0x3a4(0x01)
	char pad_3A5[0xb]; // 0x3a5(0x0b)
	struct TArray<char> MarkedTeamIdList; // 0x3b0(0x10)
	char pad_3C0[0x8]; // 0x3c0(0x08)
	struct UStaticMeshComponent* StaticMeshComp; // 0x3c8(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> NormalMats; // 0x3d0(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> OutlineMats; // 0x3e0(0x10)
	bool bAdjustDroppedLocationByLandscape; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	struct FSolarLandscapeListenerConfig LandscapeListenerConfig; // 0x3f4(0x10)
	char pad_404[0x4]; // 0x404(0x04)

	void UnMarkThisItem(char TeamID); // Function Solarland.SolarItemActor.UnMarkThisItem // (Native|Public) // @ game+0x27f3f70
	void SwitchDiscardMaterials(); // Function Solarland.SolarItemActor.SwitchDiscardMaterials // (Final|Native|Protected) // @ game+0x2815b20
	void SetOutlineMeshVisible(bool Visible); // Function Solarland.SolarItemActor.SetOutlineMeshVisible // (Native|Public) // @ game+0x2815970
	void SetItemData(struct FSolarItemData& _ItemData); // Function Solarland.SolarItemActor.SetItemData // (Native|Public|HasOutParms) // @ game+0x27f3c90
	void OnServerPawned(); // Function Solarland.SolarItemActor.OnServerPawned // (Native|Public) // @ game+0x28155f0
	void OnRep_ItemDataChange(); // Function Solarland.SolarItemActor.OnRep_ItemDataChange // (Native|Public) // @ game+0x1ae6410
	void OnRep_ItemCurrentStateChanged(); // Function Solarland.SolarItemActor.OnRep_ItemCurrentStateChanged // (Native|Protected) // @ game+0x7ec190
	void OnRep_DroppedLocation(); // Function Solarland.SolarItemActor.OnRep_DroppedLocation // (Native|Public) // @ game+0x7ec1b0
	void NotifyThisItemWasPickedUp(); // Function Solarland.SolarItemActor.NotifyThisItemWasPickedUp // (Final|Native|Public) // @ game+0x2814d70
	void MarkThisItem(char TeamID); // Function Solarland.SolarItemActor.MarkThisItem // (Native|Public) // @ game+0x27f3980
	struct UStaticMeshComponent* GetStaticMeshComp(); // Function Solarland.SolarItemActor.GetStaticMeshComp // (Final|Native|Public) // @ game+0x2814cc0
	int32_t GetQuality(); // Function Solarland.SolarItemActor.GetQuality // (Native|Public) // @ game+0x27f3940
};

// Class Solarland.SolarTreasureBoxActor
// Size: 0x608 (Inherited: 0x408)
struct ASolarTreasureBoxActor : ASolarItemActor {
	enum class ETreasureBoxState CurrentState; // 0x408(0x01)
	char pad_409[0x7]; // 0x409(0x07)
	struct FSolarItemDataArray ItemDataList; // 0x410(0x118)
	struct TArray<struct FSolarItemData> SortedGameItemDatas; // 0x528(0x10)
	char pad_538[0x20]; // 0x538(0x20)
	int32_t DataLeng; // 0x558(0x04)
	enum class ECostType CostType; // 0x55c(0x01)
	char pad_55D[0x3]; // 0x55d(0x03)
	int32_t CostNum; // 0x560(0x04)
	char pad_564[0x54]; // 0x564(0x54)
	int32_t HighestItemQuality; // 0x5b8(0x04)
	float BurstRadius; // 0x5bc(0x04)
	float BurstRadiusRandScale; // 0x5c0(0x04)
	float BurstLocalHeight; // 0x5c4(0x04)
	float BurstEulerAngle; // 0x5c8(0x04)
	bool bBurstSplitItem; // 0x5cc(0x01)
	enum class EBurstMethod BurstMethod; // 0x5cd(0x01)
	char pad_5CE[0x2]; // 0x5ce(0x02)
	float RadSafeSlopeToBurstOn; // 0x5d0(0x04)
	float GoldenSpiralMinRadiusSquared; // 0x5d4(0x04)
	struct TArray<struct ASolarBurstItemActor*> BurstItemActors; // 0x5d8(0x10)
	struct FVector MeshBoxExtent; // 0x5e8(0x0c)
	char pad_5F4[0x4]; // 0x5f4(0x04)
	struct UAkComponent* AkAudioComponent; // 0x5f8(0x08)
	struct USolarAkGameObject* SolarAkGameObject; // 0x600(0x08)

	void UpdateTreasureBoxInternal(); // Function Solarland.SolarTreasureBoxActor.UpdateTreasureBoxInternal // (Native|Public) // @ game+0x1ae49f0
	void UpdateOpenBoxUIByState(enum class ETreasureBoxState NewState); // Function Solarland.SolarTreasureBoxActor.UpdateOpenBoxUIByState // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void UpdateItemDataListInternal(); // Function Solarland.SolarTreasureBoxActor.UpdateItemDataListInternal // (Final|Native|Public) // @ game+0x2965930
	void ServerSetState(enum class ETreasureBoxState NewState, struct ASolarCharacter* RequestCharacter); // Function Solarland.SolarTreasureBoxActor.ServerSetState // (Final|Native|Public) // @ game+0x2965560
	void ServerNotifyPlayerOpen(struct ASolarCharacter* RequestCharacter, enum class EItemType InItemType); // Function Solarland.SolarTreasureBoxActor.ServerNotifyPlayerOpen // (Final|Native|Public) // @ game+0x29652a0
	void PlayOpenAnimation(); // Function Solarland.SolarTreasureBoxActor.PlayOpenAnimation // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnRep_ItemDataList(); // Function Solarland.SolarTreasureBoxActor.OnRep_ItemDataList // (Final|Native|Public) // @ game+0x2965280
	void OnRep_CurrentState(); // Function Solarland.SolarTreasureBoxActor.OnRep_CurrentState // (Final|Native|Public) // @ game+0x29651c0
	void OnClientItemHighestQualityChanged(int32_t NewQuality, int32_t PrevQuality); // Function Solarland.SolarTreasureBoxActor.OnClientItemHighestQualityChanged // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x29650f0
	bool IsEmpty(); // Function Solarland.SolarTreasureBoxActor.IsEmpty // (Final|Native|Public) // @ game+0x2965060
	void InitSolarAkGameObject(struct UActorComponent* Component, bool bReset); // Function Solarland.SolarTreasureBoxActor.InitSolarAkGameObject // (Final|Native|Protected) // @ game+0x2964f60
	int32_t GetNumCost(); // Function Solarland.SolarTreasureBoxActor.GetNumCost // (Final|Native|Public|Const) // @ game+0x2964b40
	struct TArray<struct FSolarItemData> GetItemList(); // Function Solarland.SolarTreasureBoxActor.GetItemList // (Final|Native|Public) // @ game+0x29649e0
	enum class ECostType GetCostType(); // Function Solarland.SolarTreasureBoxActor.GetCostType // (Final|Native|Public|Const) // @ game+0x29649c0
	void ConstructTreasureBoxTest(struct TArray<int32_t>& itemIdList); // Function Solarland.SolarTreasureBoxActor.ConstructTreasureBoxTest // (Final|Native|Public|HasOutParms) // @ game+0xb67640
	void ConstructTreasureBox(int32_t dropId); // Function Solarland.SolarTreasureBoxActor.ConstructTreasureBox // (Final|Native|Public) // @ game+0x1ae6850
	bool BOpened(); // Function Solarland.SolarTreasureBoxActor.BOpened // (Native|Public) // @ game+0x2964850
};

// Class Solarland.AirDropTreasureBox
// Size: 0xc90 (Inherited: 0x608)
struct AAirDropTreasureBox : ASolarTreasureBoxActor {
	bool bPendingDestroy; // 0x608(0x01)
	char pad_609[0x3]; // 0x609(0x03)
	float openProgress; // 0x60c(0x04)
	struct ASolarCharacter* OpeningCharacter; // 0x610(0x08)
	float OpenTime; // 0x618(0x04)
	float ProtectionTime; // 0x61c(0x04)
	char pad_620[0x10]; // 0x620(0x10)
	float StartDropHeight; // 0x630(0x04)
	struct FVector TargetLocation; // 0x634(0x0c)
	struct FRotator TargetRotation; // 0x640(0x0c)
	struct FVector SummonCharLocation; // 0x64c(0x0c)
	float RecordDropTime; // 0x658(0x04)
	char pad_65C[0x4]; // 0x65c(0x04)
	enum class EAirDropMovementState MovementState; // 0x660(0x01)
	char pad_661[0x3]; // 0x661(0x03)
	float InitialHeight; // 0x664(0x04)
	float DropGravity; // 0x668(0x04)
	float MaxDropSpeed; // 0x66c(0x04)
	float DecelerateHeight; // 0x670(0x04)
	float ApplyDamageHeight; // 0x674(0x04)
	float DecelerateTime; // 0x678(0x04)
	char pad_67C[0x4]; // 0x67c(0x04)
	struct UCurveFloat* DecelerateCurve; // 0x680(0x08)
	float SqueezePawnRadius; // 0x688(0x04)
	float ThrustPawnStrength; // 0x68c(0x04)
	float CollideUpBoundingRatio; // 0x690(0x04)
	float CollidePushUpAngle; // 0x694(0x04)
	struct UCurveFloat* CollidePushSpeedCurve; // 0x698(0x08)
	char pad_6A0[0x38]; // 0x6a0(0x38)
	float ApplyDamageRate; // 0x6d8(0x04)
	char pad_6DC[0x4]; // 0x6dc(0x04)
	struct FSolarDamageInfo DamageInfo; // 0x6e0(0x40)
	char pad_720[0x8]; // 0x720(0x08)
	enum class EAirDropOpenState OpenState; // 0x728(0x01)
	char pad_729[0x7]; // 0x729(0x07)
	struct FString SummonPlayerID; // 0x730(0x10)
	struct TSoftObjectPtr<UParticleSystem> OpenAirdropEffect; // 0x740(0x28)
	struct TSoftObjectPtr<UParticleSystem> LandHitEffect; // 0x768(0x28)
	struct TSoftObjectPtr<UParticleSystem> LandSmokeEffect; // 0x790(0x28)
	struct TSoftObjectPtr<UParticleSystem> PendingDestroyEffect; // 0x7b8(0x28)
	struct TSoftObjectPtr<UParticleSystem> DestroyEffect; // 0x7e0(0x28)
	struct TSoftObjectPtr<UParticleSystem> FallingEffect; // 0x808(0x28)
	struct TSoftObjectPtr<UParticleSystem> FallingImpulseEffect; // 0x830(0x28)
	struct TSoftObjectPtr<UParticleSystem> LightBeamEffect; // 0x858(0x28)
	struct FTransform FallingEffectOffset; // 0x880(0x30)
	struct FTransform FallingImpulseEffectOffset; // 0x8b0(0x30)
	struct FTransform LightBeamEffectOffset; // 0x8e0(0x30)
	struct FTransform PendingDestroyEffectOffset; // 0x910(0x30)
	struct UAnimationAsset* LandAnimation; // 0x940(0x08)
	struct UAnimationAsset* OpenAnimation; // 0x948(0x08)
	float ShowLandSmokeHeight; // 0x950(0x04)
	float AirDropSpawnDelay; // 0x954(0x04)
	float FallingEffectDelay; // 0x958(0x04)
	bool bSummonBySkill; // 0x95c(0x01)
	char pad_95D[0x3]; // 0x95d(0x03)
	float YawOffset; // 0x960(0x04)
	char pad_964[0x4]; // 0x964(0x04)
	struct USkeletalMeshComponent* SkeletalMeshComp; // 0x968(0x08)
	char pad_970[0x8]; // 0x970(0x08)
	struct UParticleSystemComponent* LandSmokePSC; // 0x978(0x08)
	struct UParticleSystemComponent* PendingDestroyPSC; // 0x980(0x08)
	struct UParticleSystemComponent* FallingPSC; // 0x988(0x08)
	struct UParticleSystemComponent* FallingImpulsePSC; // 0x990(0x08)
	struct UParticleSystemComponent* LightBeamPSC; // 0x998(0x08)
	char pad_9A0[0x8]; // 0x9a0(0x08)
	struct FSoftClassPath AirDropGuideMeshBPClassPath; // 0x9a8(0x18)
	float GuideArrowDisappearHeight; // 0x9c0(0x04)
	char pad_9C4[0x4]; // 0x9c4(0x04)
	struct FString SNameAirDropOpen; // 0x9c8(0x10)
	struct FString SNameLandHit; // 0x9d8(0x10)
	struct FString SNameAirDropSpawn; // 0x9e8(0x10)
	struct FString SNameStartDrop; // 0x9f8(0x10)
	struct FString SNameStopDrop; // 0xa08(0x10)
	struct FString SNameDecelerateAudio; // 0xa18(0x10)
	struct FString SNamePlayLandedLoopAudio; // 0xa28(0x10)
	struct FString SNameStopLandedLoopAudio; // 0xa38(0x10)
	struct FString SNamePlayOnGroundBroadcastLoopAudio; // 0xa48(0x10)
	struct FString SNameStopOnGroundBroadcastLoopAudio; // 0xa58(0x10)
	struct FString SNamePlayStartHackAudio; // 0xa68(0x10)
	struct FString SNameStopStartHackAudio; // 0xa78(0x10)
	struct FString SNamePlayHackingLoopAudio; // 0xa88(0x10)
	struct FString SNameStopHackingLoopAudio; // 0xa98(0x10)
	struct FString SNameStopHackingLoopAudioAux; // 0xaa8(0x10)
	struct FString PendingDestroyLoopStart; // 0xab8(0x10)
	struct FString PendingDestroyLoopEnd; // 0xac8(0x10)
	struct FString SNameDestroySound; // 0xad8(0x10)
	char pad_AE8[0x68]; // 0xae8(0x68)
	struct FName ColorKeyTag1; // 0xb50(0x08)
	struct FName ColorKeyTag2; // 0xb58(0x08)
	struct FName ColorKeyGlow; // 0xb60(0x08)
	struct FName ColorKeyMesh; // 0xb68(0x08)
	struct FName AlphaKey; // 0xb70(0x08)
	struct FName LightBeamAlphaKey; // 0xb78(0x08)
	struct FName ColorKeyTagFlow1; // 0xb80(0x08)
	struct FName ColorKeyTagFlow2; // 0xb88(0x08)
	struct FName ColorKeyLightEffect; // 0xb90(0x08)
	float FadeTweenDuration; // 0xb98(0x04)
	float RedTweenDuration; // 0xb9c(0x04)
	struct FLinearColor BlueColorTag1; // 0xba0(0x10)
	struct FLinearColor RedColorTag1; // 0xbb0(0x10)
	struct FLinearColor BlueColorTag2; // 0xbc0(0x10)
	struct FLinearColor RedColorTag2; // 0xbd0(0x10)
	struct FLinearColor BlueColorGlow; // 0xbe0(0x10)
	struct FLinearColor RedColorGlow; // 0xbf0(0x10)
	struct FLinearColor BlueColorMesh; // 0xc00(0x10)
	struct FLinearColor RedColorMesh; // 0xc10(0x10)
	struct FLinearColor RedColorTagFlow1; // 0xc20(0x10)
	struct FLinearColor RedColorTagFlow2; // 0xc30(0x10)
	struct FLinearColor BlueColorTagFlow1; // 0xc40(0x10)
	struct FLinearColor BlueColorTagFlow2; // 0xc50(0x10)
	struct FLinearColor RedColorLightEffect; // 0xc60(0x10)
	struct FLinearColor BlueColorLightEffect; // 0xc70(0x10)
	char pad_C80[0x10]; // 0xc80(0x10)

	void ReceiveOnOpenStateChanged(enum class EAirDropOpenState InPrevOpenState, enum class EAirDropOpenState InCurrOpenState); // Function Solarland.AirDropTreasureBox.ReceiveOnOpenStateChanged // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void PlayLandingAnimation(); // Function Solarland.AirDropTreasureBox.PlayLandingAnimation // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	bool OpenAirDropTreasureBox(struct ASolarCharacter* _OpeningCharacter); // Function Solarland.AirDropTreasureBox.OpenAirDropTreasureBox // (Final|Native|Public) // @ game+0x2650220
	void OnStateChanged(); // Function Solarland.AirDropTreasureBox.OnStateChanged // (Native|Public) // @ game+0x7cf0d0
	void OnRep_TargetLocation(struct FVector PreTargetLocation); // Function Solarland.AirDropTreasureBox.OnRep_TargetLocation // (Final|Native|Private|HasDefaults) // @ game+0x2650190
	void OnRep_SummonPlayerID(); // Function Solarland.AirDropTreasureBox.OnRep_SummonPlayerID // (Final|Native|Private) // @ game+0x2650170
	void OnRep_SummonCharLocation(); // Function Solarland.AirDropTreasureBox.OnRep_SummonCharLocation // (Final|Native|Private) // @ game+0x9043b0
	void OnRep_StartDropHeight(); // Function Solarland.AirDropTreasureBox.OnRep_StartDropHeight // (Final|Native|Private) // @ game+0x2650150
	void OnRep_RecordDropTime(float PreDropTime); // Function Solarland.AirDropTreasureBox.OnRep_RecordDropTime // (Final|Native|Private) // @ game+0x26500d0
	void OnRep_PendingDestroy(); // Function Solarland.AirDropTreasureBox.OnRep_PendingDestroy // (Final|Native|Public) // @ game+0x26500b0
	void OnRep_OpenState(enum class EAirDropOpenState PreOpenState); // Function Solarland.AirDropTreasureBox.OnRep_OpenState // (Final|Native|Private) // @ game+0x2650030
	void OnRep_OpenProgressChange(); // Function Solarland.AirDropTreasureBox.OnRep_OpenProgressChange // (Final|Native|Private) // @ game+0x2650010
	void OnRep_OpenCharacterChange(); // Function Solarland.AirDropTreasureBox.OnRep_OpenCharacterChange // (Final|Native|Private) // @ game+0x264fff0
	void OnRep_MovementState(enum class EAirDropMovementState PreMovementState); // Function Solarland.AirDropTreasureBox.OnRep_MovementState // (Final|Native|Private) // @ game+0x264ff70
	void OnMovementStateChanged(enum class EAirDropMovementState InPrevMovementState, enum class EAirDropMovementState InCurrMovementState); // Function Solarland.AirDropTreasureBox.OnMovementStateChanged // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnFadeOutFallingEffect(); // Function Solarland.AirDropTreasureBox.OnFadeOutFallingEffect // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	bool IsSummonedByCharacter(); // Function Solarland.AirDropTreasureBox.IsSummonedByCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x264fbb0
	bool IsOpenningCharacterOffline(); // Function Solarland.AirDropTreasureBox.IsOpenningCharacterOffline // (Final|Native|Protected) // @ game+0x264fb80
	bool IsCharacterInRange(struct ASolarCharacter* InCheckCharacter); // Function Solarland.AirDropTreasureBox.IsCharacterInRange // (Final|Native|Protected) // @ game+0x264fae0
	bool CancelOpenAirDropTreasureBox(struct ASolarCharacter* _OpeningCharacter); // Function Solarland.AirDropTreasureBox.CancelOpenAirDropTreasureBox // (Final|Native|Public) // @ game+0x264f5c0
};

// Class Solarland.AirlineCruiseCompInterface
// Size: 0x28 (Inherited: 0x28)
struct UAirlineCruiseCompInterface : UInterface {

	struct UAirlineCruiseComponent* GetAirlineCruiseComponent(); // Function Solarland.AirlineCruiseCompInterface.GetAirlineCruiseComponent // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x26525f0
};

// Class Solarland.GameModeCompBase
// Size: 0xd0 (Inherited: 0xb0)
struct UGameModeCompBase : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	bool bPreStartPlay; // 0xb8(0x01)
	bool bTakeChargeStartPlay; // 0xb9(0x01)
	bool bPostStartPlay; // 0xba(0x01)
	char pad_BB[0x2]; // 0xbb(0x02)
	bool bPreHandleMatchHasStarted; // 0xbd(0x01)
	bool bTakeChargeHandleMatchHasStarted; // 0xbe(0x01)
	bool bPostHandleMatchHasStarted; // 0xbf(0x01)
	char pad_C0[0x2]; // 0xc0(0x02)
	bool bPreRestartPlayer; // 0xc2(0x01)
	bool bTakeChargeRestartPlayer; // 0xc3(0x01)
	bool bPostRestartPlayer; // 0xc4(0x01)
	char pad_C5[0x2]; // 0xc5(0x02)
	bool bPreEndPlay; // 0xc7(0x01)
	bool bTakeChargeEndPlay; // 0xc8(0x01)
	bool bPostEndPlay; // 0xc9(0x01)
	char pad_CA[0x6]; // 0xca(0x06)

	void PreStartPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreStartPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x26afd10
	void PreRestartPlayerBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PreRestartPlayerBind // (Final|Native|Protected|HasOutParms) // @ game+0x26afc10
	void PreHandleMatchHasStartedBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreHandleMatchHasStartedBind // (Final|Native|Protected|HasOutParms) // @ game+0x26afb60
	void PreGameModeStartPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26afab0
	void PreGameModeRestartPlayer(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PreGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26af9b0
	void PreGameModeHandleMatchHasStarted(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26af900
	void PreGameModeEndPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PreGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26af800
	void PreEndPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PreEndPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x26af700
	void PostStartPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostStartPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x26af650
	void PostRestartPlayerBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PostRestartPlayerBind // (Final|Native|Protected|HasOutParms) // @ game+0x26af550
	void PostHandleMatchHasStartedBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostHandleMatchHasStartedBind // (Final|Native|Protected|HasOutParms) // @ game+0x26af4a0
	void PostGameModeStartPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26af3f0
	void PostGameModeRestartPlayer(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PostGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26af2f0
	void PostGameModeHandleMatchHasStarted(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26af240
	void PostGameModeEndPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PostGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26af140
	void PostEndPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PostEndPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x26af040
	void OnGameModeStartPlay(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.OnGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26aed10
	void OnGameModeRestartPlayer(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.OnGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26aebc0
	void OnGameModeHandleMatchHasStarted(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.OnGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26aeab0
	void OnGameModeEndPlay(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.OnGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x26ae960
	struct ASolarGameMode* GetGameModeOwner(); // Function Solarland.GameModeCompBase.GetGameModeOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26ae600
};

// Class Solarland.AirlineCruiseComponent
// Size: 0x148 (Inherited: 0xd0)
struct UAirlineCruiseComponent : UGameModeCompBase {
	int32_t UsedAirlineID; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct ASolarCapsuleRoot* CapsuleRootClass; // 0xd8(0x08)
	struct ASolarCapsuleRoot* CapsuleRoot; // 0xe0(0x08)
	struct TMap<int32_t, struct FAirlineData> AirlineDataList; // 0xe8(0x50)
	struct ASolarCharacter* CruiseTemplate; // 0x138(0x08)
	char pad_140[0x8]; // 0x140(0x08)

	void OnPlayerJoin(struct ASCMPlayerState* PlayerState); // Function Solarland.AirlineCruiseComponent.OnPlayerJoin // (Final|Native|Protected) // @ game+0x26538e0
	void OnCruiseCompleted(struct AActor* DestroyedRoot); // Function Solarland.AirlineCruiseComponent.OnCruiseCompleted // (Final|Native|Protected) // @ game+0x2653970
	void OnAIJoin(struct ASCMPlayerState* PlayerState); // Function Solarland.AirlineCruiseComponent.OnAIJoin // (Final|Native|Protected) // @ game+0x26538e0
	int32_t GetUsedAirlineData(struct FAirlineData& OutData); // Function Solarland.AirlineCruiseComponent.GetUsedAirlineData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x2652620
};

// Class Solarland.AirPlaneVehicleDataAsset
// Size: 0x4d0 (Inherited: 0x30)
struct UAirPlaneVehicleDataAsset : UDataAsset {
	struct FRuntimeFloatCurve AdditionalLiftCurveBasedOnVelocity; // 0x30(0x88)
	struct FRuntimeFloatCurve AdditionalLiftCurveBasedOnVelocityZ; // 0xb8(0x88)
	struct FRuntimeFloatCurve AdditionalLiftCurveBasedOnPitch; // 0x140(0x88)
	struct FRuntimeFloatCurve AdditionalLiftForPitchUpFactorCurve; // 0x1c8(0x88)
	float AdditionalLiftForClampGravity; // 0x250(0x04)
	char pad_254[0x4]; // 0x254(0x04)
	struct FRuntimeFloatCurve AdditionalLiftCurveForPitchUp; // 0x258(0x88)
	struct FRuntimeFloatCurve CruisingSpeedMultiplier; // 0x2e0(0x88)
	struct FGameplayTag RollingCostTag; // 0x368(0x08)
	float CruisingRotateAccelaration; // 0x370(0x04)
	float CruisingRotateDecelaration; // 0x374(0x04)
	float CruisingMaxAngularSpeed; // 0x378(0x04)
	float CruisingClampMaxSpeedMultiplier; // 0x37c(0x04)
	struct FGameplayTagContainer CancelCruisingTags; // 0x380(0x20)
	float RollBackEndSpeed; // 0x3a0(0x04)
	float RollBackCameraDuration; // 0x3a4(0x04)
	struct TArray<struct FVehicleVFX> ThrusterParticles; // 0x3a8(0x10)
	float ThrusterParticleWithThrottle; // 0x3b8(0x04)
	float ThrusterParticleWithoutThrottle; // 0x3bc(0x04)
	float ThrusterParticleSpeed; // 0x3c0(0x04)
	float ThrusterParticleDeactivateSpeed; // 0x3c4(0x04)
	struct TArray<struct FVehicleVFX> WingParticles; // 0x3c8(0x10)
	float WingParticleSpeed; // 0x3d8(0x04)
	float WingParticleDeactivateSpeed; // 0x3dc(0x04)
	float PreTakeOffDuration; // 0x3e0(0x04)
	float PreTakeOffHoverForceMultiplier; // 0x3e4(0x04)
	float TakingOffPitchOffset; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct FRuntimeFloatCurve TakingOffStabilizeSpeedCurve; // 0x3f0(0x88)
	int32_t AmmoMaterialIndex; // 0x478(0x04)
	struct FName MataterialProgressParam; // 0x47c(0x08)
	struct FName MataterialColorParam; // 0x484(0x08)
	struct FLinearColor NormalColor; // 0x48c(0x10)
	struct FLinearColor ReloadingColor; // 0x49c(0x10)
	struct FFloatRange MataterialProgressRange; // 0x4ac(0x10)
	char pad_4BC[0x4]; // 0x4bc(0x04)
	struct TArray<struct FVehicleVFX> BulletSocketParticles; // 0x4c0(0x10)
};

// Class Solarland.AmmoConfig
// Size: 0x750 (Inherited: 0x30)
struct UAmmoConfig : UDataAsset {
	enum class EHoldActionType HoldAction; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<struct FFireChargeData> FireChargeDatas; // 0x38(0x10)
	struct FString FireChargeStopSoundName; // 0x48(0x10)
	float ChargingToleranceEndTime; // 0x58(0x04)
	float ChargingWorkingEndTime; // 0x5c(0x04)
	float ChargingHoldingEndTime; // 0x60(0x04)
	float ChargingTrajectoryTime; // 0x64(0x04)
	bool bScaleHitEffectByChargingTime; // 0x68(0x01)
	bool bCostToChargeScale; // 0x69(0x01)
	char pad_6A[0x2]; // 0x6a(0x02)
	int32_t FireCostFullShot; // 0x6c(0x04)
	bool bForceFullShot; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float MaxChargingDamageScale; // 0x74(0x04)
	float DeltaAngle; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct FString Name; // 0x80(0x10)
	struct FString Des; // 0x90(0x10)
	int32_t PropID; // 0xa0(0x04)
	float LifeTime; // 0xa4(0x04)
	enum class EFireMethodType FireMethodType; // 0xa8(0x01)
	enum class ETrajectoryType TrajectoryType; // 0xa9(0x01)
	char pad_AA[0x2]; // 0xaa(0x02)
	float CustomValue; // 0xac(0x04)
	struct ASolarBullet* BulletClass; // 0xb0(0x08)
	struct FSoftClassPath BulletClassPath; // 0xb8(0x18)
	enum class ETriggerType TriggerType; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	float MaxRange; // 0xd4(0x04)
	float EffRange; // 0xd8(0x04)
	float Radius; // 0xdc(0x04)
	float InitSpeed; // 0xe0(0x04)
	enum class ECostFireType FireCostType; // 0xe4(0x01)
	char pad_E5[0x3]; // 0xe5(0x03)
	int32_t FireCostPerAttack; // 0xe8(0x04)
	int32_t FireSpeedChangeTime; // 0xec(0x04)
	float FireSpeedChangeCOP; // 0xf0(0x04)
	float FastestFireInterval; // 0xf4(0x04)
	float SlowestFireInterval; // 0xf8(0x04)
	float BaseFireInterval; // 0xfc(0x04)
	float FireIntervalRevertPreTime; // 0x100(0x04)
	float FireIntervalReavertSpeed; // 0x104(0x04)
	float BoltActionTime; // 0x108(0x04)
	float StartBoltDuration; // 0x10c(0x04)
	float FirePrepareTime; // 0x110(0x04)
	float FireStateBreakTime; // 0x114(0x04)
	float FireStreakBreakTime; // 0x118(0x04)
	float BaseReloadTime; // 0x11c(0x04)
	float ReloadBoltTime; // 0x120(0x04)
	float PostFireOverload; // 0x124(0x04)
	bool bPlayHitSound; // 0x128(0x01)
	bool bPlayExplodeSound; // 0x129(0x01)
	char pad_12A[0x2]; // 0x12a(0x02)
	float FlySoundReceiveRadius; // 0x12c(0x04)
	float FlySoundIgnoreDistance; // 0x130(0x04)
	int32_t SingleSoundCount; // 0x134(0x04)
	struct FString Play_Land_Common_Hit_1P; // 0x138(0x10)
	struct FString Play_Land_Common_Hit_3P; // 0x148(0x10)
	struct FString Play_Land_Common_Hit_3P_Enemy; // 0x158(0x10)
	struct FString Play_Land_Fly_Once_3P; // 0x168(0x10)
	struct FString Play_Land_Fly_Once_3P_Enemy; // 0x178(0x10)
	struct FString Play_Land_Fly_Loop_1P; // 0x188(0x10)
	struct FString Play_Land_Fly_Loop_3P; // 0x198(0x10)
	struct FString Play_Land_Fly_Loop_3P_Enemy; // 0x1a8(0x10)
	struct FString Stop_Land_Fly_Loop_1P; // 0x1b8(0x10)
	struct FString Stop_Land_Fly_Loop_3P; // 0x1c8(0x10)
	struct FString Stop_Land_Fly_Loop_3P_Enemy; // 0x1d8(0x10)
	struct FString Play_Fire_Empty_1p; // 0x1e8(0x10)
	struct FString Play_Fire_Empty_3p; // 0x1f8(0x10)
	struct FString Play_Fire_Empty_3p_Enemy; // 0x208(0x10)
	struct UCurveFloat* PostFireSpreadCurveStruct; // 0x218(0x08)
	float VhADSSpreadCOP; // 0x220(0x04)
	float ADSSpreadCOP; // 0x224(0x04)
	float SpreadFirePreTime; // 0x228(0x04)
	float SpreadPostFireSpeed; // 0x22c(0x04)
	float SpreadRestorePreTime; // 0x230(0x04)
	float SpreadRestoreSpeed; // 0x234(0x04)
	struct FWeaponFireTPPAnimConfig TPPRecoilConfig; // 0x238(0x28)
	struct FWeaponFireFPPAnimConfig FPPRecoilConfigNoScope; // 0x260(0x70)
	struct FWeaponFireFPPAnimConfig FPPRecoilConfigWithScope; // 0x2d0(0x70)
	struct FAmmonVerticalRecoilStruct PitchRecoilStruct; // 0x340(0x30)
	struct FAmmonHorizontalRecoilStruct YawRecoilStruct; // 0x370(0x30)
	struct FAmmonRecoilRollStruct RollRecoilStruct; // 0x3a0(0x40)
	struct FAmmonRecoilScope ScopeRecoil; // 0x3e0(0xb8)
	float ADSRecoilCOP; // 0x498(0x04)
	char pad_49C[0x4]; // 0x49c(0x04)
	struct TMap<struct FString, float> RecoilCOPMap; // 0x4a0(0x50)
	struct TArray<enum class EPhysicalSurface> IgnoreEPhysicalSurface; // 0x4f0(0x10)
	float ProjectileMaxGravity; // 0x500(0x04)
	float ParticleStartDistance; // 0x504(0x04)
	float TrajectoryStartDistance; // 0x508(0x04)
	bool bPenetrable; // 0x50c(0x01)
	bool bTakeDamageAfterDeathVerge; // 0x50d(0x01)
	char pad_50E[0x2]; // 0x50e(0x02)
	struct UCurveFloat* PenetrationDamageMultiplierCurve; // 0x510(0x08)
	struct UCurveFloat* CylinderDamageMultiplierCurve; // 0x518(0x08)
	struct FSlateBrush TriggerIcon; // 0x520(0xe0)
	enum class EVirtualBulletType VirtualBulletType; // 0x600(0x01)
	bool bStepOnServer; // 0x601(0x01)
	bool bUseSubStepping; // 0x602(0x01)
	char pad_603[0x1]; // 0x603(0x01)
	float MaxSimulationTimeStep; // 0x604(0x04)
	int32_t MaxSimulationIterations; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct UAmmoConfig* TraceOverrideAmmo; // 0x610(0x08)
	char TraceTargetFlag; // 0x618(0x01)
	char pad_619[0x7]; // 0x619(0x07)
	struct FTracerBulletData TracerData; // 0x620(0x40)
	struct UCurveFloat* BulletOffsetCurve; // 0x660(0x08)
	struct TArray<struct FVector2D> BulletOffsetAngles; // 0x668(0x10)
	struct UCurveFloat* BulletDamageCurve; // 0x678(0x08)
	struct UCurveFloat* BulletScaleCurve; // 0x680(0x08)
	struct UCurveFloat* BulletMovementCurve; // 0x688(0x08)
	bool bThirdPesonViewXScaledByDistance; // 0x690(0x01)
	bool bForceApplyAbility; // 0x691(0x01)
	char pad_692[0x6]; // 0x692(0x06)
	struct TArray<struct ASolarAbility*> AmmoAbilityClasses; // 0x698(0x10)
	struct TArray<struct ASolarAbility*> AmmoAbilityClassesOnDestroyed; // 0x6a8(0x10)
	struct ASolarAbility* AmmoAbilityClassesOnSelf; // 0x6b8(0x08)
	int32_t NameLocalTextIDNumber; // 0x6c0(0x04)
	int32_t DescriptionLocalTextIDNumber; // 0x6c4(0x04)
	int32_t RangeLocalTextID; // 0x6c8(0x04)
	int32_t DifficultyLocalTextID; // 0x6cc(0x04)
	struct FSolarDamageInfo DamageInfo; // 0x6d0(0x40)
	struct FSolarDamageInfo DestroyDamageInfo; // 0x710(0x40)

	void InitVerticalRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax); // Function Solarland.AmmoConfig.InitVerticalRecoilStruct // (Final|Native|Public|Const) // @ game+0x26536c0
	void InitSpreadData(float adscop, float vhadscop, float firepre, float changespeed, float restorepre, float restorespeed); // Function Solarland.AmmoConfig.InitSpreadData // (Final|Native|Public|Const) // @ game+0x26534c0
	void InitScopeRollRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax, float adscop); // Function Solarland.AmmoConfig.InitScopeRollRecoilStruct // (Final|Native|Public|Const) // @ game+0x2653260
	void InitScopeAndCrossHairVibration(float ScopeVMaxDistanceOffSet, float ScopeVVibrationDuration, float ScopeHMaxDistanceOffSet, float ScopeHVibrationDuration, float ScopeVContinuousFallingDuration, float ScopeVContinuousFallingPointIndex, float VMaxDistanceOffSetScale, float VVibrationDurationScale, float VSingleOffSetScale, float VContinuousOffSetScale, float HMaxDistanceOffSetScale, float HVibrationDurationScale, float HSingleOffSetScale, float HContinuousOffSetScale, float HOffSetProbabilityScale); // Function Solarland.AmmoConfig.InitScopeAndCrossHairVibration // (Final|Native|Public|Const) // @ game+0x2652dc0
	void InitRollRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax, float adscop); // Function Solarland.AmmoConfig.InitRollRecoilStruct // (Final|Native|Public|Const) // @ game+0x2652b60
	void InitRecoilCOPMap(struct TArray<struct FString>& Keys, struct TArray<float>& Values); // Function Solarland.AmmoConfig.InitRecoilCOPMap // (Final|Native|Public|HasOutParms|Const) // @ game+0x2652a20
	void InitPostFireSpreadCurveStruct(struct FString Path); // Function Solarland.AmmoConfig.InitPostFireSpreadCurveStruct // (Final|Native|Public|Const) // @ game+0x2652980
	void InitHorizontalRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax); // Function Solarland.AmmoConfig.InitHorizontalRecoilStruct // (Final|Native|Public|Const) // @ game+0x2652760
	void InitBaseData(int32_t Trigger); // Function Solarland.AmmoConfig.InitBaseData // (Final|Native|Public|Const) // @ game+0x26526d0
};

// Class Solarland.AmmoCanisterConfig
// Size: 0x760 (Inherited: 0x750)
struct UAmmoCanisterConfig : UAmmoConfig {
	int32_t ShrapnelSum; // 0x750(0x04)
	int32_t MaxShrapnelEffectSum; // 0x754(0x04)
	char pad_758[0x8]; // 0x758(0x08)
};

// Class Solarland.AmmoGravityLineConfig
// Size: 0x750 (Inherited: 0x750)
struct UAmmoGravityLineConfig : UAmmoConfig {
};

// Class Solarland.AndroidInputManager
// Size: 0x38 (Inherited: 0x28)
struct UAndroidInputManager : UObject {
	struct FMulticastInlineDelegate OnAndroidBackPressed; // 0x28(0x10)
};

// Class Solarland.AnimNotify_ChangeWeaponAttachState
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_ChangeWeaponAttachState : UAnimNotify {
	enum class EWeaponSlotType EWeaponSlot; // 0x38(0x01)
	enum class EWeaponAttachState AttachState; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Solarland.AnimNotify_CharacterFootEffect
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_CharacterFootEffect : UAnimNotify {
	struct TArray<struct FFootEffect> FootEffectList; // 0x38(0x10)

	void AddNewFootEffect(struct FFootEffect& NewEffect); // Function Solarland.AnimNotify_CharacterFootEffect.AddNewFootEffect // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x2659400
};

// Class Solarland.AnimNotify_CharacterPlaySoundGroup
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_CharacterPlaySoundGroup : UAnimNotify {
	struct FName SoundGroupName; // 0x38(0x08)
};

// Class Solarland.AnimNotify_CharacterPlaySoundGroups
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_CharacterPlaySoundGroups : UAnimNotify {
	struct TArray<struct FName> SoundGroupNames; // 0x38(0x10)
};

// Class Solarland.SolarAnimNotify
// Size: 0x40 (Inherited: 0x38)
struct USolarAnimNotify : UAnimNotify {
	bool bDynamic; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotify_CharacterStartSound
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_CharacterStartSound : USolarAnimNotify {
	struct TArray<struct FCharacterSound> SoundList; // 0x40(0x10)
	bool bUseSwitch; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct TArray<struct FString> SwitchGroupNames; // 0x58(0x10)
	bool bUseRTPC; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct TArray<struct FString> RPTCNames; // 0x70(0x10)

	int32_t RemoveAllSwitches(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllSwitches // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2659c80
	int32_t RemoveAllRPTCs(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllRPTCs // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2659c50
	int32_t RemoveAllCharacterSounds(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllCharacterSounds // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2659c20
	void AddNewSwitch(struct FString NewSwitch); // Function Solarland.AnimNotify_CharacterStartSound.AddNewSwitch // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2659560
	void AddNewRPTC(struct FString NewRTPC); // Function Solarland.AnimNotify_CharacterStartSound.AddNewRPTC // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x26594c0
	void AddNewCharacterSound(struct FCharacterSound& NewSound); // Function Solarland.AnimNotify_CharacterStartSound.AddNewCharacterSound // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x2659260
};

// Class Solarland.AnimNotify_CharacterStopSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_CharacterStopSound : UAnimNotify {
	struct TArray<struct FCharacterSound> StopList; // 0x38(0x10)

	int32_t RemoveAllCharacterSoundStops(); // Function Solarland.AnimNotify_CharacterStopSound.RemoveAllCharacterSoundStops // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x2659bf0
	void AddNewCharacterSoundStop(struct FCharacterSound& NewStop); // Function Solarland.AnimNotify_CharacterStopSound.AddNewCharacterSoundStop // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x2659330
};

// Class Solarland.AnimNotify_ExecuteGameplayCueLocal
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_ExecuteGameplayCueLocal : UAnimNotify {
	struct FGameplayCueTag GameplayCueTag; // 0x38(0x08)
};

// Class Solarland.AnimNotify_FlyWaterEffect
// Size: 0x88 (Inherited: 0x38)
struct UAnimNotify_FlyWaterEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	struct FName SocketName; // 0x68(0x08)
	struct FVector LocationOffset; // 0x70(0x0c)
	struct FRotator RotationOffset; // 0x7c(0x0c)
};

// Class Solarland.AnimNotify_LegVehicleRiseDust
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_LegVehicleRiseDust : UAnimNotify {
	struct TArray<int32_t> NotifyFootIndex; // 0x38(0x10)
};

// Class Solarland.AnimNotify_PlayParticleAsync
// Size: 0x120 (Inherited: 0x38)
struct UAnimNotify_PlayParticleAsync : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	struct FSolarSkinnedParticleSystem SkinnedPSTemplate; // 0x68(0x70)
	struct FVector LocationOffset; // 0xd8(0x0c)
	struct FRotator RotationOffset; // 0xe4(0x0c)
	struct FVector Scale; // 0xf0(0x0c)
	char pad_FC[0x14]; // 0xfc(0x14)
	char Attached : 1; // 0x110(0x01)
	char pad_110_1 : 7; // 0x110(0x01)
	char pad_111[0x3]; // 0x111(0x03)
	struct FName SocketName; // 0x114(0x08)
	char pad_11C[0x4]; // 0x11c(0x04)
};

// Class Solarland.AnimNotify_PlayPickupSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_PlayPickupSound : UAnimNotify {
	struct FString DefaultSoundEventName; // 0x38(0x10)

	struct FString GetDefaultSoundEventName(); // Function Solarland.AnimNotify_PlayPickupSound.GetDefaultSoundEventName // (Final|Native|Public|Const) // @ game+0x26596d0
};

// Class Solarland.AnimNotify_ReloadClip
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_ReloadClip : UAnimNotify {
	enum class EAnimReloadNotifyType StepType; // 0x38(0x01)
	enum class EClipAttachType ClipAttachType; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Solarland.AnimNotify_ServerRefreshBones
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ServerRefreshBones : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldEndRecharge
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldEndRecharge : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldHideRechargeFX
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldHideRechargeFX : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldOperatorSet
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldOperatorSet : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldShowRechargeFX
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldShowRechargeFX : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldStartRecharge
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldStartRecharge : UAnimNotify {
};

// Class Solarland.AnimNotify_ThrowThrown
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ThrowThrown : UAnimNotify {
};

// Class Solarland.AnimNotify_VehicleCameraShake
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_VehicleCameraShake : UAnimNotify {
	struct UCameraShake* VehicleCameraShake; // 0x38(0x08)
};

// Class Solarland.AnimNotify_VehiclePlaySound
// Size: 0x60 (Inherited: 0x38)
struct UAnimNotify_VehiclePlaySound : UAnimNotify {
	bool bCheckEnemy; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FString SameTeamSound; // 0x40(0x10)
	struct FString EnemySound; // 0x50(0x10)
};

// Class Solarland.AnimNotify_VehiclePreviewSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_VehiclePreviewSound : UAnimNotify {
	struct FString Sound; // 0x38(0x10)
};

// Class Solarland.AnimNotify_VehicleVFX
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_VehicleVFX : UAnimNotify {
	struct TArray<struct FVehicleVFX> VehicleVFXes; // 0x38(0x10)
};

// Class Solarland.AnimNotify_WeaponBolt
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_WeaponBolt : UAnimNotify {
};

// Class Solarland.AnimNotify_WeaponPlaySoundGroup
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_WeaponPlaySoundGroup : UAnimNotify {
	bool bLastWeapon; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	struct FName SoundGroupName; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Solarland.AnimNotifyState_AddLooseGameplayTag
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_AddLooseGameplayTag : UAnimNotifyState {
	struct FGameplayTagContainer GameplayTags; // 0x30(0x20)
};

// Class Solarland.AnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_AutoCancelOnInputReleased
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_AutoCancelOnInputReleased : UAnimNotifyState {
};

// Class Solarland.SolarAnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct USolarAnimNotifyState : UAnimNotifyState {
	bool bDynamic; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Solarland.AnimNotifyState_CharacterLoopedSound
// Size: 0x58 (Inherited: 0x38)
struct UAnimNotifyState_CharacterLoopedSound : USolarAnimNotifyState {
	struct TArray<struct FCharacterSound> EventListToPlay; // 0x38(0x10)
	struct TArray<struct FCharacterSound> EventListToStop; // 0x48(0x10)
};

// Class Solarland.AnimNotifyState_HideCharacterMesh
// Size: 0x48 (Inherited: 0x30)
struct UAnimNotifyState_HideCharacterMesh : UAnimNotifyState {
	struct FGameplayTag VisibilityTag; // 0x30(0x08)
	bool bPropagateToChildren; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct USceneComponent* ChildrenExceptClass; // 0x40(0x08)
};

// Class Solarland.AnimNotifyState_InhibitAimOffset
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_InhibitAimOffset : UAnimNotifyState {
	float InhibitSmoothTime; // 0x30(0x04)
	float RecoverSmoothTime; // 0x34(0x04)
	bool bCalcRecoverSmoothTimeByRemainingTime; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotifyState_InhibitLeftHandWeaponAttach
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_InhibitLeftHandWeaponAttach : UAnimNotifyState {
	float InhibitSmoothTime; // 0x30(0x04)
	float RecoverSmoothTime; // 0x34(0x04)
	bool bCalcRecoverSmoothTimeByRemainingTime; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotifyState_OpenTreasureBox
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_OpenTreasureBox : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_OverrideHitEffectSurfaceType
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_OverrideHitEffectSurfaceType : UAnimNotifyState {
	enum class EPhysicalSurface SurfaceType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Solarland.AnimNotifyState_PlayGameplayCueLocal
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_PlayGameplayCueLocal : UAnimNotifyState {
	struct FGameplayCueTag GameplayCueTag; // 0x30(0x08)
};

// Class Solarland.AnimNotifyState_RechargeShield
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_RechargeShield : UAnimNotifyState {
	struct FGameplayTagContainer GameplayTags; // 0x30(0x20)
	bool bFXorMesh; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Solarland.AnimNotifyState_RepairVehicleWeakPoints
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_RepairVehicleWeakPoints : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_ShieldUpgradeFX
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_ShieldUpgradeFX : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_SimulatedWeaponAttach
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_SimulatedWeaponAttach : UAnimNotifyState {
	enum class EWeaponSlotType Slot; // 0x30(0x01)
	enum class EWeaponAttachState AttachState; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
};

// Class Solarland.AnimNotifyState_SolarSpawnMeshAndAttach
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_SolarSpawnMeshAndAttach : UAnimNotifyState {
	struct TArray<struct FAttachedMeshInfo> MeshesInfo; // 0x30(0x10)
	struct TArray<struct UStaticMeshComponent*> SpawnedMeshComps; // 0x40(0x10)
};

// Class Solarland.AnimNotifyState_SolarTimedParticleEffect
// Size: 0x120 (Inherited: 0x30)
struct UAnimNotifyState_SolarTimedParticleEffect : UAnimNotifyState {
	bool bAsyncLoad; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	struct FSolarSkinnedParticleSystem SkinnedPSTemplate; // 0x68(0x70)
	bool Attached; // 0xd8(0x01)
	char pad_D9[0x3]; // 0xd9(0x03)
	struct FName SocketName; // 0xdc(0x08)
	struct FVector LocationOffset; // 0xe4(0x0c)
	struct FRotator RotationOffset; // 0xf0(0x0c)
	struct FVector Scale; // 0xfc(0x0c)
	bool bDestroyAtEnd; // 0x108(0x01)
	bool bLockRelativeRotation; // 0x109(0x01)
	char pad_10A[0x16]; // 0x10a(0x16)
};

// Class Solarland.AnimNotifyState_UpgradeShield
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_UpgradeShield : UAnimNotifyState {
	struct FGameplayTagContainer GameplayTags; // 0x30(0x20)
};

// Class Solarland.SolarMeerkatScheduleComponent
// Size: 0xf8 (Inherited: 0xb0)
struct USolarMeerkatScheduleComponent : UActorComponent {
	char pad_B0[0xc]; // 0xb0(0x0c)
	struct FMeerkatConfig MeerkatData; // 0xbc(0x14)
	char pad_D0[0x28]; // 0xd0(0x28)

	void ServerReportRPC(struct FString Key, struct FString Value); // Function Solarland.SolarMeerkatScheduleComponent.ServerReportRPC // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2748890
	void ClientUpdateScheduleConfig(struct FMeerkatConfig AntiCheatConfig); // Function Solarland.SolarMeerkatScheduleComponent.ClientUpdateScheduleConfig // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2747d50
};

// Class Solarland.MeerkatSubScheduleAE
// Size: 0x120 (Inherited: 0xf8)
struct UMeerkatSubScheduleAE : USolarMeerkatScheduleComponent {
	char pad_F8[0x28]; // 0xf8(0x28)
};

// Class Solarland.MeerkatSubScheduleAR
// Size: 0x128 (Inherited: 0xf8)
struct UMeerkatSubScheduleAR : USolarMeerkatScheduleComponent {
	char pad_F8[0x30]; // 0xf8(0x30)
};

// Class Solarland.MeerkatSubScheduleCC
// Size: 0x108 (Inherited: 0xf8)
struct UMeerkatSubScheduleCC : USolarMeerkatScheduleComponent {
	char pad_F8[0x10]; // 0xf8(0x10)
};

// Class Solarland.MeerkatSubScheduleHp
// Size: 0x118 (Inherited: 0xf8)
struct UMeerkatSubScheduleHp : USolarMeerkatScheduleComponent {
	char pad_F8[0x20]; // 0xf8(0x20)

	void ClientNotifySeverHpExceptionOccur(); // Function Solarland.MeerkatSubScheduleHp.ClientNotifySeverHpExceptionOccur // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x7e1650
};

// Class Solarland.MeerkatSubScheduleMB
// Size: 0x1d0 (Inherited: 0xf8)
struct UMeerkatSubScheduleMB : USolarMeerkatScheduleComponent {
	char pad_F8[0xd8]; // 0xf8(0xd8)
};

// Class Solarland.AttributeSubExecCalc
// Size: 0x68 (Inherited: 0x40)
struct UAttributeSubExecCalc : UGameplayEffectExecutionCalculation {
	struct UAttributeSubExecProxy* CDOProxyClass; // 0x40(0x08)
	struct UAttributeSubExecProxy* CDOProxy; // 0x48(0x08)
	char pad_50[0x18]; // 0x50(0x18)
};

// Class Solarland.AttributeSubExecProxy
// Size: 0x30 (Inherited: 0x28)
struct UAttributeSubExecProxy : UObject {
	struct TWeakObjectPtr<struct UAttributeSubExecCalc> CDOOwner; // 0x28(0x08)

	void ModifyAttributeSub(struct USolarAttributeSubComponent* AttrSubComp, enum class EAttributeSubBehavior Behavior, int32_t AttributeSubID, struct FName AttrSubTag, float ModifyValue); // Function Solarland.AttributeSubExecProxy.ModifyAttributeSub // (Final|Native|Protected|BlueprintCallable) // @ game+0x2659a40
	struct FGameplayModifierEvaluatedData MakeExecProxyEvaluated(struct FGameplayAttribute InAttribute, float InMagnitud); // Function Solarland.AttributeSubExecProxy.MakeExecProxyEvaluated // (Final|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x2659750
	void ExecutePureAttributeSub(struct USolarAttributeSubComponent* AttrSubComp, struct TArray<struct FAttributeSubSetting>& InAttributeSubs); // Function Solarland.AttributeSubExecProxy.ExecutePureAttributeSub // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void ExecuteAttributeCalculation(struct USolarAttributeSubComponent* AttrSubComp, struct TArray<struct FAttributeSubSetting>& InAttributeSubs, struct TArray<struct FGameplayAttribute>& InAttribute, struct TArray<struct FGameplayModifierEvaluatedData>& OutModResults); // Function Solarland.AttributeSubExecProxy.ExecuteAttributeCalculation // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	struct UAttributeSubExecProxy* CreateProxy(struct UAttributeSubExecCalc* InCDOOwner, struct UAttributeSubExecProxy* ProxyClass); // Function Solarland.AttributeSubExecProxy.CreateProxy // (Final|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x2659600
};

// Class Solarland.AttributeSubGameplayEffect
// Size: 0x868 (Inherited: 0x848)
struct UAttributeSubGameplayEffect : UGameplayEffect {
	struct TArray<struct FAttributeSubSetting> AttributeSubMods; // 0x848(0x10)
	struct TArray<struct FAttributeSubSetting> PureAttributeSubs; // 0x858(0x10)

	void UpdateAttributeBySub(struct FGameplayAttribute Attribute); // Function Solarland.AttributeSubGameplayEffect.UpdateAttributeBySub // (Final|Native|Public|BlueprintCallable) // @ game+0x265e120
	struct UAttributeSubGameplayEffect* CreateAttributeSubEffectInstance(struct UObject* Outer, struct UAttributeSubExecCalc* AttributeSubCalcClass, struct UAttributeSubGameplayEffect* Class); // Function Solarland.AttributeSubGameplayEffect.CreateAttributeSubEffectInstance // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x265cfb0
	void CancelPureAttributeSub(int32_t AttributeSubID); // Function Solarland.AttributeSubGameplayEffect.CancelPureAttributeSub // (Final|Native|Public|BlueprintCallable) // @ game+0x265ce50
	void CancelAttributeSubModify(struct FGameplayAttribute Attribute, int32_t AttributeSubID); // Function Solarland.AttributeSubGameplayEffect.CancelAttributeSubModify // (Final|Native|Public|BlueprintCallable) // @ game+0x265cc40
	void AddPureAttributeSub(int32_t AttributeSubID, float Value); // Function Solarland.AttributeSubGameplayEffect.AddPureAttributeSub // (Final|Native|Public|BlueprintCallable) // @ game+0x265cb70
	void AddAttributeSubModify(struct FGameplayAttribute Attribute, int32_t AttributeSubID, float Value); // Function Solarland.AttributeSubGameplayEffect.AddAttributeSubModify // (Final|Native|Public|BlueprintCallable) // @ game+0x265c900
};

// Class Solarland.AttributeSubInterface
// Size: 0x28 (Inherited: 0x28)
struct UAttributeSubInterface : UInterface {

	struct USolarAttributeSubComponent* GetAttributeSubComponent(); // Function Solarland.AttributeSubInterface.GetAttributeSubComponent // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x26525f0
};

// Class Solarland.VertAnimMeshComponent
// Size: 0x630 (Inherited: 0x600)
struct UVertAnimMeshComponent : UStaticMeshComponent {
	char pad_600[0x30]; // 0x600(0x30)

	void PlayInfo(struct FVertexAnimInfo& InAnimInfo); // Function Solarland.VertAnimMeshComponent.PlayInfo // (Final|Native|Public|HasOutParms) // @ game+0x29d0f50
	void Play(int32_t InStartFrame, int32_t InEndFrame, float InLength, bool InLoop); // Function Solarland.VertAnimMeshComponent.Play // (Final|Native|Public) // @ game+0x29d0df0
};

// Class Solarland.BackpackVertAnimMeshComponent
// Size: 0x710 (Inherited: 0x630)
struct UBackpackVertAnimMeshComponent : UVertAnimMeshComponent {
	struct FVertexAnimInfo DefaultAnimInfo; // 0x630(0x10)
	struct TMap<enum class EBackPackAnimSubType, struct FVertexAnimInfo> BackPackAnimInfoMap; // 0x640(0x50)
	struct ASolarCharacter* SolarCharacter; // 0x690(0x08)
	struct ASolarBackpackActor* BackPackActor; // 0x698(0x08)
	char pad_6A0[0x70]; // 0x6a0(0x70)
};

// Class Solarland.SolarAttributeSet
// Size: 0x30 (Inherited: 0x30)
struct USolarAttributeSet : UAttributeSet {

	void K2_SetAttributeValue(struct FName AttributeName, float NewVal); // Function Solarland.SolarAttributeSet.K2_SetAttributeValue // (Final|Native|Protected|BlueprintCallable) // @ game+0x2748420
	void K2_OnReplicationAttribute(struct FGameplayAttributeData& OldValue, struct FGameplayAttributeData& ReplicatedAttribute, struct FName AttributeName); // Function Solarland.SolarAttributeSet.K2_OnReplicationAttribute // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x27482d0
	void K2_InitAttributeValue(struct FGameplayAttributeData& OriginAttribute, float NewVal); // Function Solarland.SolarAttributeSet.K2_InitAttributeValue // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x27481e0
	float K2_GetAttributeValue(struct FGameplayAttributeData& OriginAttribute); // Function Solarland.SolarAttributeSet.K2_GetAttributeValue // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x2733060
	struct FGameplayAttribute K2_GetAttribute(struct FName AttributeName); // Function Solarland.SolarAttributeSet.K2_GetAttribute // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x2748080
};

// Class Solarland.BasalAttributeSet
// Size: 0x68 (Inherited: 0x30)
struct UBasalAttributeSet : USolarAttributeSet {
	float MaxHealthCustomScale; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FGameplayAttributeData MaxHealth; // 0x38(0x10)
	struct FGameplayAttributeData CurrentHealth; // 0x48(0x10)
	struct FGameplayAttributeData LockHealth; // 0x58(0x10)

	void OnRep_MaxHealth(struct FGameplayAttributeData& Previous); // Function Solarland.BasalAttributeSet.OnRep_MaxHealth // (Native|Protected|HasOutParms) // @ game+0x265d9e0
	void OnRep_LockHealth(struct FGameplayAttributeData& Previous); // Function Solarland.BasalAttributeSet.OnRep_LockHealth // (Native|Protected|HasOutParms) // @ game+0x265d930
	void OnRep_CurrentHealth(struct FGameplayAttributeData& Previous); // Function Solarland.BasalAttributeSet.OnRep_CurrentHealth // (Native|Protected|HasOutParms) // @ game+0x265d880
};

// Class Solarland.BattleChat
// Size: 0x390 (Inherited: 0x260)
struct UBattleChat : UUserWidget {
	struct UGaugeImage* ChatCDMask; // 0x260(0x08)
	struct UImage* ImgBG; // 0x268(0x08)
	struct UCheckBoxGroup* CBGroupOperation; // 0x270(0x08)
	struct UScrollBox* PanelChatOptions; // 0x278(0x08)
	struct USolarCheckBox* CBoxChatSwitch; // 0x280(0x08)
	struct UWidgetAnimation* AnimChatCooldown; // 0x288(0x08)
	struct UQuickChatUnit* ChatButtonClass; // 0x290(0x08)
	char pad_298[0x8]; // 0x298(0x08)
	struct FSlateBrush SeparatorBrush; // 0x2a0(0xe0)
	char pad_380[0x10]; // 0x380(0x10)

	void SetLogDisplay(bool bDisplay); // Function Solarland.BattleChat.SetLogDisplay // (Final|Native|Protected) // @ game+0x265dec0
	void ReceiveQuickMessage(struct FString InName, struct FString InMessage1, bool bLocalPlayer, bool bSound, int32_t PosInTeam, struct FString InMessage2); // Function Solarland.BattleChat.ReceiveQuickMessage // (Final|Native|Protected) // @ game+0x265dc10
	void ReceiveQuickChatSending(); // Function Solarland.BattleChat.ReceiveQuickChatSending // (Final|Native|Protected) // @ game+0x265dbf0
	void OnGroupOperationStateChanged(struct TArray<struct UCheckBox*>& ChildChangedArray, int32_t CheckedChildIndex); // Function Solarland.BattleChat.OnGroupOperationStateChanged // (Final|Native|Protected|HasOutParms) // @ game+0x265d600
};

// Class Solarland.BattlegroundMapElementActor
// Size: 0x240 (Inherited: 0x228)
struct ABattlegroundMapElementActor : AActor {
	char pad_228[0x8]; // 0x228(0x08)
	struct FBattlegroundMapElementData MapElementData; // 0x230(0x0c)
	char pad_23C[0x4]; // 0x23c(0x04)

	struct FBattlegroundMapElementData GetMapElementData(); // Function Solarland.BattlegroundMapElementActor.GetMapElementData // (Native|Public|BlueprintCallable) // @ game+0x26617e0
	enum class EFactionType GetCurrentOwnerFaction(); // Function Solarland.BattlegroundMapElementActor.GetCurrentOwnerFaction // (Native|Public|BlueprintCallable) // @ game+0x26615d0
};

// Class Solarland.BattlegroundControlPoint
// Size: 0x290 (Inherited: 0x240)
struct ABattlegroundControlPoint : ABattlegroundMapElementActor {
	struct FControlPointData ControlPointData; // 0x240(0x14)
	char pad_254[0x4]; // 0x254(0x04)
	struct UBoxComponent* BoxComp; // 0x258(0x08)
	char pad_260[0x10]; // 0x260(0x10)
	enum class EFactionType ProgressOwnerFaction; // 0x270(0x01)
	enum class EFactionType OccupiedFaction; // 0x271(0x01)
	char pad_272[0x6]; // 0x272(0x06)
	struct TArray<struct ABattlegroundPlayerState*> PlayersInside; // 0x278(0x10)
	char OccupyingProgress; // 0x288(0x01)
	enum class EProgressStatus ProgressStatus; // 0x289(0x01)
	char pad_28A[0x6]; // 0x28a(0x06)

	void OnRep_ProgressStatus(); // Function Solarland.BattlegroundControlPoint.OnRep_ProgressStatus // (Final|Native|Protected) // @ game+0x265daf0
	void OnRep_ProgressOwnerFaction(); // Function Solarland.BattlegroundControlPoint.OnRep_ProgressOwnerFaction // (Final|Native|Protected) // @ game+0x265dad0
	void OnRep_OccupyingProgress(); // Function Solarland.BattlegroundControlPoint.OnRep_OccupyingProgress // (Final|Native|Protected) // @ game+0x265dab0
	void OnRep_OccupiedFaction(); // Function Solarland.BattlegroundControlPoint.OnRep_OccupiedFaction // (Final|Native|Protected) // @ game+0x265da90
	void OnRep_CharactersInside(); // Function Solarland.BattlegroundControlPoint.OnRep_CharactersInside // (Final|Native|Protected) // @ game+0x265d860
	void K2_OnProgressStatusChanged(); // Function Solarland.BattlegroundControlPoint.K2_OnProgressStatusChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void K2_OnProgressOwnerFactionChanged(); // Function Solarland.BattlegroundControlPoint.K2_OnProgressOwnerFactionChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void K2_OnOccupyingProgressChanged(); // Function Solarland.BattlegroundControlPoint.K2_OnOccupyingProgressChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void K2_OnOccupiedFactionChanged(); // Function Solarland.BattlegroundControlPoint.K2_OnOccupiedFactionChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void K2_OnCharactersInsideChanged(); // Function Solarland.BattlegroundControlPoint.K2_OnCharactersInsideChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	bool IsPlayerInSide(struct ABattlegroundPlayerState* InPlayerState); // Function Solarland.BattlegroundControlPoint.IsPlayerInSide // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d4f0
	enum class EBattlegroundPlayerStartRegion GetPlayerStartRegion(struct ABattlegroundPlayerState* InPlayerState); // Function Solarland.BattlegroundControlPoint.GetPlayerStartRegion // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x265d2a0
	struct FControlPointData GetControlPointData(); // Function Solarland.BattlegroundControlPoint.GetControlPointData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d0b0
	void AddOccupyingPersonalScore(); // Function Solarland.BattlegroundControlPoint.AddOccupyingPersonalScore // (Final|Native|Private) // @ game+0x265cb50
};

// Class Solarland.BattlegroundDeployWidget
// Size: 0x400 (Inherited: 0x400)
struct UBattlegroundDeployWidget : USolarUserWidget {
};

// Class Solarland.SolarGameMode
// Size: 0x5a8 (Inherited: 0x310)
struct ASolarGameMode : AGameMode {
	struct FMulticastInlineDelegate PreStartPlay; // 0x310(0x10)
	struct FDelegate CalledStartPlay; // 0x320(0x10)
	struct FMulticastInlineDelegate PostStartPlay; // 0x330(0x10)
	struct FMulticastInlineDelegate PreHandleMatchHasStarted; // 0x340(0x10)
	struct FDelegate CalledHandleMatchHasStarted; // 0x350(0x10)
	struct FMulticastInlineDelegate PostHandleMatchHasStarted; // 0x360(0x10)
	struct FMulticastInlineDelegate PreRestartPlayer; // 0x370(0x10)
	struct FDelegate CalledRestartPlayer; // 0x380(0x10)
	struct FMulticastInlineDelegate PostRestartPlayer; // 0x390(0x10)
	struct FMulticastInlineDelegate PreEndPlay; // 0x3a0(0x10)
	struct FDelegate CalledEndPlay; // 0x3b0(0x10)
	struct FMulticastInlineDelegate PostEndPlay; // 0x3c0(0x10)
	struct TArray<struct UGameModeCompBase*> GameModeComponents; // 0x3d0(0x10)
	char pad_3E0[0x4]; // 0x3e0(0x04)
	int32_t GamePlayMode; // 0x3e4(0x04)
	struct TArray<struct AActor*> ManagerClasses; // 0x3e8(0x10)
	struct FString CharacterClassPath; // 0x3f8(0x10)
	int32_t CharacterIdInTrainningCourse; // 0x408(0x04)
	int32_t SkinIdInTrainningCourse; // 0x40c(0x04)
	int32_t BagIdInTrainingCourse; // 0x410(0x04)
	bool bManuallyModifyCharacter; // 0x414(0x01)
	char pad_415[0x3]; // 0x415(0x03)
	int32_t SpecifiedCharacterSkinID; // 0x418(0x04)
	bool bManuallyModifyCharacterBagId; // 0x41c(0x01)
	char pad_41D[0x3]; // 0x41d(0x03)
	int32_t SpecifiedCharacterBagID; // 0x420(0x04)
	bool bManuallyModifyCharacterBagTrailId; // 0x424(0x01)
	char pad_425[0x3]; // 0x425(0x03)
	int32_t SpecifiedCharacterBagTrailID; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FMulticastInlineDelegate OnPostSpawnDefaultSolarCharacterAtTransform; // 0x430(0x10)
	struct USolarGameModeAIComponent* AIMgrComponent; // 0x440(0x08)
	struct USolarGameModeStatisticsComponent* StatComponent; // 0x448(0x08)
	struct TArray<struct ASolarTeamInfo*> Teams; // 0x450(0x10)
	struct TArray<struct ASolarTeamInfo*> AliveTeams; // 0x460(0x10)
	struct TArray<struct ASolarPlayerState*> AlivePlayers; // 0x470(0x10)
	struct ASolarTeamInfo* TeamClass; // 0x480(0x08)
	struct UDataTable* TeamDataTable; // 0x488(0x08)
	char pad_490[0xb8]; // 0x490(0xb8)
	struct ASolarFlyTrail* FlyTrailActor; // 0x548(0x08)
	char pad_550[0x40]; // 0x550(0x40)
	struct TArray<struct FString> BannedPlayerIDList; // 0x590(0x10)
	struct USolarCharacterDataCollector* CharacterDataCollector; // 0x5a0(0x08)

	void UpdatePlayerData(int32_t CharacterSkinID, int32_t CharacterBagID, int32_t CharacterBagTrailID, struct ASolarPlayerState* PlayerState); // Function Solarland.SolarGameMode.UpdatePlayerData // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void UpdateDeserterTag(struct ASolarPlayerState* PlayerState); // Function Solarland.SolarGameMode.UpdateDeserterTag // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x27c9260
	void UpdateBotPlayerData(struct ASolarPlayerState* PlayerState); // Function Solarland.SolarGameMode.UpdateBotPlayerData // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void UpdateAliveTeamsAndPlayers(); // Function Solarland.SolarGameMode.UpdateAliveTeamsAndPlayers // (Native|Public|BlueprintCallable) // @ game+0x1ae63f0
	struct FString TryKickOutOnlinePlayer(struct FString PlayerId, bool IsAllowReconnect); // Function Solarland.SolarGameMode.TryKickOutOnlinePlayer // (Final|Native|Public) // @ game+0x27c9130
	void SolarGM_SetAntiCheatData(struct FString InVariableName, float InMin, float InMax, float InThreshold, bool bInBanPlayer); // Function Solarland.SolarGameMode.SolarGM_SetAntiCheatData // (Final|Exec|Native|Protected) // @ game+0x27c8e80
	void SetGamePlayMode(int32_t InGamePlayMode); // Function Solarland.SolarGameMode.SetGamePlayMode // (Native|Public|BlueprintCallable) // @ game+0x27c8df0
	void SendHitMsgWithBool(struct ASolarCharacterBase* HitedPlayer, struct TScriptInterface<ISolarCharacterController>& PC, enum class ESolarHitType MsgType, float Damage, bool bo); // Function Solarland.SolarGameMode.SendHitMsgWithBool // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27c8c30
	void SendHitMsg(struct ASolarCharacterBase* HitedPlayer, struct TScriptInterface<ISolarCharacterController>& PC, enum class ESolarHitType MsgType, float Damage, struct FString Params); // Function Solarland.SolarGameMode.SendHitMsg // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27c8a50
	void RestartPlayerTakeChargeEvent__DelegateSignature(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // DelegateFunction Solarland.SolarGameMode.RestartPlayerTakeChargeEvent__DelegateSignature // (Public|Delegate|HasOutParms) // @ game+0x2d0d160
	void RestartPlayerEvent__DelegateSignature(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // DelegateFunction Solarland.SolarGameMode.RestartPlayerEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2d0d160
	void PresettleAll(); // Function Solarland.SolarGameMode.PresettleAll // (Native|Public|BlueprintCallable) // @ game+0x1ae5e90
	void PreAssignTeam(char DesiredTeamID, struct TArray<struct FString> Players); // Function Solarland.SolarGameMode.PreAssignTeam // (Native|Public) // @ game+0x27c8880
	void PostSpawnDefaultSolarCharacterAtTransformDelegate__DelegateSignature(struct ASolarPlayerState* NewPlayer, struct ASolarCharacter* NewCharacter); // DelegateFunction Solarland.SolarGameMode.PostSpawnDefaultSolarCharacterAtTransformDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnStartBattleresponded(); // Function Solarland.SolarGameMode.OnStartBattleresponded // (Final|Native|Public) // @ game+0x27c8860
	bool OnPlayerReJoinRequest(struct FString PlayerId, struct FString& ErrorMsg); // Function Solarland.SolarGameMode.OnPlayerReJoinRequest // (Native|Public|HasOutParms) // @ game+0x27c8720
	void NotifyItemStateChanged(struct AActor* Item, int32_t State); // Function Solarland.SolarGameMode.NotifyItemStateChanged // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void KickOutPlayerToLobby(struct FString InPlayerID); // Function Solarland.SolarGameMode.KickOutPlayerToLobby // (Final|Native|Public) // @ game+0x27c8680
	void KickOutAllPlayerToLobby(); // Function Solarland.SolarGameMode.KickOutAllPlayerToLobby // (Final|Native|Public) // @ game+0x27c8660
	bool IsCustomRoom(int32_t InRuleID); // Function Solarland.SolarGameMode.IsCustomRoom // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	bool IsBannedForCheating(struct FString PlayerId); // Function Solarland.SolarGameMode.IsBannedForCheating // (Final|Native|Public|Const) // @ game+0x27c85b0
	void InitCharacterClassPath(int32_t CharacterId); // Function Solarland.SolarGameMode.InitCharacterClassPath // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void GetTeams(struct TArray<struct ASolarTeamInfo*>& OutTeams, bool FilterNoMemberTeam, bool FilterAlreadySettled); // Function Solarland.SolarGameMode.GetTeams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27c8470
	int32_t GetRandomCharacterID(); // Function Solarland.SolarGameMode.GetRandomCharacterID // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	struct TArray<int32_t> GetRandomAISkinIDByEliminateIDs(struct TArray<int32_t>& EliminateIDs); // Function Solarland.SolarGameMode.GetRandomAISkinIDByEliminateIDs // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	struct TArray<int32_t> GetRandomAISkinID(struct ASolarPlayerState* InPS, bool bOnlyLowerPos); // Function Solarland.SolarGameMode.GetRandomAISkinID // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	int32_t GetMatchTeammateCount(); // Function Solarland.SolarGameMode.GetMatchTeammateCount // (Final|Native|Public|BlueprintCallable) // @ game+0x27c8340
	int32_t GetGamePlayMode(); // Function Solarland.SolarGameMode.GetGamePlayMode // (Native|Public|BlueprintCallable) // @ game+0x27c8310
	struct UGameModeGlobalSetting* GetGameModeSetting(struct UObject* WorldContextObject); // Function Solarland.SolarGameMode.GetGameModeSetting // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x27c8280
	void GetEmptyTeams(struct TArray<struct ASolarTeamInfo*>& OutTeams, bool Reverse); // Function Solarland.SolarGameMode.GetEmptyTeams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27c8180
	void GameModeComponentTakeChargeEvent__DelegateSignature(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection); // DelegateFunction Solarland.SolarGameMode.GameModeComponentTakeChargeEvent__DelegateSignature // (Public|Delegate|HasOutParms) // @ game+0x2d0d160
	void GameModeComponentEvent__DelegateSignature(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // DelegateFunction Solarland.SolarGameMode.GameModeComponentEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2d0d160
	void EndPlayTakeChargeEvent__DelegateSignature(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // DelegateFunction Solarland.SolarGameMode.EndPlayTakeChargeEvent__DelegateSignature // (Public|Delegate|HasOutParms) // @ game+0x2d0d160
	void EndPlayEvent__DelegateSignature(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // DelegateFunction Solarland.SolarGameMode.EndPlayEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2d0d160
	void EnableActorChannelCloseDelayForCharacters(); // Function Solarland.SolarGameMode.EnableActorChannelCloseDelayForCharacters // (Final|Native|Private) // @ game+0x27c7e90
	void DisableActorChannelCloseDelayForCharacters(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function Solarland.SolarGameMode.DisableActorChannelCloseDelayForCharacters // (Final|Native|Private) // @ game+0x27c7dc0
	struct ASolarPlayerState* CreateBotAISingle(int32_t CharacterId, struct FVector& Location, struct TArray<enum class ETeamType> JoinPolicies, struct ASolarBotAIController* ControllerClass, int32_t Difficultly); // Function Solarland.SolarGameMode.CreateBotAISingle // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x27c7bc0
	struct ASolarPlayerState* CreateBotAIAndJoinTeamByName(int32_t CharacterId, struct FVector& Location, struct FString TeamName, struct ASolarBotAIController* ControllerClass, int32_t Difficultly); // Function Solarland.SolarGameMode.CreateBotAIAndJoinTeamByName // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x27c79e0
	struct ASolarPlayerState* CreateBotAIAndJoinTeamByID(int32_t CharacterId, struct FVector& Location, char TeamID, struct ASolarBotAIController* ControllerClass, int32_t Difficultly); // Function Solarland.SolarGameMode.CreateBotAIAndJoinTeamByID // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x27c7810
	struct ASolarPlayerState* CreateBotAIAndJoinTeam(int32_t CharacterId, struct FVector& Location, struct ASolarTeamInfo* TeamInfo, struct ASolarBotAIController* ControllerClass, int32_t Difficultly); // Function Solarland.SolarGameMode.CreateBotAIAndJoinTeam // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x27c7640
	struct ASolarPlayerState* CreateBotAI(int32_t CharacterId, struct FVector& Location, int32_t Difficultly); // Function Solarland.SolarGameMode.CreateBotAI // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x27c7510
	bool CanPlayerBattle(struct ASolarPlayerState* PlayerState); // Function Solarland.SolarGameMode.CanPlayerBattle // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x27c7470
};

// Class Solarland.SBattleGameMode
// Size: 0x5d8 (Inherited: 0x5a8)
struct ASBattleGameMode : ASolarGameMode {
	struct FMulticastInlineDelegate OnPlayerDisconnectedGame; // 0x5a8(0x10)
	struct FMulticastInlineDelegate OnPlayerReconnectedGame; // 0x5b8(0x10)
	char pad_5C8[0x8]; // 0x5c8(0x08)
	int32_t SettlementStageConfigID; // 0x5d0(0x04)
	char pad_5D4[0x4]; // 0x5d4(0x04)

	void SettlePlayerBattleData(struct ASolarPlayerState* Player); // Function Solarland.SBattleGameMode.SettlePlayerBattleData // (Native|Public|BlueprintCallable) // @ game+0x2708f90
	void ReceiveBattleSettlement(); // Function Solarland.SBattleGameMode.ReceiveBattleSettlement // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveBattleOver(); // Function Solarland.SBattleGameMode.ReceiveBattleOver // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerLeaveDSTimeOut(struct ASolarPlayerState* PlayerState); // Function Solarland.SBattleGameMode.OnPlayerLeaveDSTimeOut // (Native|Public) // @ game+0x2708a60
	bool IsAutoSettlementWhenKilled(); // Function Solarland.SBattleGameMode.IsAutoSettlementWhenKilled // (Native|Event|Public|BlueprintEvent) // @ game+0x2708780
	bool IsAllowReconnectGame(struct ASolarPlayerState* Player); // Function Solarland.SBattleGameMode.IsAllowReconnectGame // (Native|Public|BlueprintCallable) // @ game+0x27086e0
};

// Class Solarland.SCustomGameMode
// Size: 0x790 (Inherited: 0x5d8)
struct ASCustomGameMode : ASBattleGameMode {
	char pad_5D8[0x8]; // 0x5d8(0x08)
	float TimeOutSeconds; // 0x5e0(0x04)
	char pad_5E4[0xb4]; // 0x5e4(0xb4)
	struct UCGMLogicComponent* LogicComponent; // 0x698(0x08)
	struct UCGMDeathComponent* DeathComponent; // 0x6a0(0x08)
	char pad_6A8[0x10]; // 0x6a8(0x10)
	struct TArray<struct ASCMPlayerController*> WaitingPlayers; // 0x6b8(0x10)
	char pad_6C8[0x10]; // 0x6c8(0x10)
	struct FMulticastInlineDelegate OnPlayerJoin; // 0x6d8(0x10)
	struct FMulticastInlineDelegate OnAIJoin; // 0x6e8(0x10)
	struct FMulticastInlineDelegate OnPlayerOutEvent; // 0x6f8(0x10)
	struct TArray<struct AGameManagerBase*> GameManagerClasses; // 0x708(0x10)
	struct UCGMLogicComponent* LogicComponentClass; // 0x718(0x08)
	struct UCGMDeathComponent* DeathComponentClass; // 0x720(0x08)
	struct USCMPlayerRPCComponent* PlayerRPCComponentClass; // 0x728(0x08)
	char pad_730[0x60]; // 0x730(0x60)

	void TimerStartGame(); // Function Solarland.SCustomGameMode.TimerStartGame // (Final|Native|Public) // @ game+0x270efa0
	void StartBattle(); // Function Solarland.SCustomGameMode.StartBattle // (Final|Native|Public|BlueprintCallable) // @ game+0x270ef80
	void ResendResurrectCoin(struct ASolarCharacter* ResurrectCharacter, struct ASCMPlayerState* ResurrectPlayer); // Function Solarland.SCustomGameMode.ResendResurrectCoin // (Final|Native|Public|BlueprintCallable) // @ game+0x270eb40
	bool RequestAllowReconnectGame(struct ASCMPlayerState* InPC); // Function Solarland.SCustomGameMode.RequestAllowReconnectGame // (Native|Event|Public|BlueprintEvent) // @ game+0x270d6d0
	void ReceiveSpectatorJoinData(struct ASCMPlayerState* Player); // Function Solarland.SCustomGameMode.ReceiveSpectatorJoinData // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveServerLevelLoaded(struct FString LevelName); // Function Solarland.SCustomGameMode.ReceiveServerLevelLoaded // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	bool ReceivePlayerReJoinRequest(struct FString PlayerId, struct FString& ErrorMsg); // Function Solarland.SCustomGameMode.ReceivePlayerReJoinRequest // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x270d520
	void ReceivePlayerReJoin(struct ASCMPlayerState* NewPlayer); // Function Solarland.SCustomGameMode.ReceivePlayerReJoin // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerPreLogin(struct FString PlayerId, struct ASCMPlayerState* OfflinePlayer, struct FString& ErrorMsg); // Function Solarland.SCustomGameMode.ReceivePlayerPreLogin // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerNonSpectatorJoinData(struct ASCMPlayerState* Player); // Function Solarland.SCustomGameMode.ReceivePlayerNonSpectatorJoinData // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerLevelLoaded(struct ASCMPlayerController* Player, struct FString LevelName); // Function Solarland.SCustomGameMode.ReceivePlayerLevelLoaded // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerJoinData(struct FString PlayerId); // Function Solarland.SCustomGameMode.ReceivePlayerJoinData // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerJoinBattle(struct ASCMPlayerState* NewPlayer, bool IsAI); // Function Solarland.SCustomGameMode.ReceivePlayerJoinBattle // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerJoin(struct ASCMPlayerState* NewPlayer, bool IsAI); // Function Solarland.SCustomGameMode.ReceivePlayerJoin // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerCheat(struct ASolarPlayerState* InCheater); // Function Solarland.SCustomGameMode.ReceivePlayerCheat // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerCancelJoin(struct FString PlayerId); // Function Solarland.SCustomGameMode.ReceivePlayerCancelJoin // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerBattleEnd(struct ASCMPlayerState* Player, enum class ESCMPlayerOutType OutType); // Function Solarland.SCustomGameMode.ReceivePlayerBattleEnd // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerAbnormal(struct ASolarPlayerState* InAbnormalPlayer); // Function Solarland.SCustomGameMode.ReceivePlayerAbnormal // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveOBPlayersChanged(); // Function Solarland.SCustomGameMode.ReceiveOBPlayersChanged // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveGameModeInit(); // Function Solarland.SCustomGameMode.ReceiveGameModeInit // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveBattleTick(float InBattleTime, float DeltaTime); // Function Solarland.SCustomGameMode.ReceiveBattleTick // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveBattleEnd(); // Function Solarland.SCustomGameMode.ReceiveBattleEnd // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveBattleBegin(); // Function Solarland.SCustomGameMode.ReceiveBattleBegin // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnTeamInTournamentSettled(struct FString Side, char TeamID); // Function Solarland.SCustomGameMode.OnTeamInTournamentSettled // (Final|Native|Public) // @ game+0x270d3d0
	void OnReceivePlayerLogin(struct APlayerController* PlayerController); // Function Solarland.SCustomGameMode.OnReceivePlayerLogin // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnReceivePlayerBattleStart(struct APlayerController* PlayerController); // Function Solarland.SCustomGameMode.OnReceivePlayerBattleStart // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnReceiveBattleStart(); // Function Solarland.SCustomGameMode.OnReceiveBattleStart // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerSettled(struct ASCMPlayerState* Player); // Function Solarland.SCustomGameMode.OnPlayerSettled // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerOut__DelegateSignature(struct ASCMPlayerState* Player, enum class ESCMPlayerOutType OutType); // DelegateFunction Solarland.SCustomGameMode.OnPlayerOut__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnPlayerOfflineTimeOut(struct ASCMPlayerState* OfflineTimeoutPlayer); // Function Solarland.SCustomGameMode.OnPlayerOfflineTimeOut // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerJoin__DelegateSignature(struct ASCMPlayerState* Player); // DelegateFunction Solarland.SCustomGameMode.OnPlayerJoin__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnPlayerGiveUp(struct ASCMPlayerState* OfflineTimeoutPlayer); // Function Solarland.SCustomGameMode.OnPlayerGiveUp // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnMatchEnd(int32_t RPCID); // Function Solarland.SCustomGameMode.OnMatchEnd // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnDSClose(); // Function Solarland.SCustomGameMode.OnDSClose // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnBotAIDataReady(int32_t AICount); // Function Solarland.SCustomGameMode.OnBotAIDataReady // (Final|Native|Public) // @ game+0x270d290
	void OnAIJoin__DelegateSignature(struct ASCMPlayerState* BotAI); // DelegateFunction Solarland.SCustomGameMode.OnAIJoin__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void NotifyDSBattleOver(); // Function Solarland.SCustomGameMode.NotifyDSBattleOver // (Final|Native|Public) // @ game+0x270d1d0
	void NotifyBotAIDataReady(int32_t AICount); // Function Solarland.SCustomGameMode.NotifyBotAIDataReady // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	bool IsKillWhenPlayerOut(struct ASolarPlayerState* PlayerState); // Function Solarland.SCustomGameMode.IsKillWhenPlayerOut // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x270d030
	bool IsEnableLogicComp(); // Function Solarland.SCustomGameMode.IsEnableLogicComp // (Native|Public|Const) // @ game+0x270d000
	int32_t GetCurMapID(); // Function Solarland.SCustomGameMode.GetCurMapID // (Final|Native|Public) // @ game+0x270ce70
	void CreateHomeActor(struct FString Path); // Function Solarland.SCustomGameMode.CreateHomeActor // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	bool CheckLogicComponentIsA(struct TSoftClassPtr<UObject> ClassPath); // Function Solarland.SCustomGameMode.CheckLogicComponentIsA // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x270cd60
	bool ChangePlayerCharacter(struct ASCMPlayerState* Player, int32_t CharacterId, int32_t SkinId); // Function Solarland.SCustomGameMode.ChangePlayerCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x270cc50
	bool ChangeBotAICharacter(struct ASolarPlayerState* Player, int32_t CharacterId, int32_t SkinId); // Function Solarland.SCustomGameMode.ChangeBotAICharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x270cb40
};

// Class Solarland.BattlegroundGameMode
// Size: 0x960 (Inherited: 0x790)
struct ABattlegroundGameMode : ASCustomGameMode {
	struct AFactionInfo* FactionClass; // 0x790(0x08)
	struct AFactionInfo* BlueFaction; // 0x798(0x08)
	struct AFactionInfo* RedFaction; // 0x7a0(0x08)
	struct TMap<enum class EFactionType, struct FText> FactionNameMap; // 0x7a8(0x50)
	int32_t MinPlayerLimit; // 0x7f8(0x04)
	int32_t MaxPlayerLimit; // 0x7fc(0x04)
	struct FBattlegroundGlobalData GlobalDataConfig; // 0x800(0x40)
	int32_t DefaultSubModeID; // 0x840(0x04)
	struct FBattlegroundSubModeData DefaultSubModeData; // 0x844(0x1c)
	struct TMap<int32_t, struct FBattlegroundSubModeData> MapDataConfig; // 0x860(0x50)
	char pad_8B0[0x8]; // 0x8b0(0x08)
	struct TArray<int32_t> BotCharacterIDs; // 0x8b8(0x10)
	int32_t BotDifficultly; // 0x8c8(0x04)
	int32_t MaxBots; // 0x8cc(0x04)
	float SpawnBotInterval; // 0x8d0(0x04)
	bool bEnableBot; // 0x8d4(0x01)
	char pad_8D5[0x3]; // 0x8d5(0x03)
	struct FTimerHandle SpawnBotsTimerHandle; // 0x8d8(0x08)
	struct TArray<struct AActor*> PreStarts; // 0x8e0(0x10)
	char pad_8F0[0x8]; // 0x8f0(0x08)
	struct FTimerHandle StartMatchTimeoutTimerHandle; // 0x8f8(0x08)
	char pad_900[0x58]; // 0x900(0x58)
	struct FTimerHandle EndMatchTimerHandle; // 0x958(0x08)

	void SpawnBotTick(); // Function Solarland.BattlegroundGameMode.SpawnBotTick // (Final|Native|Protected) // @ game+0x265e070
	void SetMinPlayerLimit(int32_t NewCount); // Function Solarland.BattlegroundGameMode.SetMinPlayerLimit // (Final|Native|Public|BlueprintCallable) // @ game+0x265dfe0
	void SetMaxPlayerLimit(int32_t NewCount); // Function Solarland.BattlegroundGameMode.SetMaxPlayerLimit // (Final|Native|Public|BlueprintCallable) // @ game+0x265df50
	void OnBotSpawned(struct ASolarPlayerState* Bot); // Function Solarland.BattlegroundGameMode.OnBotSpawned // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void NotifyBattleOver(); // Function Solarland.BattlegroundGameMode.NotifyBattleOver // (Final|Native|Protected) // @ game+0x265d5c0
	struct FBattlegroundSubModeData GetSubModeData(); // Function Solarland.BattlegroundGameMode.GetSubModeData // (Final|Native|Public|BlueprintCallable) // @ game+0x265d450
	bool GetPreStartTransform(struct FTransform& OutTransform); // Function Solarland.BattlegroundGameMode.GetPreStartTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x265d340
	struct FBattlegroundGlobalData GetGlobalData(); // Function Solarland.BattlegroundGameMode.GetGlobalData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d0e0
	struct AActor* ChooseBestPlayerStart(struct ABattlegroundPlayerState* InPlayerState, enum class EDeploymentType InType); // Function Solarland.BattlegroundGameMode.ChooseBestPlayerStart // (Final|Native|Public|BlueprintCallable) // @ game+0x265cee0
};

// Class Solarland.SolarGameState
// Size: 0x4c0 (Inherited: 0x2b8)
struct ASolarGameState : AGameState {
	char pad_2B8[0x20]; // 0x2b8(0x20)
	struct ASolarCharacter* LatestKillerCharacter; // 0x2d8(0x08)
	struct ASolarCharacter* LatestDeathCharacter; // 0x2e0(0x08)
	char pad_2E8[0x20]; // 0x2e8(0x20)
	struct TArray<struct ASolarPlayerState*> SolarPlayerStateArray; // 0x308(0x10)
	struct TArray<struct ASolarPlayerState*> RealPlayerStateArray; // 0x318(0x10)
	char bShowBattlePrompt : 1; // 0x328(0x01)
	char pad_328_1 : 7; // 0x328(0x01)
	char pad_329[0x7]; // 0x329(0x07)
	struct TArray<int32_t> MapVehicleSpawnTypes; // 0x330(0x10)
	char pad_340[0x10]; // 0x340(0x10)
	struct TArray<struct FPrePooledBundle> PrePooledBundles; // 0x350(0x10)
	int32_t RemainingPlayersCount; // 0x360(0x04)
	int32_t AlivePlayersCount; // 0x364(0x04)
	int32_t RemainingTeamCount; // 0x368(0x04)
	int32_t PlayersCount; // 0x36c(0x04)
	char TeamCount; // 0x370(0x01)
	char pad_371[0x3]; // 0x371(0x03)
	int32_t TotalBoardingNum; // 0x374(0x04)
	int32_t CapsulePlayerNum; // 0x378(0x04)
	int32_t SettlementStageConfigID; // 0x37c(0x04)
	struct TSet<struct UObject*> LimitMaxReplicatedNumClasses; // 0x380(0x50)
	float StartTime; // 0x3d0(0x04)
	int32_t NumPlayers; // 0x3d4(0x04)
	struct TArray<struct ASolarPlayerState*> OBPlayerList; // 0x3d8(0x10)
	int32_t GameWarmID; // 0x3e8(0x04)
	int32_t TeammateNumMode; // 0x3ec(0x04)
	struct FGameStartConditionList GameStartConditions; // 0x3f0(0x58)
	struct USolarGameplayConfigComponent* GameplayConfigComponent; // 0x448(0x08)
	struct TArray<struct ASolarTeamInfo*> Teams; // 0x450(0x10)
	char NumReplicatedTeams; // 0x460(0x01)
	char pad_461[0x4f]; // 0x461(0x4f)
	struct USolarPlayerActivityHeatComponent* SolarPlayerActivityHeatComponent; // 0x4b0(0x08)
	char Countdown; // 0x4b8(0x01)
	char pad_4B9[0x3]; // 0x4b9(0x03)
	int32_t EndMatchCountdown; // 0x4bc(0x04)

	void SetTeamLastVehicleLocation(char InTeamId, struct FVector& InVehiclePosition); // Function Solarland.SolarGameState.SetTeamLastVehicleLocation // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x27dba10
	void SetSettlementStageConfigID(int32_t InConfigID); // Function Solarland.SolarGameState.SetSettlementStageConfigID // (Final|Native|Public|BlueprintCallable) // @ game+0x27db880
	void SetCustomConfigValue(enum class ECustomParamType InType, float InValue); // Function Solarland.SolarGameState.SetCustomConfigValue // (Final|Native|Public) // @ game+0x27db110
	void ServerUpdateMapVehicleSpawnTypes(struct TArray<int32_t>& InSpawnTargetVehicleTypes); // Function Solarland.SolarGameState.ServerUpdateMapVehicleSpawnTypes // (Final|Native|Public|HasOutParms) // @ game+0x27db060
	void PlayTeamVictoryVoice(); // Function Solarland.SolarGameState.PlayTeamVictoryVoice // (Final|Native|Public|BlueprintCallable) // @ game+0x27db040
	void OnSafeAreaIndexChanged(int32_t NewIndex); // Function Solarland.SolarGameState.OnSafeAreaIndexChanged // (Final|Native|Public) // @ game+0x27dafb0
	void OnRep_SettlementStageConfigID(); // Function Solarland.SolarGameState.OnRep_SettlementStageConfigID // (Final|Native|Protected) // @ game+0x27daf90
	void OnRep_RemainingTeamCountChange(); // Function Solarland.SolarGameState.OnRep_RemainingTeamCountChange // (Final|Native|Protected) // @ game+0x27daf70
	void OnRep_PlayersCountChange(); // Function Solarland.SolarGameState.OnRep_PlayersCountChange // (Final|Native|Protected) // @ game+0x27daf50
	void OnRep_OnPlayersCountChange(); // Function Solarland.SolarGameState.OnRep_OnPlayersCountChange // (Final|Native|Protected) // @ game+0x27daf30
	void OnRep_OnAlivePlayersCountChange(); // Function Solarland.SolarGameState.OnRep_OnAlivePlayersCountChange // (Final|Native|Protected|Const) // @ game+0x27daf10
	void OnRep_OBPlayerList(); // Function Solarland.SolarGameState.OnRep_OBPlayerList // (Final|Native|Protected) // @ game+0x27daef0
	void OnRep_NumReplicatedTeams(); // Function Solarland.SolarGameState.OnRep_NumReplicatedTeams // (Final|Native|Public) // @ game+0x27daed0
	void OnRep_NumPlayers(int32_t PreviousNumPlayers); // Function Solarland.SolarGameState.OnRep_NumPlayers // (Final|Native|Protected) // @ game+0x27dae40
	void OnRep_EndMatchCountdown(); // Function Solarland.SolarGameState.OnRep_EndMatchCountdown // (Native|Public) // @ game+0x7cf110
	void OnRep_Countdown(); // Function Solarland.SolarGameState.OnRep_Countdown // (Native|Public) // @ game+0x1ae53d0
	void OnRep_CapsulePlayerNum(); // Function Solarland.SolarGameState.OnRep_CapsulePlayerNum // (Final|Native|Protected) // @ game+0x27dae20
	void OnRecordingConnectionChanged(); // Function Solarland.SolarGameState.OnRecordingConnectionChanged // (Final|Native|Public) // @ game+0x27dae00
	void OnPlayerStateEndPlay(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function Solarland.SolarGameState.OnPlayerStateEndPlay // (Final|Native|Public) // @ game+0x27dad30
	void OnOBPlayerListChange(); // Function Solarland.SolarGameState.OnOBPlayerListChange // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnLocalSpectateTargetChanged(struct ASolarPlayerState* OldTarget, struct ASolarSpectateInfo* SpectateInfo); // Function Solarland.SolarGameState.OnLocalSpectateTargetChanged // (Final|Native|Protected) // @ game+0x27dac60
	void OnLiveWatchPlayerCountChanged(struct FString PlayerId, uint32_t count); // Function Solarland.SolarGameState.OnLiveWatchPlayerCountChanged // (Final|Native|Public) // @ game+0x27dab80
	void OnLiveWatchOnlyMsgReceived(struct FLiveWatchOnlyMsg& Msg); // Function Solarland.SolarGameState.OnLiveWatchOnlyMsgReceived // (Final|Native|Public|HasOutParms) // @ game+0x27daa90
	void NotifyCheatedPlayer(struct ASolarPlayerState* CheatedPlayerState, struct FText& OutReason); // Function Solarland.SolarGameState.NotifyCheatedPlayer // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void NotifyBombingEnd(int32_t BombId); // Function Solarland.SolarGameState.NotifyBombingEnd // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x27daa00
	void NotifyBombingBegin(int32_t BombId, struct FVector Location, float Radius); // Function Solarland.SolarGameState.NotifyBombingBegin // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x27da8f0
	void NotifyAbnormalPlayer(struct ASolarPlayerState* AbnormalPlayerState, struct FText& OutReason); // Function Solarland.SolarGameState.NotifyAbnormalPlayer // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void NetMulticastVictoryAction(struct FString WinTeamName, struct ASolarCharacter* LastKiller, struct ASolarCharacter* LastDeath); // Function Solarland.SolarGameState.NetMulticastVictoryAction // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x27da700
	void NetMulticastNotifyDebugMessage(int32_t DebugIndex, struct FVector SpawnerLocation, struct FString DebugString); // Function Solarland.SolarGameState.NetMulticastNotifyDebugMessage // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x27da5e0
	void NetMulticastNotifyCheatedPlayer(struct ASolarPlayerState* CheatedPlayerState, struct FText BanReason); // Function Solarland.SolarGameState.NetMulticastNotifyCheatedPlayer // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x27da4d0
	void K2_SetCanShowBattlePrompt(bool NewValue); // Function Solarland.SolarGameState.K2_SetCanShowBattlePrompt // (Final|Native|Public|BlueprintCallable) // @ game+0x27da110
	bool IsSupportWeaponUpgrade(); // Function Solarland.SolarGameState.IsSupportWeaponUpgrade // (Final|Native|Public|BlueprintCallable) // @ game+0x27da0e0
	bool IsSupportCharacterTacticalAbility(); // Function Solarland.SolarGameState.IsSupportCharacterTacticalAbility // (Final|Native|Public|BlueprintCallable) // @ game+0x27da0b0
	bool IsSupportCharacterSuperAbility(); // Function Solarland.SolarGameState.IsSupportCharacterSuperAbility // (Final|Native|Public|BlueprintCallable) // @ game+0x27da080
	bool IsSupportCharacterRole(); // Function Solarland.SolarGameState.IsSupportCharacterRole // (Final|Native|Public|BlueprintCallable) // @ game+0x27da050
	bool IsSupportCharacterInGameLeveling(); // Function Solarland.SolarGameState.IsSupportCharacterInGameLeveling // (Native|Event|Public|BlueprintEvent) // @ game+0x27da020
	float GetWorldStartTimeSeconds(); // Function Solarland.SolarGameState.GetWorldStartTimeSeconds // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8c80
	int32_t GetWatchingPlayerCount(bool IgnoreOffline); // Function Solarland.SolarGameState.GetWatchingPlayerCount // (Final|Native|Public) // @ game+0x27d9f80
	void GetTeams(struct TArray<struct ASolarTeamInfo*>& OutTeams, bool FilterNoMemberTeam, bool FilterAlreadySettled); // Function Solarland.SolarGameState.GetTeams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27c8470
	struct ASolarPlayerState* GetTeamPlayerState(char InTeamId, char InPosInTeam); // Function Solarland.SolarGameState.GetTeamPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27d9e10
	int32_t GetTeamNumCount(); // Function Solarland.SolarGameState.GetTeamNumCount // (Native|Public) // @ game+0x27d9de0
	char GetTeammateNum(char InTeamId); // Function Solarland.SolarGameState.GetTeammateNum // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27d9ef0
	struct ASolarTeamInfo* GetTeamByName(struct FString InTeamName); // Function Solarland.SolarGameState.GetTeamByName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27d9ce0
	struct ASolarTeamInfo* GetTeam(char InTeamId); // Function Solarland.SolarGameState.GetTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27d9c50
	enum class ERoleSkillOperation GetTacticalSkillStateOperationOnInit(); // Function Solarland.SolarGameState.GetTacticalSkillStateOperationOnInit // (Final|Native|Public|BlueprintCallable) // @ game+0x27d9c20
	enum class ERoleSkillOperation GetSuperSkillStateOperationOnInit(); // Function Solarland.SolarGameState.GetSuperSkillStateOperationOnInit // (Final|Native|Public|BlueprintCallable) // @ game+0x27d9bb0
	struct ASolarPlayerState* GetSpecTargetOrLocalPlayerState(); // Function Solarland.SolarGameState.GetSpecTargetOrLocalPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27d9b80
	struct ASolarSafeArea* GetSolarSafeArea(); // Function Solarland.SolarGameState.GetSolarSafeArea // (Final|Native|Public|Const) // @ game+0x27d9b50
	int32_t GetSettlementStageConfigID(); // Function Solarland.SolarGameState.GetSettlementStageConfigID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27d9b30
	int32_t GetRemainingTeamCount(); // Function Solarland.SolarGameState.GetRemainingTeamCount // (Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x27d9b00
	int32_t GetRemainingPlayersCount(); // Function Solarland.SolarGameState.GetRemainingPlayersCount // (Native|Public) // @ game+0x27d9ad0
	void GetPlayerTeams(struct TArray<struct ASolarTeamInfo*>& OutTeams, bool FilterAlreadySettled); // Function Solarland.SolarGameState.GetPlayerTeams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27d9870
	struct ASolarPlayerState* GetPlayerStateByPlayerId(struct FString InPlayerID); // Function Solarland.SolarGameState.GetPlayerStateByPlayerId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27d97c0
	struct ASolarPlayerState* GetPlayerStateByNickName(struct FString InNickName); // Function Solarland.SolarGameState.GetPlayerStateByNickName // (Final|Native|Public|Const) // @ game+0x27d9710
	int32_t GetPlayersCount(); // Function Solarland.SolarGameState.GetPlayersCount // (Native|Public) // @ game+0x27d9970
	struct ASolarCharacter* GetPlayerByPlayerId(struct FString InPlayerID); // Function Solarland.SolarGameState.GetPlayerByPlayerId // (Final|Native|Public) // @ game+0x27d9660
	void GetOnlyPlayerTeams(struct TArray<struct ASolarTeamInfo*>& OutTeams, bool FilterAlreadySettled); // Function Solarland.SolarGameState.GetOnlyPlayerTeams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27d9560
	void GetOnlyBotTeams(struct TArray<struct ASolarTeamInfo*>& OutTeams, bool FilterAlreadySettled); // Function Solarland.SolarGameState.GetOnlyBotTeams // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27d9460
	struct ASolarPlayerState* GetOfflinePlayerState(struct FString OfflinePlayerId); // Function Solarland.SolarGameState.GetOfflinePlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x27d93b0
	bool GetOBPlayerList(struct TArray<struct ASolarPlayerState*>& OutPlayerList); // Function Solarland.SolarGameState.GetOBPlayerList // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x27d92f0
	struct ASolarPlayerState* GetLocalSolarPlayerState(); // Function Solarland.SolarGameState.GetLocalSolarPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27d8d00
	int32_t GetEndMatchCountdown(); // Function Solarland.SolarGameState.GetEndMatchCountdown // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x27d8ce0
	bool GetCanShowBattlePrompt(); // Function Solarland.SolarGameState.GetCanShowBattlePrompt // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8cb0
	float GetBattleStartTimeSeconds(); // Function Solarland.SolarGameState.GetBattleStartTimeSeconds // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8c80
	void GetAllCharactersExceptTeammate(struct TArray<struct ASolarCharacter*>& CharacterArray); // Function Solarland.SolarGameState.GetAllCharactersExceptTeammate // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x27d8bd0
	int32_t GetAliveSolarPlayersCount(bool IgnoreOffline); // Function Solarland.SolarGameState.GetAliveSolarPlayersCount // (Final|Native|Public) // @ game+0x27d8b30
	int32_t GetAlivePlayersCount(); // Function Solarland.SolarGameState.GetAlivePlayersCount // (Final|Native|Public|Const) // @ game+0x27d8b10
	char GetAlivePlayerNumInTeamExceptDying(char InTeamId, bool bExceptCheater); // Function Solarland.SolarGameState.GetAlivePlayerNumInTeamExceptDying // (Native|Public|BlueprintCallable) // @ game+0x27d8a30
	void DoVictoryActionOnServer(struct FString InWinTeamName); // Function Solarland.SolarGameState.DoVictoryActionOnServer // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8990
	void DoSlomoOnLocalFromConfig(); // Function Solarland.SolarGameState.DoSlomoOnLocalFromConfig // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8970
	void DoSlomoOnLocal(float TimeDilation, float TimeDuration, float DelayTime); // Function Solarland.SolarGameState.DoSlomoOnLocal // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8850
	void DelayPlayVictoryMusic(); // Function Solarland.SolarGameState.DelayPlayVictoryMusic // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8830
	void CelebrateBattleEnd(struct FVector Location); // Function Solarland.SolarGameState.CelebrateBattleEnd // (BlueprintAuthorityOnly|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	char CalculateTeamNum(); // Function Solarland.SolarGameState.CalculateTeamNum // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8800
	void CacheSafeArea(struct ASolarSafeArea* SafeArea); // Function Solarland.SolarGameState.CacheSafeArea // (Final|Native|Public|BlueprintCallable) // @ game+0x27d8770
};

// Class Solarland.SBattleGameState
// Size: 0x4e0 (Inherited: 0x4c0)
struct ASBattleGameState : ASolarGameState {
	char pad_4C0[0x18]; // 0x4c0(0x18)
	bool IsBattleEnd; // 0x4d8(0x01)
	bool IsBattleSettlement; // 0x4d9(0x01)
	enum class EBattleEndType BattleEndType; // 0x4da(0x01)
	char pad_4DB[0x5]; // 0x4db(0x05)

	bool IsBattleOver(); // Function Solarland.SBattleGameState.IsBattleOver // (Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x27087b0
	bool GetIsBattleSettlement(); // Function Solarland.SBattleGameState.GetIsBattleSettlement // (Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x27084b0
	enum class EBattleEndType GetBattleEndType(); // Function Solarland.SBattleGameState.GetBattleEndType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2708490
};

// Class Solarland.SCustomGameState
// Size: 0x688 (Inherited: 0x4e0)
struct ASCustomGameState : ASBattleGameState {
	char pad_4E0[0x8]; // 0x4e0(0x08)
	enum class ESCMInGameState InGameState; // 0x4e8(0x01)
	bool bInSelectHero; // 0x4e9(0x01)
	char pad_4EA[0x3e]; // 0x4ea(0x3e)
	struct FCustomRoomData CustomRoomData; // 0x528(0xd8)
	bool bCustomRoomMode; // 0x600(0x01)
	char pad_601[0x7]; // 0x601(0x07)
	struct TArray<struct AGameManagerBase*> GameManagers; // 0x608(0x10)
	struct AGameDataManager* GameDataManager; // 0x618(0x08)
	struct ACustomSettlementManager* SettlementManager; // 0x620(0x08)
	char pad_628[0x10]; // 0x628(0x10)
	struct UCGMManagerConfigComponent* ManagerConfigComponent; // 0x638(0x08)
	struct ACGFormula* InsFormula; // 0x640(0x08)
	struct TArray<struct ASolarPlayerState*> PlayersWithTrackingAbility; // 0x648(0x10)
	struct TArray<struct ASpatializeInfoTrack*> TrackInfos; // 0x658(0x10)
	char pad_668[0xb]; // 0x668(0x0b)
	bool bBasicSystemReady; // 0x673(0x01)
	char pad_674[0x4]; // 0x674(0x04)
	struct FMulticastInlineDelegate OnBasicSystemReady; // 0x678(0x10)

	void SetRoomPoolPrizeType(int32_t TypeID); // Function Solarland.SCustomGameState.SetRoomPoolPrizeType // (Final|Native|Public) // @ game+0x2725f30
	void SetRoomPasssd(struct FString Passwd); // Function Solarland.SCustomGameState.SetRoomPasssd // (Final|Native|Public) // @ game+0x2725e40
	void SetRoomName(struct FString Name); // Function Solarland.SCustomGameState.SetRoomName // (Final|Native|Public) // @ game+0x2725d50
	void SetRoomLevelLimit(int32_t Level); // Function Solarland.SCustomGameState.SetRoomLevelLimit // (Final|Native|Public) // @ game+0x2725cc0
	void SetRoomEnableSwapPos(bool bIsEnabled); // Function Solarland.SCustomGameState.SetRoomEnableSwapPos // (Final|Native|Public|BlueprintCallable) // @ game+0x2725c30
	void SetRoomEnableInvite(bool bIsEnabled); // Function Solarland.SCustomGameState.SetRoomEnableInvite // (Final|Native|Public|BlueprintCallable) // @ game+0x2725ba0
	void OnTournamentBattleEnd(); // Function Solarland.SCustomGameState.OnTournamentBattleEnd // (Final|Native|Public) // @ game+0x27257b0
	void OnServerCustomRoomDataReady(); // Function Solarland.SCustomGameState.OnServerCustomRoomDataReady // (Native|Public) // @ game+0x1ae6090
	void OnRep_InGameState(); // Function Solarland.SCustomGameState.OnRep_InGameState // (Final|Native|Public) // @ game+0x2725770
	void OnRep_GameManagerList(); // Function Solarland.SCustomGameState.OnRep_GameManagerList // (Final|Native|Private) // @ game+0x9043b0
	void OnRep_GameDataManager(); // Function Solarland.SCustomGameState.OnRep_GameDataManager // (Final|Native|Public) // @ game+0x2725750
	void OnRep_CustomRoomData(); // Function Solarland.SCustomGameState.OnRep_CustomRoomData // (Final|Native|Public) // @ game+0x2725730
	void OnRep_bInSelectHero(); // Function Solarland.SCustomGameState.OnRep_bInSelectHero // (Final|Native|Public) // @ game+0x2725790
	void OnPlayerBattleStateChange(struct ASCMPlayerState* PlayerState); // Function Solarland.SCustomGameState.OnPlayerBattleStateChange // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnDataManagerPrepare(); // Function Solarland.SCustomGameState.OnDataManagerPrepare // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnCustomRoomDataChange(struct FCustomRoomData& InCustomRoomData); // Function Solarland.SCustomGameState.OnCustomRoomDataChange // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void NotifyVipPlayerJoin(int32_t FlagID, char VipType, enum class ECommonInputType InputType, struct FString NickName, bool bCustomRoom, bool bInTournament); // Function Solarland.SCustomGameState.NotifyVipPlayerJoin // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x2724e40
	void NotifyRoomDataChanged(); // Function Solarland.SCustomGameState.NotifyRoomDataChanged // (Final|Native|Public) // @ game+0x2724e20
	void MultiClientAllManagersOnRepDelegate__DelegateSignature(); // DelegateFunction Solarland.SCustomGameState.MultiClientAllManagersOnRepDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	bool IsNeedCalculateTournamentPoints(); // Function Solarland.SCustomGameState.IsNeedCalculateTournamentPoints // (Final|Native|Public) // @ game+0x2724d50
	bool IsInTournament(); // Function Solarland.SCustomGameState.IsInTournament // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2724d10
	bool IsInCustomServer(); // Function Solarland.SCustomGameState.IsInCustomServer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2724cd0
	bool IsCustomRoomMode(); // Function Solarland.SCustomGameState.IsCustomRoomMode // (Final|Native|Public|Const) // @ game+0x904000
	bool IsAtNonSettlementStage(); // Function Solarland.SCustomGameState.IsAtNonSettlementStage // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2724ca0
	void InitKnockoutPointParams(struct FKnockoutParams& InParams); // Function Solarland.SCustomGameState.InitKnockoutPointParams // (Final|Native|Public|HasOutParms) // @ game+0x2724bc0
	struct FTournamentData GetTournamentData(); // Function Solarland.SCustomGameState.GetTournamentData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2724b90
	bool GetOBSCMPlayerList(struct TArray<struct ASCMPlayerState*>& OutPlayerList); // Function Solarland.SCustomGameState.GetOBSCMPlayerList // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x27249c0
	struct UCGMManagerConfigComponent* GetManagerConfigComponent(); // Function Solarland.SCustomGameState.GetManagerConfigComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27249a0
	struct ACGFormula* GetFormula(); // Function Solarland.SCustomGameState.GetFormula // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2724940
	struct FCustomRoomData GetCustomRoomData(); // Function Solarland.SCustomGameState.GetCustomRoomData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x27247c0
	struct UCGMGameplayConfig* GetCGMGameplayConfig(); // Function Solarland.SCustomGameState.GetCGMGameplayConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x27246b0
	void ClearCustomRoomData(); // Function Solarland.SCustomGameState.ClearCustomRoomData // (Final|Native|Public) // @ game+0x2724380
	void CallOnBasicSystemReady(); // Function Solarland.SCustomGameState.CallOnBasicSystemReady // (Final|Native|Protected|BlueprintCallable) // @ game+0x2724340
	int32_t CalculateKnockoutPoints(int32_t InTeamRank, int32_t InKillNum, float InTotalDamage, float InTotalDamageTaken); // Function Solarland.SCustomGameState.CalculateKnockoutPoints // (Final|Native|Public) // @ game+0x27241e0
};

// Class Solarland.BattlegroundGameState
// Size: 0x750 (Inherited: 0x688)
struct ABattlegroundGameState : ASCustomGameState {
	int32_t MinPlayerLimit; // 0x688(0x04)
	int32_t MaxPlayerLimit; // 0x68c(0x04)
	struct FBattlegroundGlobalData GlobalData; // 0x690(0x40)
	int32_t SubModeID; // 0x6d0(0x04)
	struct FBattlegroundSubModeData SubModeData; // 0x6d4(0x1c)
	struct TArray<struct FBattlegroundScoreData> ScoreData; // 0x6f0(0x10)
	char pad_700[0x8]; // 0x700(0x08)
	struct TArray<struct ABattlegroundMapElementActor*> AllMapElementsActors; // 0x708(0x10)
	struct TArray<struct ABattlegroundControlPoint*> AllControlPoints; // 0x718(0x10)
	int32_t AllMapElementsActorCount; // 0x728(0x04)
	bool AllMapElementsActorReady; // 0x72c(0x01)
	bool SubModeDataSet; // 0x72d(0x01)
	char pad_72E[0x22]; // 0x72e(0x22)

	void UnregisterMapElement(struct ABattlegroundMapElementActor* InActor); // Function Solarland.BattlegroundGameState.UnregisterMapElement // (Final|Native|Public) // @ game+0x265e090
	void RegisterMapElement(struct ABattlegroundMapElementActor* InActor); // Function Solarland.BattlegroundGameState.RegisterMapElement // (Final|Native|Public) // @ game+0x265de30
	void OnSetMatchState__DelegateSignature(struct FName& NewState); // DelegateFunction Solarland.BattlegroundGameState.OnSetMatchState__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2d0d160
	void OnServerLevelLoaded(struct FString LevelName); // Function Solarland.BattlegroundGameState.OnServerLevelLoaded // (Final|Native|Public) // @ game+0x265db50
	void OnRep_SubModeData(); // Function Solarland.BattlegroundGameState.OnRep_SubModeData // (Final|Native|Protected) // @ game+0x265db30
	void OnRep_ScoreData(); // Function Solarland.BattlegroundGameState.OnRep_ScoreData // (Final|Native|Protected) // @ game+0x265db10
	void OnReceivedScoreDataChanged(struct TArray<struct FBattlegroundScoreData>& InData); // Function Solarland.BattlegroundGameState.OnReceivedScoreDataChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerJoinTeam(struct ASolarTeamInfo* TeamInfo, struct ASolarPlayerState* PlayerState); // Function Solarland.BattlegroundGameState.OnPlayerJoinTeam // (Final|Native|Protected) // @ game+0x265d790
	void OnOccupiedFactionChanged(struct ABattlegroundControlPoint* BattlegroundControlPoint); // Function Solarland.BattlegroundGameState.OnOccupiedFactionChanged // (Final|Native|Public) // @ game+0x265d700
	void OnCountdownChangeDelegate__DelegateSignature(char InValue); // DelegateFunction Solarland.BattlegroundGameState.OnCountdownChangeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnAddBonusScore(); // Function Solarland.BattlegroundGameState.OnAddBonusScore // (Final|Native|Protected) // @ game+0x265d5e0
	bool K2_HasMatchEnded(); // Function Solarland.BattlegroundGameState.K2_HasMatchEnded // (Final|Native|Protected|BlueprintCallable) // @ game+0x265d590
	void HideAllAirWall(); // Function Solarland.BattlegroundGameState.HideAllAirWall // (Final|Native|Public|BlueprintCallable) // @ game+0x265d4d0
	struct FBattlegroundSubModeData GetSubModeData(); // Function Solarland.BattlegroundGameState.GetSubModeData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d490
	struct TArray<struct FBattlegroundScoreData> GetScoreData(); // Function Solarland.BattlegroundGameState.GetScoreData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d420
	int32_t GetPersonalScoreByType(enum class EPersonalScoreType InType); // Function Solarland.BattlegroundGameState.GetPersonalScoreByType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d210
	int32_t GetMinPlayerLimit(); // Function Solarland.BattlegroundGameState.GetMinPlayerLimit // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d1f0
	int32_t GetMaxPlayerLimit(); // Function Solarland.BattlegroundGameState.GetMaxPlayerLimit // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d1d0
	struct ABattlegroundMapElementActor* GetMapElementByType(enum class EDeploymentType InType); // Function Solarland.BattlegroundGameState.GetMapElementByType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d140
	struct FBattlegroundGlobalData GetGlobalData(); // Function Solarland.BattlegroundGameState.GetGlobalData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x265d110
};

// Class Solarland.SolarHUD
// Size: 0x318 (Inherited: 0x318)
struct ASolarHUD : AHUD {
};

// Class Solarland.BattleHUDBase
// Size: 0x3b0 (Inherited: 0x318)
struct ABattleHUDBase : ASolarHUD {
	struct UHUDDispatcherBase* Dispatcher; // 0x318(0x08)
	struct UHUDDispatcherBase* WidgetEventDispatcher; // 0x320(0x08)
	struct FSoftObjectPath TeammateUI; // 0x328(0x18)
	bool bSingle; // 0x340(0x01)
	bool bUseBattleDeathView; // 0x341(0x01)
	char pad_342[0x6]; // 0x342(0x06)
	struct USolarPlayersHPModel* PlayersHPModel; // 0x348(0x08)
	struct USolarPlayersShieldModel* PlayersShieldModel; // 0x350(0x08)
	struct USolarTeamInfoModel* TeamInfoModelModel; // 0x358(0x08)
	char pad_360[0x50]; // 0x360(0x50)

	void ShowDiePage_Deprecated(); // Function Solarland.BattleHUDBase.ShowDiePage_Deprecated // (Final|Native|Public|BlueprintCallable) // @ game+0x2662680
	void OnPlayerStateRepInController(enum class EPlayerStateRepType RepType, struct APlayerState* PlayerState); // Function Solarland.BattleHUDBase.OnPlayerStateRepInController // (Native|Protected) // @ game+0x2661fd0
	void OnPlayerStateRepInCharacter(enum class EPlayerStateRepType RepType, struct APlayerState* PlayerState); // Function Solarland.BattleHUDBase.OnPlayerStateRepInCharacter // (Native|Protected) // @ game+0x2661f00
	void OnNewTeamInfo(struct ASolarTeamInfo* TeamInfo); // Function Solarland.BattleHUDBase.OnNewTeamInfo // (Native|Protected) // @ game+0x2661c60
	void OnCharacterEndPlay(struct ASolarCharacter* Character); // Function Solarland.BattleHUDBase.OnCharacterEndPlay // (Native|Protected) // @ game+0x26619d0
	struct UUISubsystem* GetUISubSystem(); // Function Solarland.BattleHUDBase.GetUISubSystem // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x26618b0
	void CloseDiePage_Deprecated(struct UUserWidget* InDiePageClass); // Function Solarland.BattleHUDBase.CloseDiePage_Deprecated // (Final|Native|Public|BlueprintCallable) // @ game+0x2661470
};

// Class Solarland.BattlegroundHUD
// Size: 0x3b8 (Inherited: 0x3b0)
struct ABattlegroundHUD : ABattleHUDBase {
	char pad_3B0[0x8]; // 0x3b0(0x08)

	void OnPlayerStatusChanged(enum class EBattlegroundPlayerStatus InStatus); // Function Solarland.BattlegroundHUD.OnPlayerStatusChanged // (Final|Native|Private) // @ game+0x26620a0
	void OnPersonalScoreChanged(enum class EPersonalScoreType InType, struct FString Param); // Function Solarland.BattlegroundHUD.OnPersonalScoreChanged // (Final|Native|Private) // @ game+0x2661d80
	void OnMatchStateChanged(struct FName& InState); // Function Solarland.BattlegroundHUD.OnMatchStateChanged // (Final|Native|Private|HasOutParms) // @ game+0x2661bd0
	void OnCountdownChanged(char InValue); // Function Solarland.BattlegroundHUD.OnCountdownChanged // (Final|Native|Private) // @ game+0x2661b30
	void K2_OnPlayerStatusChanged(enum class EBattlegroundPlayerStatus InStatus); // Function Solarland.BattlegroundHUD.K2_OnPlayerStatusChanged // (Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	void K2_OnPersonalScoreChanged(enum class EPersonalScoreType InType, struct FString Param); // Function Solarland.BattlegroundHUD.K2_OnPersonalScoreChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void K2_OnCountdownChanged(char InValue); // Function Solarland.BattlegroundHUD.K2_OnCountdownChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void K2_HandleCountDownToBegin(); // Function Solarland.BattlegroundHUD.K2_HandleCountDownToBegin // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void InitBattlegroundHUD(enum class EBattlegroundPlayerStatus InStatus); // Function Solarland.BattlegroundHUD.InitBattlegroundHUD // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.BattlegroundMapElementInterface
// Size: 0x28 (Inherited: 0x28)
struct UBattlegroundMapElementInterface : UInterface {
};

// Class Solarland.BattlegroundPlayerStart
// Size: 0x270 (Inherited: 0x258)
struct ABattlegroundPlayerStart : APlayerStart {
	char pad_258[0x8]; // 0x258(0x08)
	struct FBattlegroundMapElementData MapElementData; // 0x260(0x0c)
	char pad_26C[0x4]; // 0x26c(0x04)
};

// Class Solarland.SolarPlayerState
// Size: 0xc48 (Inherited: 0x330)
struct ASolarPlayerState : APlayerState {
	struct FMulticastInlineDelegate OnTeammatePlayerStateRepDelegate; // 0x330(0x10)
	struct FMulticastInlineDelegate OnTeammatePlayerStateRemovedInPreparatoryPhaseDelegate; // 0x340(0x10)
	struct FMulticastInlineDelegate OnTeammatePlayerStateRemovedInBattlePhaseDelegate; // 0x350(0x10)
	struct FMulticastInlineDelegate OnPlayerChangedGoldsDelegate; // 0x360(0x10)
	struct FMulticastInlineDelegate OnOBPlayerRepDelegate; // 0x370(0x10)
	int32_t Gold; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct TArray<int32_t> CostedGolds; // 0x388(0x10)
	struct TArray<int32_t> ReceivedGolds; // 0x398(0x10)
	int32_t CharacterId; // 0x3a8(0x04)
	int32_t SkinId; // 0x3ac(0x04)
	struct FString ClanId; // 0x3b0(0x10)
	struct FString ClanName; // 0x3c0(0x10)
	struct FString ClanShortName; // 0x3d0(0x10)
	int32_t BagId; // 0x3e0(0x04)
	int32_t CapsuleID; // 0x3e4(0x04)
	struct FString SolarPlayerID; // 0x3e8(0x10)
	struct FString NickName; // 0x3f8(0x10)
	uint32_t BattleVoiceId; // 0x408(0x04)
	char pad_40C[0x4]; // 0x40c(0x04)
	int64_t RTCType; // 0x410(0x08)
	uint64_t UserId; // 0x418(0x08)
	char PosInTeam; // 0x420(0x01)
	char pad_421[0x3]; // 0x421(0x03)
	int32_t CharacterLevel; // 0x424(0x04)
	int32_t AvatarID; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)
	struct FString AvatarUrl; // 0x430(0x10)
	int32_t AvatarFrameID; // 0x440(0x04)
	int32_t Gender; // 0x444(0x04)
	int32_t AccountLevel; // 0x448(0x04)
	int32_t FriendNum; // 0x44c(0x04)
	int32_t RoleID; // 0x450(0x04)
	char pad_454[0x4]; // 0x454(0x04)
	struct TArray<struct FMedalInfo> Medals; // 0x458(0x10)
	struct TArray<struct FBattleCharacterData> AllCharacterData; // 0x468(0x10)
	struct TArray<struct FCharacterSkin> AllSkins; // 0x478(0x10)
	struct TArray<int32_t> AllVoices; // 0x488(0x10)
	struct FBattleCharacterData CurUsedCharacterData; // 0x498(0x60)
	struct TArray<int32_t> KillReports; // 0x4f8(0x10)
	struct TArray<struct FExpRankMedalData> AllExpRankMedalData; // 0x508(0x10)
	struct FLastBattleInfo LastBattleInfo; // 0x518(0x1c)
	char pad_534[0x4]; // 0x534(0x04)
	struct TArray<struct FString> ReCombatLimitPlayer; // 0x538(0x10)
	int32_t RoleUltimateSkillCDState; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
	struct TArray<struct FSettlementParam_ExtraRewardInfo> ExtraRewards; // 0x550(0x10)
	struct TArray<struct FSettlementReward> SettlementRewards; // 0x560(0x10)
	struct TArray<struct FSettlementCrateReward> CrateRewards; // 0x570(0x10)
	uint32_t PlayerNumber; // 0x580(0x04)
	char pad_584[0x4]; // 0x584(0x04)
	struct TMap<int32_t, int32_t> VehicleSkinData; // 0x588(0x50)
	float CurrentHealth; // 0x5d8(0x04)
	float MaxHealth; // 0x5dc(0x04)
	struct FShieldInfo CurShieldInfo; // 0x5e0(0x08)
	char ReviveItemNum; // 0x5e8(0x01)
	char ReviveCountByItem; // 0x5e9(0x01)
	char pad_5EA[0x2]; // 0x5ea(0x02)
	int32_t TalentID; // 0x5ec(0x04)
	int32_t LikeValue; // 0x5f0(0x04)
	int32_t ReceivedGiftNum; // 0x5f4(0x04)
	char pad_5F8[0x8]; // 0x5f8(0x08)
	struct FMulticastInlineDelegate OnWatchingFriendCountChanged; // 0x600(0x10)
	int32_t SpectatorNum; // 0x610(0x04)
	enum class ETalentState TalentState; // 0x614(0x01)
	bool HasBackendVerified; // 0x615(0x01)
	bool HasGroupBackendVerified; // 0x616(0x01)
	char pad_617[0x1]; // 0x617(0x01)
	struct FVector2D MarkedPointInNavMap; // 0x618(0x08)
	struct FVector SelfLastVehicleLocation; // 0x620(0x0c)
	struct FVector TeamLastVehicleLocation; // 0x62c(0x0c)
	char CurrentPlayerStateInGame; // 0x638(0x01)
	char CurrentCharacterStateInGame; // 0x639(0x01)
	char pad_63A[0x2]; // 0x63a(0x02)
	int32_t AccountFlag; // 0x63c(0x04)
	int32_t ClanFlag; // 0x640(0x04)
	char pad_644[0x4]; // 0x644(0x04)
	struct TArray<int32_t> EquippedEmotes; // 0x648(0x10)
	struct TMap<int32_t, struct FEquippedEmotesData> AllCharacterEquippedEmotes; // 0x658(0x50)
	struct FString OS; // 0x6a8(0x10)
	struct FString OsType; // 0x6b8(0x10)
	struct FString DeviceModel; // 0x6c8(0x10)
	enum class ECommonInputType InputType; // 0x6d8(0x01)
	bool bUsedGamePad; // 0x6d9(0x01)
	bool bIsSameTeamWithLocalPlayer; // 0x6da(0x01)
	bool HasReconnection; // 0x6db(0x01)
	char pad_6DC[0x4]; // 0x6dc(0x04)
	bool bHasHangUpBehavior; // 0x6e0(0x01)
	char pad_6E1[0x3]; // 0x6e1(0x03)
	float HangUpTime; // 0x6e4(0x04)
	float OfflineBattleTime; // 0x6e8(0x04)
	int32_t Elo; // 0x6ec(0x04)
	int32_t RankLevel; // 0x6f0(0x04)
	int32_t RankLevel2; // 0x6f4(0x04)
	int32_t LegendRank; // 0x6f8(0x04)
	float StartWaitTime; // 0x6fc(0x04)
	float ReportedWaitTime; // 0x700(0x04)
	char VipType; // 0x704(0x01)
	char pad_705[0x3]; // 0x705(0x03)
	int32_t WarmupTag; // 0x708(0x04)
	float Frustration; // 0x70c(0x04)
	bool bMonitor; // 0x710(0x01)
	char LobbyTeamMemberNum; // 0x711(0x01)
	char pad_712[0x16]; // 0x712(0x16)
	bool bTeamIDHasChanged; // 0x728(0x01)
	char pad_729[0x3]; // 0x729(0x03)
	int32_t RepliableMessageID; // 0x72c(0x04)
	float RepliableMessageStartTime; // 0x730(0x04)
	char pad_734[0xc]; // 0x734(0x0c)
	bool bIsOBPlayer; // 0x740(0x01)
	char pad_741[0x3]; // 0x741(0x03)
	int32_t WarmId; // 0x744(0x04)
	int32_t WarmType; // 0x748(0x04)
	bool AllowOtherJoin; // 0x74c(0x01)
	char pad_74D[0x3]; // 0x74d(0x03)
	struct FString SocialTeamID; // 0x750(0x10)
	float WaitTimeBeforeEnterSpectateMode; // 0x760(0x04)
	char pad_764[0x4]; // 0x764(0x04)
	struct FMulticastInlineDelegate OnSpectateInfoRep; // 0x768(0x10)
	struct ASolarPlayerState* KillerPlayerState; // 0x778(0x08)
	struct ASolarPlayerState* RevengePlayerState; // 0x780(0x08)
	struct TArray<struct FKillEnemySnapshot> KilledEnemysRecord; // 0x788(0x10)
	struct ASolarSpectateInfo* SpectateInfo; // 0x798(0x08)
	enum class EPlayerNetStateInGame NetStateInGame; // 0x7a0(0x01)
	bool bHasLogin; // 0x7a1(0x01)
	char pad_7A2[0xe]; // 0x7a2(0x0e)
	bool bHasUpdateByServerData; // 0x7b0(0x01)
	char pad_7B1[0x7]; // 0x7b1(0x07)
	struct USolarReplayHighlightComponent* ReplayHightlightComp; // 0x7b8(0x08)
	int32_t KillNum; // 0x7c0(0x04)
	char pad_7C4[0x1c]; // 0x7c4(0x1c)
	int32_t AssistNum; // 0x7e0(0x04)
	char pad_7E4[0x1c]; // 0x7e4(0x1c)
	struct FVector DeathPos; // 0x800(0x0c)
	int32_t ReconnectNum; // 0x80c(0x04)
	char pad_810[0x10]; // 0x810(0x10)
	float MultiKillDurationTime; // 0x820(0x04)
	char pad_824[0x14]; // 0x824(0x14)
	float TotalReceivedDamage; // 0x838(0x04)
	float HealSelf; // 0x83c(0x04)
	float ReceivedHeal; // 0x840(0x04)
	float LifeTime; // 0x844(0x04)
	struct FSettlementTempData SettleSyncData; // 0x848(0xd8)
	int32_t PlayerRank; // 0x920(0x04)
	bool IsAce; // 0x924(0x01)
	bool bMVP; // 0x925(0x01)
	char pad_926[0x1]; // 0x926(0x01)
	bool IsVictory; // 0x927(0x01)
	float MvpScore; // 0x928(0x04)
	float KDA; // 0x92c(0x04)
	int32_t ResurrectionTimes; // 0x930(0x04)
	int32_t CharacterExp; // 0x934(0x04)
	struct TArray<int32_t> CharacterExpReason; // 0x938(0x10)
	int32_t GainCombatScore; // 0x948(0x04)
	int32_t AccountExp; // 0x94c(0x04)
	struct TMap<int32_t, int32_t> WeaponExps; // 0x950(0x50)
	int32_t Zomborg; // 0x9a0(0x04)
	int32_t ZomborgExtra; // 0x9a4(0x04)
	struct TArray<enum class ESCMPlayerPunishType> SettlePunishTypes; // 0x9a8(0x10)
	struct TMap<int32_t, int32_t> CollectionItemRewards; // 0x9b8(0x50)
	struct TArray<int32_t> StrategyConditionIDs; // 0xa08(0x10)
	int32_t SettlementDisplayStrategyID; // 0xa18(0x04)
	char pad_A1C[0x1c]; // 0xa1c(0x1c)
	enum class ESCMPlayerOutPath PlayerOutPath; // 0xa38(0x01)
	char pad_A39[0x7]; // 0xa39(0x07)
	struct TArray<int32_t> UsedCharacterIDs; // 0xa40(0x10)
	bool bPresettling; // 0xa50(0x01)
	bool bHasSettled; // 0xa51(0x01)
	bool bIsPlayerBattleEnd; // 0xa52(0x01)
	char pad_A53[0x1]; // 0xa53(0x01)
	int32_t InteractValue; // 0xa54(0x04)
	float LastInteractTime; // 0xa58(0x04)
	float DamageFactor; // 0xa5c(0x04)
	float VehicleProbability; // 0xa60(0x04)
	bool bIsTimeoutPlayer; // 0xa64(0x01)
	char bShowBattlePrompt : 1; // 0xa65(0x01)
	char pad_A65_1 : 7; // 0xa65(0x01)
	char pad_A66[0x22]; // 0xa66(0x22)
	struct FExposeLocationMap ExposeLocationMap; // 0xa88(0x58)
	struct TArray<struct ASolarPlayerState*> ExposeLocationArray; // 0xae0(0x10)
	struct FVector PlayerLocation; // 0xaf0(0x0c)
	char pad_AFC[0x4]; // 0xafc(0x04)
	struct ASolarPlayerState* ExposeTo; // 0xb00(0x08)
	char pad_B08[0x8]; // 0xb08(0x08)
	int32_t SkydivingLeaderPosInTeam; // 0xb10(0x04)
	char SkydivingFollowFormationPos; // 0xb14(0x01)
	char pad_B15[0x7]; // 0xb15(0x07)
	enum class ESkydivingState SkydivingState; // 0xb1c(0x01)
	char pad_B1D[0x3]; // 0xb1d(0x03)
	struct USolarAchievementComponent* AchievementComponent; // 0xb20(0x08)
	char pad_B28[0x8]; // 0xb28(0x08)
	struct TArray<int32_t> PreCompletedAchievementIDs; // 0xb30(0x10)
	char pad_B40[0x18]; // 0xb40(0x18)
	int32_t PlayerLevel; // 0xb58(0x04)
	int32_t PlayerExperience; // 0xb5c(0x04)
	int32_t HistoryShieldUpgradeItemNum; // 0xb60(0x04)
	char pad_B64[0x1c]; // 0xb64(0x1c)
	struct ASpatializeInfoTrack* TrackInfo; // 0xb80(0x08)
	float TrackMaxRevealDistance; // 0xb88(0x04)
	enum class EAppLifetimeState AppLifetimeState; // 0xb8c(0x01)
	char pad_B8D[0x3]; // 0xb8d(0x03)
	int32_t TailFlameId; // 0xb90(0x04)
	char pad_B94[0x4]; // 0xb94(0x04)
	struct ASolarTeamInfo* Team; // 0xb98(0x08)
	char pad_BA0[0x28]; // 0xba0(0x28)
	struct TArray<struct FSolarBattleWeaponData> BattleWeaponDataArray; // 0xbc8(0x10)
	struct AHeroPickInfo* HeroPickInfo; // 0xbd8(0x08)
	char pad_BE0[0x68]; // 0xbe0(0x68)

	bool WillFollowMovementOfSkydivingLeader(); // Function Solarland.SolarPlayerState.WillFollowMovementOfSkydivingLeader // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2876020
	void UpgradePlayerLevel(int32_t LevelAdded); // Function Solarland.SolarPlayerState.UpgradePlayerLevel // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x2875f90
	void UpdateCurUseCharacterData(int32_t InCharacterId); // Function Solarland.SolarPlayerState.UpdateCurUseCharacterData // (Final|Native|Public) // @ game+0x2875f00
	void UpdateCurUseCharacterAndSkinData(int32_t InCharacterId, int32_t InSkinID); // Function Solarland.SolarPlayerState.UpdateCurUseCharacterAndSkinData // (Final|Native|Public) // @ game+0x2875e30
	void UpdateAICharacterDataList(struct FBattleCharacterData& InCharacterData); // Function Solarland.SolarPlayerState.UpdateAICharacterDataList // (Final|Native|Public|HasOutParms) // @ game+0x2875d30
	bool TryGetVehicleDamageInfo(struct TArray<int32_t>& OutVehicleDamageInfo); // Function Solarland.SolarPlayerState.TryGetVehicleDamageInfo // (Final|Native|Public|HasOutParms|Const) // @ game+0x2875c70
	bool TryGetSafeAreaInfo(struct TArray<int32_t>& OutSafeZoneInfo); // Function Solarland.SolarPlayerState.TryGetSafeAreaInfo // (Final|Native|Public|HasOutParms|Const) // @ game+0x2875bb0
	bool TryGetPlayerBackpackItems(struct TArray<int32_t>& OutWeaponIds); // Function Solarland.SolarPlayerState.TryGetPlayerBackpackItems // (Final|Native|Public|HasOutParms|Const) // @ game+0x2875af0
	void SyncMarkedWorldData(struct FWorldMarkData InMarkData); // Function Solarland.SolarPlayerState.SyncMarkedWorldData // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2875820
	void SynchronizePlayerStateInGame(enum class EPlayerStateInGame InEPlayerStateInGame, bool InIfOrNot); // Function Solarland.SolarPlayerState.SynchronizePlayerStateInGame // (Final|Native|Public) // @ game+0x2875a20
	void SynchronizeCharacterStateInGame(enum class ECharacterStateInGame InECharacterStateInGame, bool InIfOrNot); // Function Solarland.SolarPlayerState.SynchronizeCharacterStateInGame // (Final|Native|Public) // @ game+0x2875950
	void StatWeaponLevelAndTime(); // Function Solarland.SolarPlayerState.StatWeaponLevelAndTime // (Final|Native|Public) // @ game+0x2875800
	void StatWeaponBattleDetailInfo(); // Function Solarland.SolarPlayerState.StatWeaponBattleDetailInfo // (Final|Native|Public) // @ game+0x28757e0
	void StatVehicleDriveTypeLuaCall(int32_t DriveType); // Function Solarland.SolarPlayerState.StatVehicleDriveTypeLuaCall // (Final|Native|Public|BlueprintCallable) // @ game+0x2875750
	void StatVehicleDriveType(int32_t DriveType); // Function Solarland.SolarPlayerState.StatVehicleDriveType // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x28756c0
	void ShowTeammatesHUD(struct TArray<struct ASolarPlayerState*>& TeammateStates, struct ASolarPlayerState* InSpectateTargetPlayerState); // Function Solarland.SolarPlayerState.ShowTeammatesHUD // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x28755c0
	void SetRoleUltimateSkillCDState(int32_t NewState); // Function Solarland.SolarPlayerState.SetRoleUltimateSkillCDState // (Final|Native|Public) // @ game+0x28751e0
	void SetRoleID(int32_t InRoleID); // Function Solarland.SolarPlayerState.SetRoleID // (Final|Native|Public) // @ game+0x2875150
	void SetPlayerNetStateInGame(enum class EPlayerNetStateInGame InPlayerNetStateInGame); // Function Solarland.SolarPlayerState.SetPlayerNetStateInGame // (Final|Native|Public) // @ game+0x28750d0
	void SetIsTimeoutPlayer(bool InValue); // Function Solarland.SolarPlayerState.SetIsTimeoutPlayer // (Final|Native|Public) // @ game+0x2875040
	void SetIsPlayerBattleEnd(bool bPlayerBattleEnd); // Function Solarland.SolarPlayerState.SetIsPlayerBattleEnd // (Final|Native|Public|BlueprintCallable) // @ game+0x2874fb0
	void SetDeserter(bool InIsDeserter); // Function Solarland.SolarPlayerState.SetDeserter // (Final|Native|Public|BlueprintCallable) // @ game+0x2874ea0
	void SetDeathboxSkinId(struct TArray<int32_t>& InOwnedDeathboxSkinIds); // Function Solarland.SolarPlayerState.SetDeathboxSkinId // (Final|Native|Public|HasOutParms) // @ game+0x2874df0
	void ServerUpdateInputType(enum class ECommonInputType NowInputType); // Function Solarland.SolarPlayerState.ServerUpdateInputType // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2874d70
	void ServerUnexposeLocationToOtherOnce(struct ASolarPlayerState* OtherPS); // Function Solarland.SolarPlayerState.ServerUnexposeLocationToOtherOnce // (Final|Native|Public|BlueprintCallable) // @ game+0x2874ce0
	void ServerUnexposeLocationToOther(struct ASolarPlayerState* OtherPS); // Function Solarland.SolarPlayerState.ServerUnexposeLocationToOther // (Final|Native|Public|BlueprintCallable) // @ game+0x2874c50
	void ServerReportWaitTime(); // Function Solarland.SolarPlayerState.ServerReportWaitTime // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1ae4810
	void ServerPlayerSelectSkin(int32_t InCharacterId, int32_t InSkinID); // Function Solarland.SolarPlayerState.ServerPlayerSelectSkin // (Final|Native|Public) // @ game+0x2874b80
	void ServerHeroRequest(int32_t InCharacterId); // Function Solarland.SolarPlayerState.ServerHeroRequest // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2874af0
	void ServerExposeLocationToOther(struct ASolarPlayerState* OtherPS); // Function Solarland.SolarPlayerState.ServerExposeLocationToOther // (Final|Native|Public|BlueprintCallable) // @ game+0x2874a60
	void ServerChangeRoleID(int32_t InRoleID); // Function Solarland.SolarPlayerState.ServerChangeRoleID // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x28749d0
	void ReviseWeaponExp(int32_t weaponid, int32_t WeaponExp, int32_t CurLevel, int32_t CurExp); // Function Solarland.SolarPlayerState.ReviseWeaponExp // (Final|Native|Protected|BlueprintCallable) // @ game+0x2874880
	void RequestServerUpdateInputType(enum class ECommonInputType NowInputType); // Function Solarland.SolarPlayerState.RequestServerUpdateInputType // (Final|Native|Public|BlueprintCallable) // @ game+0x2872ea0
	void ReportWaitTime(); // Function Solarland.SolarPlayerState.ReportWaitTime // (Final|Native|Public|BlueprintCallable) // @ game+0x2874860
	void RemoveMarkedWorldDataFromLua(struct FWorldMarkData& InMarkData); // Function Solarland.SolarPlayerState.RemoveMarkedWorldDataFromLua // (Final|Native|Public|HasOutParms) // @ game+0x2874730
	void RemoveMarkedWorldData(struct FWorldMarkData InMarkData); // Function Solarland.SolarPlayerState.RemoveMarkedWorldData // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2874600
	void ReceiveTeamIdReplicated(bool bRelatedToSelf); // Function Solarland.SolarPlayerState.ReceiveTeamIdReplicated // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveTalentStateSet(enum class ETalentState InState); // Function Solarland.SolarPlayerState.ReceiveTalentStateSet // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveTalentIDReplication(enum class EPlayerStateRepType RepType, struct APlayerState* ClientOwnerPS); // Function Solarland.SolarPlayerState.ReceiveTalentIDReplication // (Final|Native|Protected) // @ game+0x2874530
	void ReceiveSideReplicatedAfter(); // Function Solarland.SolarPlayerState.ReceiveSideReplicatedAfter // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePostInitializeComponents(); // Function Solarland.SolarPlayerState.ReceivePostInitializeComponents // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	bool ReceiveGold(int32_t InReceivedGold, bool NeedSyncToServer, bool NeedSyncToDS); // Function Solarland.SolarPlayerState.ReceiveGold // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x2874420
	void ReceiveClientInitialize(struct AController* C); // Function Solarland.SolarPlayerState.ReceiveClientInitialize // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void PlayerSelectSkin(int32_t InCharacterId, int32_t InSkinID); // Function Solarland.SolarPlayerState.PlayerSelectSkin // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2874280
	void PlayerSelectHero(int32_t InCharacterId, int32_t InSkinID, bool bConfirm); // Function Solarland.SolarPlayerState.PlayerSelectHero // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x2874170
	bool PlayerIsResurrecting(); // Function Solarland.SolarPlayerState.PlayerIsResurrecting // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	bool PlayerHasLogin(); // Function Solarland.SolarPlayerState.PlayerHasLogin // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2874150
	bool PlayerCanRebirthByReviveItem(bool bCheckItemNum, bool bIncludingReviving); // Function Solarland.SolarPlayerState.PlayerCanRebirthByReviveItem // (Final|Native|Public|Const) // @ game+0x2874070
	bool PlayerCanRebirthByBuyResurrection(); // Function Solarland.SolarPlayerState.PlayerCanRebirthByBuyResurrection // (Final|Native|Public|BlueprintCallable) // @ game+0x2874040
	bool PlayerCanRebirthByAllMeans(); // Function Solarland.SolarPlayerState.PlayerCanRebirthByAllMeans // (Final|Native|Public|BlueprintCallable) // @ game+0x2874010
	bool PlayerCanRebirthBlueprint(); // Function Solarland.SolarPlayerState.PlayerCanRebirthBlueprint // (Native|Event|Protected|BlueprintEvent) // @ game+0x2873fe0
	bool PlayerCanRebirth(); // Function Solarland.SolarPlayerState.PlayerCanRebirth // (Native|Public|BlueprintCallable) // @ game+0x27087b0
	bool PlayerCanBuyRescue(); // Function Solarland.SolarPlayerState.PlayerCanBuyRescue // (Native|Public|BlueprintCallable) // @ game+0x27084b0
	void OnWatchingFriendCountChanged__DelegateSignature(int32_t WatchingFriendCount); // DelegateFunction Solarland.SolarPlayerState.OnWatchingFriendCountChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnUpdatedPlayerStateLoginData(); // Function Solarland.SolarPlayerState.OnUpdatedPlayerStateLoginData // (Final|Native|Public) // @ game+0x2873fc0
	void OnTeammatePlayerStateRepDelegate__DelegateSignature(); // DelegateFunction Solarland.SolarPlayerState.OnTeammatePlayerStateRepDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnTeammatePlayerStateRemovedDelegate__DelegateSignature(char& InPosInTeam, bool InIsLastOne); // DelegateFunction Solarland.SolarPlayerState.OnTeammatePlayerStateRemovedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x2d0d160
	void OnTeamInfoChanged__DelegateSignature(struct ASolarTeamInfo* PreviousTeam, struct ASolarTeamInfo* NowTeam); // DelegateFunction Solarland.SolarPlayerState.OnTeamInfoChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnStopReceiveExposedLocation(struct ASolarPlayerState* OtherPS); // Function Solarland.SolarPlayerState.OnStopReceiveExposedLocation // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnStartResurrectProgress(int32_t InTextId, float InDuration, float InRemaining, bool bShowCancel); // Function Solarland.SolarPlayerState.OnStartResurrectProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x2873e60
	void OnSpectateTargetChanged(struct ASolarPlayerState* InOldTarget, struct ASolarSpectateInfo* InSpectateInfo); // Function Solarland.SolarPlayerState.OnSpectateTargetChanged // (Final|Native|Private) // @ game+0x2873d90
	void OnSpectateInfoRep__DelegateSignature(struct ASolarSpectateInfo* SpectateInfo); // DelegateFunction Solarland.SolarPlayerState.OnSpectateInfoRep__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnRequestStartResurrect(struct ADeathTreasureBox* InDeatbox); // Function Solarland.SolarPlayerState.OnRequestStartResurrect // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnRequestCancelResurrect(struct ADeathTreasureBox* InDeatbox); // Function Solarland.SolarPlayerState.OnRequestCancelResurrect // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	void OnReplayRecordingStarted(); // Function Solarland.SolarPlayerState.OnReplayRecordingStarted // (Final|Native|Private) // @ game+0x2873cf0
	void OnRep_UserId(); // Function Solarland.SolarPlayerState.OnRep_UserId // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnRep_TotalReceivedDamage(); // Function Solarland.SolarPlayerState.OnRep_TotalReceivedDamage // (Final|Native|Private) // @ game+0x2873cd0
	void OnRep_TeammatesState(); // Function Solarland.SolarPlayerState.OnRep_TeammatesState // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnRep_TeamLastVehicleLocation(); // Function Solarland.SolarPlayerState.OnRep_TeamLastVehicleLocation // (Native|Public) // @ game+0x1ae6450
	void OnRep_TeamChanged(struct ASolarTeamInfo* PreviousTeam); // Function Solarland.SolarPlayerState.OnRep_TeamChanged // (Final|Native|Public) // @ game+0x2873c40
	void OnRep_TalentID(); // Function Solarland.SolarPlayerState.OnRep_TalentID // (Final|Native|Public) // @ game+0x2873c20
	void OnRep_TailFlameId(); // Function Solarland.SolarPlayerState.OnRep_TailFlameId // (Final|Native|Public) // @ game+0x2873c00
	void OnRep_SpectateInfo(); // Function Solarland.SolarPlayerState.OnRep_SpectateInfo // (Final|Native|Private) // @ game+0x2873be0
	void OnRep_SkydivingState(); // Function Solarland.SolarPlayerState.OnRep_SkydivingState // (Final|Native|Public) // @ game+0x2873bc0
	void OnRep_SkydivingLeaderPosInTeam(int32_t OldValue); // Function Solarland.SolarPlayerState.OnRep_SkydivingLeaderPosInTeam // (Final|Native|Public) // @ game+0x2873b30
	void OnRep_SkinId(); // Function Solarland.SolarPlayerState.OnRep_SkinId // (Native|Public) // @ game+0x1ae5e70
	void OnRep_Side(struct FString OldSide); // Function Solarland.SolarPlayerState.OnRep_Side // (Native|Public) // @ game+0x2873a90
	void OnRep_SelfLastVehicleLocation(); // Function Solarland.SolarPlayerState.OnRep_SelfLastVehicleLocation // (Native|Public) // @ game+0x1ae61d0
	void OnRep_RTCType(); // Function Solarland.SolarPlayerState.OnRep_RTCType // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnRep_RoleID(); // Function Solarland.SolarPlayerState.OnRep_RoleID // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnRep_ReviveItemNum(); // Function Solarland.SolarPlayerState.OnRep_ReviveItemNum // (Native|Public) // @ game+0x1ae64b0
	void OnRep_ReviveCountByItem(); // Function Solarland.SolarPlayerState.OnRep_ReviveCountByItem // (Native|Public) // @ game+0x1ae5870
	void OnRep_RepliableMsg(); // Function Solarland.SolarPlayerState.OnRep_RepliableMsg // (Final|Native|Public) // @ game+0x2873a70
	void OnRep_ReceivedGiftNum(); // Function Solarland.SolarPlayerState.OnRep_ReceivedGiftNum // (Final|Native|Private) // @ game+0x2873a50
	void OnRep_PosInTeam(char& InLastPosInTeam); // Function Solarland.SolarPlayerState.OnRep_PosInTeam // (Native|Public|HasOutParms) // @ game+0x28739b0
	void OnRep_PlayerLocation(); // Function Solarland.SolarPlayerState.OnRep_PlayerLocation // (Native|Protected) // @ game+0x1ae6650
	void OnRep_PlayerLevel(); // Function Solarland.SolarPlayerState.OnRep_PlayerLevel // (Native|Public) // @ game+0x1ae65b0
	void OnRep_PlayerExp(); // Function Solarland.SolarPlayerState.OnRep_PlayerExp // (Native|Public) // @ game+0x1ae67d0
	void OnRep_NickName(struct FString OldNickName); // Function Solarland.SolarPlayerState.OnRep_NickName // (Final|Native|Public) // @ game+0x2873910
	void OnRep_NetStateInGame(); // Function Solarland.SolarPlayerState.OnRep_NetStateInGame // (Native|Public) // @ game+0x1ae5eb0
	void OnRep_MaxHealth(); // Function Solarland.SolarPlayerState.OnRep_MaxHealth // (Native|Public) // @ game+0x1ae6570
	void OnRep_MarkedPointInNavMap(); // Function Solarland.SolarPlayerState.OnRep_MarkedPointInNavMap // (Native|Public) // @ game+0x1ae6250
	void OnRep_KillNum(); // Function Solarland.SolarPlayerState.OnRep_KillNum // (Final|Native|Public) // @ game+0x28738f0
	void OnRep_Job(); // Function Solarland.SolarPlayerState.OnRep_Job // (Final|Native|Public) // @ game+0x9043b0
	void OnRep_IsOBPlayer(); // Function Solarland.SolarPlayerState.OnRep_IsOBPlayer // (Final|Native|Public) // @ game+0x28738d0
	void OnRep_InputType(); // Function Solarland.SolarPlayerState.OnRep_InputType // (Final|Native|Public) // @ game+0x28738b0
	void OnRep_HeroPickInfo(); // Function Solarland.SolarPlayerState.OnRep_HeroPickInfo // (Final|Native|Public) // @ game+0x2873890
	void OnRep_HasSettled(); // Function Solarland.SolarPlayerState.OnRep_HasSettled // (Final|Native|Public) // @ game+0x2873870
	void OnRep_Gold(); // Function Solarland.SolarPlayerState.OnRep_Gold // (Final|Native|Public) // @ game+0x2873850
	void OnRep_ExposeLocationArray(); // Function Solarland.SolarPlayerState.OnRep_ExposeLocationArray // (Native|Protected) // @ game+0x1ae5b90
	void OnRep_EquippedEmotes(); // Function Solarland.SolarPlayerState.OnRep_EquippedEmotes // (Final|Native|Public) // @ game+0x2873830
	void OnRep_CurShieldInfo(struct FShieldInfo& InLastShieldInfo); // Function Solarland.SolarPlayerState.OnRep_CurShieldInfo // (Native|Public|HasOutParms) // @ game+0x2873650
	void OnRep_CurrentPlayerStateInGame(char& InLastPlayerStateInGame); // Function Solarland.SolarPlayerState.OnRep_CurrentPlayerStateInGame // (Native|Public|HasOutParms) // @ game+0x2873790
	void OnRep_CurrentHealth(); // Function Solarland.SolarPlayerState.OnRep_CurrentHealth // (Native|Public) // @ game+0x1ae6110
	void OnRep_CurrentCharacterStateInGame(char& InLastCharacterStateInGame); // Function Solarland.SolarPlayerState.OnRep_CurrentCharacterStateInGame // (Native|Public|HasOutParms) // @ game+0x28736f0
	void OnRep_ClanId(); // Function Solarland.SolarPlayerState.OnRep_ClanId // (Native|Public) // @ game+0x1ae5d10
	void OnRep_ClanFlag(); // Function Solarland.SolarPlayerState.OnRep_ClanFlag // (Final|Native|Public) // @ game+0x2873630
	void OnRep_CharacterId(int32_t OldCharacterId); // Function Solarland.SolarPlayerState.OnRep_CharacterId // (Native|Public) // @ game+0x28735a0
	void OnRep_BattleVoiceId(); // Function Solarland.SolarPlayerState.OnRep_BattleVoiceId // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnRep_BagId(); // Function Solarland.SolarPlayerState.OnRep_BagId // (Final|Native|Public) // @ game+0x2873580
	void OnRep_AssistNum(); // Function Solarland.SolarPlayerState.OnRep_AssistNum // (Final|Native|Public) // @ game+0x2873560
	void OnRep_AccountFlag(); // Function Solarland.SolarPlayerState.OnRep_AccountFlag // (Final|Native|Public) // @ game+0x2873540
	void OnRefreshReviveInfo(); // Function Solarland.SolarPlayerState.OnRefreshReviveInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x2873520
	void OnReceiveExposedLocation(struct ASolarPlayerState* OtherPS, struct FVector& Location); // Function Solarland.SolarPlayerState.OnReceiveExposedLocation // (Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x2d0d160
	struct FString OnPlayerUpgrade(int32_t NewLevel, bool bFromServer); // Function Solarland.SolarPlayerState.OnPlayerUpgrade // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerUpdateStatData(enum class EStatisticsType InType); // Function Solarland.SolarPlayerState.OnPlayerUpdateStatData // (Final|Native|Public) // @ game+0x28734a0
	void OnPlayerGainExperience(int32_t GainedExp, int32_t CurrentExp, int32_t TotalExp, enum class EExpBehaviorType BehaviorType); // Function Solarland.SolarPlayerState.OnPlayerGainExperience // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerChangedGolds(enum class EPlayerChangedGoldType ChangedGoldType, int32_t CostGoldNum, enum class EPlayerChangedGoldResult CostResult); // Function Solarland.SolarPlayerState.OnPlayerChangedGolds // (Net|Native|Event|Public|NetClient) // @ game+0x2873390
	void OnOtherPlayerStopSpectateMyTeam(struct ASolarSpectateInfo* InSpectateInfo); // Function Solarland.SolarPlayerState.OnOtherPlayerStopSpectateMyTeam // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnOtherPlayerStopSpectateMe(struct ASolarPlayerState* InSpectatorPlayerState, struct ASolarSpectateInfo* InSpectateInfo); // Function Solarland.SolarPlayerState.OnOtherPlayerStopSpectateMe // (Final|Native|Private) // @ game+0x28732c0
	void OnOtherPlayerBeginSpectateMe(struct ASolarPlayerState* InSpectatorPlayerState, struct ASolarSpectateInfo* InSpectateInfo); // Function Solarland.SolarPlayerState.OnOtherPlayerBeginSpectateMe // (Final|Native|Private) // @ game+0x28731f0
	void OnOBPlayerRepDelegate__DelegateSignature(bool bIsOBPlayer); // DelegateFunction Solarland.SolarPlayerState.OnOBPlayerRepDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnLiveWatchPlayerCountChanged(int32_t count); // Function Solarland.SolarPlayerState.OnLiveWatchPlayerCountChanged // (Final|Native|Public) // @ game+0x2873160
	void OnLiveWatchOnlyMsgReceived(struct FString Content); // Function Solarland.SolarPlayerState.OnLiveWatchOnlyMsgReceived // (Native|Public) // @ game+0x28730c0
	void OnLeaveLocalPlayerTeam(struct ASolarTeamInfo* TeamInfo, struct ASolarPlayerState* PlayerState); // Function Solarland.SolarPlayerState.OnLeaveLocalPlayerTeam // (Final|Native|Public) // @ game+0x2872ff0
	void OnJoinLocalPlayerTeam(struct ASolarTeamInfo* TeamInfo, struct ASolarPlayerState* PlayerState); // Function Solarland.SolarPlayerState.OnJoinLocalPlayerTeam // (Final|Native|Public) // @ game+0x2872f20
	void OnInputTypeChanged(enum class ECommonInputType NowInputType); // Function Solarland.SolarPlayerState.OnInputTypeChanged // (Final|Native|Public) // @ game+0x2872ea0
	void OnEnterHeroPick(); // Function Solarland.SolarPlayerState.OnEnterHeroPick // (Final|Native|Public|BlueprintCallable) // @ game+0x2872df0
	void OnDamageChanged__DelegateSignature(float Damage); // DelegateFunction Solarland.SolarPlayerState.OnDamageChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnClientSpectateTargetChanged(struct ASolarPlayerState* InOldTarget, struct ASolarSpectateInfo* InSpectateInfo); // Function Solarland.SolarPlayerState.OnClientSpectateTargetChanged // (Final|Native|Private) // @ game+0x2872d20
	void OnCancelResurrectProgress(int32_t InTextId); // Function Solarland.SolarPlayerState.OnCancelResurrectProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x2872c90
	void NotifyUpdateTeamMateLevelUI(); // Function Solarland.SolarPlayerState.NotifyUpdateTeamMateLevelUI // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void NotifyAddExperience(int32_t ExpAdded); // Function Solarland.SolarPlayerState.NotifyAddExperience // (Net|Native|Event|Public|NetClient) // @ game+0x2872c00
	bool NeedPerformSpectateInfoOnSimulate(); // Function Solarland.SolarPlayerState.NeedPerformSpectateInfoOnSimulate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872bd0
	int32_t LuaGetExpFromWeaponImplementation(enum class EExpBehaviorType InBehaviorType, int32_t InParamOne, int32_t InParamTwo, float InDamage); // Function Solarland.SolarPlayerState.LuaGetExpFromWeaponImplementation // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void LeaveTeam(); // Function Solarland.SolarPlayerState.LeaveTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x2872bb0
	void JoinTeamByPolicy(enum class ETeamType TeamType, bool AutoBalance); // Function Solarland.SolarPlayerState.JoinTeamByPolicy // (Final|Native|Public|BlueprintCallable) // @ game+0x2872ae0
	void JoinTeamByPolicies(struct TArray<enum class ETeamType> JoinPolicies, bool AutoBalance); // Function Solarland.SolarPlayerState.JoinTeamByPolicies // (Final|Native|Public|BlueprintCallable) // @ game+0x28729b0
	void JoinTeamByName(struct FString InTeamName); // Function Solarland.SolarPlayerState.JoinTeamByName // (Final|Native|Public|BlueprintCallable) // @ game+0x2872910
	void JoinTeamByID(char InTeamId); // Function Solarland.SolarPlayerState.JoinTeamByID // (Final|Native|Public|BlueprintCallable) // @ game+0x2872890
	void JoinTeam(struct ASolarTeamInfo* InTeam); // Function Solarland.SolarPlayerState.JoinTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x2872800
	bool IsWaitingLogin(); // Function Solarland.SolarPlayerState.IsWaitingLogin // (Native|Public|Const) // @ game+0x28727d0
	bool IsUsingClanForFlag(); // Function Solarland.SolarPlayerState.IsUsingClanForFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28727a0
	bool IsUnfollowShortcutEnabled(); // Function Solarland.SolarPlayerState.IsUnfollowShortcutEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872770
	bool IsTimeOutPlayer(); // Function Solarland.SolarPlayerState.IsTimeOutPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872750
	bool IsTeammateWithLocalOrSpecTargetPlayer(); // Function Solarland.SolarPlayerState.IsTeammateWithLocalOrSpecTargetPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872720
	bool IsTeammateWith(struct ASolarPlayerState* Other); // Function Solarland.SolarPlayerState.IsTeammateWith // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872680
	bool IsSpectatingOtherPlayer(); // Function Solarland.SolarPlayerState.IsSpectatingOtherPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872640
	bool IsSkydivingLeader(); // Function Solarland.SolarPlayerState.IsSkydivingLeader // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872610
	bool IsSkydivingCompleted(); // Function Solarland.SolarPlayerState.IsSkydivingCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28725e0
	bool IsSkydiving(); // Function Solarland.SolarPlayerState.IsSkydiving // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28725b0
	bool IsSameTeamWithLocalPlayer(); // Function Solarland.SolarPlayerState.IsSameTeamWithLocalPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872580
	bool IsReconnecting(); // Function Solarland.SolarPlayerState.IsReconnecting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872550
	bool IsPreStartSkydiving(); // Function Solarland.SolarPlayerState.IsPreStartSkydiving // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872520
	bool IsPlayerWaitingForTeammatesHelp(); // Function Solarland.SolarPlayerState.IsPlayerWaitingForTeammatesHelp // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	bool IsPlayerTeam(); // Function Solarland.SolarPlayerState.IsPlayerTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x28724f0
	bool IsPlayerSameTeam(struct FString TargetPlayerID); // Function Solarland.SolarPlayerState.IsPlayerSameTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x2872440
	bool IsPlayerOnline(); // Function Solarland.SolarPlayerState.IsPlayerOnline // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872410
	bool IsPlayerOffline(); // Function Solarland.SolarPlayerState.IsPlayerOffline // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28723e0
	bool IsPlayer(); // Function Solarland.SolarPlayerState.IsPlayer // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28723b0
	bool IsOutBySelf(); // Function Solarland.SolarPlayerState.IsOutBySelf // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872380
	bool IsOfflinePlayer(); // Function Solarland.SolarPlayerState.IsOfflinePlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872350
	bool IsOBPlayer(); // Function Solarland.SolarPlayerState.IsOBPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872330
	bool IsMySkydivingLeader(int32_t LeaderPosInTeam); // Function Solarland.SolarPlayerState.IsMySkydivingLeader // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872290
	bool IsMVP(); // Function Solarland.SolarPlayerState.IsMVP // (Final|Native|Protected|BlueprintCallable) // @ game+0x2872230
	bool IsMaxLevelInGame(); // Function Solarland.SolarPlayerState.IsMaxLevelInGame // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872260
	bool IsLocalPlayerCameraFocusingMe(); // Function Solarland.SolarPlayerState.IsLocalPlayerCameraFocusingMe // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872200
	bool IsKickOutByServer(); // Function Solarland.SolarPlayerState.IsKickOutByServer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28721d0
	bool IsDeserter(); // Function Solarland.SolarPlayerState.IsDeserter // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x28721a0
	bool IsBuyingResurrection(); // Function Solarland.SolarPlayerState.IsBuyingResurrection // (Event|Public|BlueprintEvent|Const) // @ game+0x2d0d160
	bool IsBeingSpectated(); // Function Solarland.SolarPlayerState.IsBeingSpectated // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872170
	bool IsAllyWithLocalPlayer(); // Function Solarland.SolarPlayerState.IsAllyWithLocalPlayer // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872140
	bool IsAllyWithLocalOrSpecTargetPlayer(); // Function Solarland.SolarPlayerState.IsAllyWithLocalOrSpecTargetPlayer // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872110
	bool IsAllyWith(struct ASolarPlayerState* Other); // Function Solarland.SolarPlayerState.IsAllyWith // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872070
	bool IsAIPlayer(); // Function Solarland.SolarPlayerState.IsAIPlayer // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872040
	bool IsACheater(); // Function Solarland.SolarPlayerState.IsACheater // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2872010
	void InitInputType(); // Function Solarland.SolarPlayerState.InitInputType // (Final|Native|Public) // @ game+0x2871fd0
	void IncreaseReviveCount(); // Function Solarland.SolarPlayerState.IncreaseReviveCount // (Native|Public|BlueprintCallable) // @ game+0x1ae5970
	void HideTeammatesHUD(struct TArray<struct ASolarPlayerState*>& TeammateStates); // Function Solarland.SolarPlayerState.HideTeammatesHUD // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2871f20
	bool HasSkydivingLeader(); // Function Solarland.SolarPlayerState.HasSkydivingLeader // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871ef0
	bool HasSettled(); // Function Solarland.SolarPlayerState.HasSettled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871ed0
	bool HasCheatSelf(); // Function Solarland.SolarPlayerState.HasCheatSelf // (Final|Native|Public) // @ game+0x2871ea0
	int32_t GetWeaponSettlmentExp(int32_t weaponid); // Function Solarland.SolarPlayerState.GetWeaponSettlmentExp // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	int32_t GetVehicleSkinID(int32_t VehicleID); // Function Solarland.SolarPlayerState.GetVehicleSkinID // (Final|Native|Public) // @ game+0x2871e00
	struct FString GetUserID(); // Function Solarland.SolarPlayerState.GetUserID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871d70
	struct TArray<int32_t> GetUsableTailFlameIds(); // Function Solarland.SolarPlayerState.GetUsableTailFlameIds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871cf0
	void GetUsableSkinsForCharacter(int32_t InCharacterId, struct TArray<int32_t>& Result, bool& bCharacterUsable); // Function Solarland.SolarPlayerState.GetUsableSkinsForCharacter // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871bc0
	struct TArray<int32_t> GetUsableJetpackIds(); // Function Solarland.SolarPlayerState.GetUsableJetpackIds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871b40
	float GetTotalReceivedDamage(); // Function Solarland.SolarPlayerState.GetTotalReceivedDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x2871b20
	float GetTotalCausedDamage(); // Function Solarland.SolarPlayerState.GetTotalCausedDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x2871ae0
	char GetTeamRank(); // Function Solarland.SolarPlayerState.GetTeamRank // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871870
	struct FString GetTeamName(); // Function Solarland.SolarPlayerState.GetTeamName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28717f0
	void GetTeammatePlayers(bool bIncludingSelf, struct TArray<struct ASolarPlayerState*>& OutTeammates); // Function Solarland.SolarPlayerState.GetTeammatePlayers // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x28719e0
	struct ASolarPlayerState* GetTeammatePlayerByPosInTeam(int32_t InPosInTeam); // Function Solarland.SolarPlayerState.GetTeammatePlayerByPosInTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871940
	int32_t GetTeammateNum(bool bIncludeSelf); // Function Solarland.SolarPlayerState.GetTeammateNum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28718a0
	char GetTeamID(); // Function Solarland.SolarPlayerState.GetTeamID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28717c0
	struct USolarGameModeStatisticsComponent* GetStatComponent(); // Function Solarland.SolarPlayerState.GetStatComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871790
	struct ASolarSpectateInfo* GetSpectateTargetSpectateInfo(); // Function Solarland.SolarPlayerState.GetSpectateTargetSpectateInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871750
	struct ASolarPlayerState* GetSpectateTargetPlayerState(); // Function Solarland.SolarPlayerState.GetSpectateTargetPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871710
	struct ASolarCharacter* GetSpectateTargetCharacter(); // Function Solarland.SolarPlayerState.GetSpectateTargetCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28716c0
	struct ASolarSpectateInfo* GetSpectateInfo(); // Function Solarland.SolarPlayerState.GetSpectateInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28716a0
	struct ASolarReplayPlayerController* GetSolarReplayPlayerController(); // Function Solarland.SolarPlayerState.GetSolarReplayPlayerController // (Final|Native|Public|Const) // @ game+0x2871670
	struct ASolarPlayerController* GetSolarPlayerController(); // Function Solarland.SolarPlayerState.GetSolarPlayerController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871640
	struct ASolarCharacter* GetSolarCharacter(); // Function Solarland.SolarPlayerState.GetSolarCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871610
	struct ASolarBotAIController* GetSolarBotAIController(); // Function Solarland.SolarPlayerState.GetSolarBotAIController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28715e0
	void GetSkinInfo(int32_t InSkinID, struct FCharacterSkin& ResultInfo); // Function Solarland.SolarPlayerState.GetSkinInfo // (Final|Native|Public|HasOutParms) // @ game+0x2871510
	int32_t GetRankScore(); // Function Solarland.SolarPlayerState.GetRankScore // (Final|Native|Public) // @ game+0x28714f0
	int32_t GetRankLevelID(); // Function Solarland.SolarPlayerState.GetRankLevelID // (Final|Native|Public) // @ game+0x28714d0
	struct ASolarCharacter* GetPossessedCharacter(); // Function Solarland.SolarPlayerState.GetPossessedCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28714a0
	struct UPlayerStatisticsData* GetPlayerStatData(); // Function Solarland.SolarPlayerState.GetPlayerStatData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871470
	enum class EPlayerNetStateInGame GetPlayerNetState(); // Function Solarland.SolarPlayerState.GetPlayerNetState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871450
	struct FString GetPlayerNameWithoutUID(); // Function Solarland.SolarPlayerState.GetPlayerNameWithoutUID // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28713d0
	struct TArray<struct FMedalInfo> GetMedalInfo(); // Function Solarland.SolarPlayerState.GetMedalInfo // (Final|Native|Public|Const) // @ game+0x2871350
	int32_t GetMaxShieldMatCountToDeathbox(); // Function Solarland.SolarPlayerState.GetMaxShieldMatCountToDeathbox // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871320
	struct ASolarPlayerState* GetLocalPlayerState(); // Function Solarland.SolarPlayerState.GetLocalPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28712f0
	struct ASolarPlayerState* GetLocalOrSpecTargetPlayerState(); // Function Solarland.SolarPlayerState.GetLocalOrSpecTargetPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28712c0
	struct ASolarCharacter* GetLocalOrSpecTargetCharacter(); // Function Solarland.SolarPlayerState.GetLocalOrSpecTargetCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871290
	struct ASolarCharacter* GetLocalCharacter(); // Function Solarland.SolarPlayerState.GetLocalCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871260
	int32_t GetLegendRank(); // Function Solarland.SolarPlayerState.GetLegendRank // (Final|Native|Public) // @ game+0x2871240
	struct ASolarPlayerState* GetKillerPlayerState(); // Function Solarland.SolarPlayerState.GetKillerPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2871220
	bool GetIsPlayerBattleEnd(); // Function Solarland.SolarPlayerState.GetIsPlayerBattleEnd // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28711f0
	float GetExpSettleModePunishRatio(); // Function Solarland.SolarPlayerState.GetExpSettleModePunishRatio // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	int32_t GetExpItemCount(int32_t InLevelGap); // Function Solarland.SolarPlayerState.GetExpItemCount // (Final|Native|Public|BlueprintCallable) // @ game+0x2871150
	int32_t GetExpByBehavior(enum class EExpBehaviorType InBehaviorType, int32_t InParamOne, int32_t InParamTwo, float InDamage); // Function Solarland.SolarPlayerState.GetExpByBehavior // (Native|Event|Public|BlueprintEvent) // @ game+0x2870ff0
	int32_t GetExpAddValueFromItem(int32_t ItemID); // Function Solarland.SolarPlayerState.GetExpAddValueFromItem // (Event|Public|BlueprintEvent|Const) // @ game+0x2d0d160
	int32_t GetDriveVehicleID(); // Function Solarland.SolarPlayerState.GetDriveVehicleID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2870e30
	struct FVector GetDeathBoxLocation(); // Function Solarland.SolarPlayerState.GetDeathBoxLocation // (Event|Public|HasDefaults|BlueprintEvent|Const) // @ game+0x2d0d160
	float GetCurrentTalentCDDuration(); // Function Solarland.SolarPlayerState.GetCurrentTalentCDDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2870e00
	float GetCurrentTalentActiveDuration(); // Function Solarland.SolarPlayerState.GetCurrentTalentActiveDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2870dd0
	void GetCurrentSkinForCharacter(int32_t InCharacterId, bool& bCharacterUsable, int32_t& OutSkinId); // Function Solarland.SolarPlayerState.GetCurrentSkinForCharacter // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x2870cb0
	struct FString GetClanShortName(); // Function Solarland.SolarPlayerState.GetClanShortName // (Final|Native|Public|BlueprintCallable) // @ game+0x2870c30
	int32_t GetCharacterRandomEquippedVoiceByType(enum class EPassiveTriggeredVoice VoiceType); // Function Solarland.SolarPlayerState.GetCharacterRandomEquippedVoiceByType // (Final|Native|Public|Const) // @ game+0x2870b90
	struct FVector GetCharacterLocation(); // Function Solarland.SolarPlayerState.GetCharacterLocation // (Final|Native|Public|HasDefaults|Const) // @ game+0x2870b50
	struct TArray<struct FString> GetBuyResurrectionSavedTeammateIDArr(); // Function Solarland.SolarPlayerState.GetBuyResurrectionSavedTeammateIDArr // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	struct TArray<int32_t> GetBuyResurrectionSavedTeammateBonusArr(); // Function Solarland.SolarPlayerState.GetBuyResurrectionSavedTeammateBonusArr // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void GetAlliesPlayers(bool bIncludingSelf, struct TArray<struct ASolarPlayerState*>& OutAllies); // Function Solarland.SolarPlayerState.GetAlliesPlayers // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2870a50
	bool CostGold(int32_t InCostedGold, bool NeedSyncToServer); // Function Solarland.SolarPlayerState.CostGold // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x28707d0
	void ClientNotifyKillNumChanged(int32_t KillNumber, int32_t SpreesNum); // Function Solarland.SolarPlayerState.ClientNotifyKillNumChanged // (Net|Native|Event|Public|NetClient) // @ game+0x2870700
	void ClientImmediatelyTeammatesSkinID(struct TArray<struct ASolarPlayerState*> InTeammates, struct TArray<int32_t> InSkinID); // Function Solarland.SolarPlayerState.ClientImmediatelyTeammatesSkinID // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x2870600
	void ClearTeammatesMark(); // Function Solarland.SolarPlayerState.ClearTeammatesMark // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ae5630
	bool CheckIfTeamLastVehicleLocationValid(); // Function Solarland.SolarPlayerState.CheckIfTeamLastVehicleLocationValid // (Final|Native|Public|Const) // @ game+0x28705d0
	bool CheckIfTeamIdValid(); // Function Solarland.SolarPlayerState.CheckIfTeamIdValid // (Final|Native|Public|Const) // @ game+0x28705a0
	bool CheckIfSelfLastVehicleLocationValid(); // Function Solarland.SolarPlayerState.CheckIfSelfLastVehicleLocationValid // (Final|Native|Public|Const) // @ game+0x2870570
	bool CheckIfPosInTeamValid(); // Function Solarland.SolarPlayerState.CheckIfPosInTeamValid // (Final|Native|Public|Const) // @ game+0x2870540
	bool CheckIfMarkedPointInNavMapValid(); // Function Solarland.SolarPlayerState.CheckIfMarkedPointInNavMapValid // (Final|Native|Public|Const) // @ game+0x2870510
	bool CheckIfInactive(); // Function Solarland.SolarPlayerState.CheckIfInactive // (Final|Native|Public|Const) // @ game+0x28704e0
	bool CheckIfDataValid(); // Function Solarland.SolarPlayerState.CheckIfDataValid // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x28704b0
	bool CheckIfBeInSpecifiedPlayerState(enum class EPlayerStateInGame InEPlayerStateInGame); // Function Solarland.SolarPlayerState.CheckIfBeInSpecifiedPlayerState // (Final|Native|Public) // @ game+0x2870420
	bool CheckIfBeInSpecifiedCharacterState(enum class ECharacterStateInGame InECharacterStateInGame); // Function Solarland.SolarPlayerState.CheckIfBeInSpecifiedCharacterState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2870390
	bool CheckIfBattleVoiceIdValid(); // Function Solarland.SolarPlayerState.CheckIfBattleVoiceIdValid // (Final|Native|Public|Const) // @ game+0x2870360
	bool CheckGoldIsEnough(int32_t InCostedGold); // Function Solarland.SolarPlayerState.CheckGoldIsEnough // (Final|Native|Public) // @ game+0x28702c0
	void ChangeTailFlameId(int32_t InTailFlameId); // Function Solarland.SolarPlayerState.ChangeTailFlameId // (Final|Native|Public|BlueprintCallable) // @ game+0x2870230
	void ChangeBagById(int32_t InBagId); // Function Solarland.SolarPlayerState.ChangeBagById // (Final|Native|Public|BlueprintCallable) // @ game+0x28701a0
	bool CanReviveItemPutInDeathBox(); // Function Solarland.SolarPlayerState.CanReviveItemPutInDeathBox // (Final|Native|Public) // @ game+0x2783600
	bool CanAcceptSkydivingLeaderTransferRequest(struct ASolarPlayerState* RequesterPlayerState); // Function Solarland.SolarPlayerState.CanAcceptSkydivingLeaderTransferRequest // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2870070
	bool CanAcceptSkydivingFollowRequest(struct ASolarPlayerState* RequesterPlayerState); // Function Solarland.SolarPlayerState.CanAcceptSkydivingFollowRequest // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x286ffd0
	bool CanAcceptSkydivingFollowInvitation(struct ASolarPlayerState* InviterPlayerState); // Function Solarland.SolarPlayerState.CanAcceptSkydivingFollowInvitation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x286ff30
	int32_t CalculateZomborg(); // Function Solarland.SolarPlayerState.CalculateZomborg // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	float CalculateCharacterExp(); // Function Solarland.SolarPlayerState.CalculateCharacterExp // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	float CalculateAccountExp(); // Function Solarland.SolarPlayerState.CalculateAccountExp // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void AddExperience(int32_t InExp, enum class EExpBehaviorType InType); // Function Solarland.SolarPlayerState.AddExperience // (Final|Native|Public|BlueprintCallable) // @ game+0x286fe60
};

// Class Solarland.SCMPlayerState
// Size: 0xcc8 (Inherited: 0xc48)
struct ASCMPlayerState : ASolarPlayerState {
	enum class ESCMPlayerState BattleState; // 0xc48(0x01)
	enum class ESCMPlayerOutType PlayerOutType; // 0xc49(0x01)
	enum class ESCMPlayerType PlayerType; // 0xc4a(0x01)
	enum class ESCMPlayerGameRole PlayerGameRole; // 0xc4b(0x01)
	char pad_C4C[0x14]; // 0xc4c(0x14)
	struct TArray<struct FSCMReplicateHostData> ReplicateData; // 0xc60(0x10)
	char pad_C70[0x10]; // 0xc70(0x10)
	float ReviveStartTime; // 0xc80(0x04)
	char pad_C84[0x4]; // 0xc84(0x04)
	struct ASolarPlayerState* RevivingTeammatePS; // 0xc88(0x08)
	char pad_C90[0x10]; // 0xc90(0x10)
	struct USolarTaskComponent* TaskSystem; // 0xca0(0x08)
	struct TArray<struct TSoftClassPtr<UObject>> GMComponentClasses; // 0xca8(0x10)
	struct TArray<struct UActorComponent*> SpawnedGMComps; // 0xcb8(0x10)

	void UpdateTaskInfo(struct FTaskUpdateInfo& InTaskInfo); // Function Solarland.SCMPlayerState.UpdateTaskInfo // (Final|Native|Public|HasOutParms) // @ game+0x270f0f0
	void UpDateDataManager(struct TArray<struct FSCMReplicateHostData> InReplicateData, bool bInit); // Function Solarland.SCMPlayerState.UpDateDataManager // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x270efc0
	void ServerChangePlayerCharacter(int32_t NewCharacterID, int32_t NewSkinID); // Function Solarland.SCMPlayerState.ServerChangePlayerCharacter // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x270ed90
	void ServerBeginSpectate(struct ASCMPlayerState* TargetPlayer); // Function Solarland.SCMPlayerState.ServerBeginSpectate // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270ed00
	void ReviveSelfAsWinner(bool bOverrideLocation, struct FVector& ReviveLocation); // Function Solarland.SCMPlayerState.ReviveSelfAsWinner // (BlueprintAuthorityOnly|Native|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x270ec10
	void RequestStartGame(); // Function Solarland.SCMPlayerState.RequestStartGame // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1ae6550
	void RequestSetWeaponTypeAvailableLuaCall(enum class EWeaponUIType WeaponUIType, bool bIsAvailable); // Function Solarland.SCMPlayerState.RequestSetWeaponTypeAvailableLuaCall // (Final|Native|Public) // @ game+0x270ea70
	void RequestSetWeaponTypeAvailable(enum class EWeaponUIType WeaponUIType, bool bIsAvailable); // Function Solarland.SCMPlayerState.RequestSetWeaponTypeAvailable // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270e990
	void RequestSetWeaponAvailableLuaCall(int32_t weaponid, bool bIsAvailable); // Function Solarland.SCMPlayerState.RequestSetWeaponAvailableLuaCall // (Final|Native|Public) // @ game+0x270e8c0
	void RequestSetWeaponAvailable(int32_t weaponid, bool bIsAvailable); // Function Solarland.SCMPlayerState.RequestSetWeaponAvailable // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270e7f0
	void RequestSetVehicleTypeAvailableLuaCall(int32_t VehicleTypeID, bool bIsAvailable); // Function Solarland.SCMPlayerState.RequestSetVehicleTypeAvailableLuaCall // (Final|Native|Public) // @ game+0x270e720
	void RequestSetVehicleTypeAvailable(int32_t VehicleTypeID, bool bIsAvailable); // Function Solarland.SCMPlayerState.RequestSetVehicleTypeAvailable // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270e650
	void RequestSetVehicleClassAvailableLuaCall(enum class EVehicleClass VehicleClass, bool bIsAvailable); // Function Solarland.SCMPlayerState.RequestSetVehicleClassAvailableLuaCall // (Final|Native|Public) // @ game+0x270e580
	void RequestSetVehicleClassAvailable(enum class EVehicleClass VehicleClass, bool bIsAvailable); // Function Solarland.SCMPlayerState.RequestSetVehicleClassAvailable // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270e4a0
	void RequestSetUserSettingLuaCall(int32_t& Category, int32_t& Name, enum class ECustomParamType ParamType, int32_t& Value); // Function Solarland.SCMPlayerState.RequestSetUserSettingLuaCall // (Final|Native|Public|HasOutParms) // @ game+0x270e320
	void RequestSetUserSetting(int32_t Category, int32_t Name, enum class ECustomParamType ParamType, int32_t Value); // Function Solarland.SCMPlayerState.RequestSetUserSetting // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270e1d0
	void RequestSetRoomPoolPrizeTypeLuaCall(int32_t TypeID); // Function Solarland.SCMPlayerState.RequestSetRoomPoolPrizeTypeLuaCall // (Final|Native|Public) // @ game+0x270e140
	void RequestSetRoomPoolPrizeType(int32_t TypeID); // Function Solarland.SCMPlayerState.RequestSetRoomPoolPrizeType // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270e0b0
	void RequestSetRoomPasswdLuaCall(struct FString Passwd); // Function Solarland.SCMPlayerState.RequestSetRoomPasswdLuaCall // (Final|Native|Public) // @ game+0x270e010
	void RequestSetRoomPasswd(struct FString Passwd); // Function Solarland.SCMPlayerState.RequestSetRoomPasswd // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270df70
	void RequestSetRoomNameLuaCall(struct FString Name); // Function Solarland.SCMPlayerState.RequestSetRoomNameLuaCall // (Final|Native|Public) // @ game+0x270ded0
	void RequestSetRoomName(struct FString Name); // Function Solarland.SCMPlayerState.RequestSetRoomName // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270de30
	void RequestSetRoomLevelLimitLuaCall(int32_t Level); // Function Solarland.SCMPlayerState.RequestSetRoomLevelLimitLuaCall // (Final|Native|Public) // @ game+0x270dda0
	void RequestSetRoomLevelLimit(int32_t Level); // Function Solarland.SCMPlayerState.RequestSetRoomLevelLimit // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270dd10
	void RequestSetInviteEnableLuaCall(bool bEnable); // Function Solarland.SCMPlayerState.RequestSetInviteEnableLuaCall // (Final|Native|Public) // @ game+0x270dc80
	void RequestSetInviteEnable(bool bEnable); // Function Solarland.SCMPlayerState.RequestSetInviteEnable // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270dbf0
	void RequestSetExchangeEnableLuaCall(bool bEnable); // Function Solarland.SCMPlayerState.RequestSetExchangeEnableLuaCall // (Final|Native|Public) // @ game+0x270db60
	void RequestSetExchangeEnable(bool bEnable); // Function Solarland.SCMPlayerState.RequestSetExchangeEnable // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270dad0
	void RequestPlayersRandomToTeamLuaCall(); // Function Solarland.SCMPlayerState.RequestPlayersRandomToTeamLuaCall // (Final|Native|Public) // @ game+0x270dab0
	void RequestPlayersRandomToTeam(); // Function Solarland.SCMPlayerState.RequestPlayersRandomToTeam // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1ae60f0
	void RequestPlayersFillTeamLuaCall(); // Function Solarland.SCMPlayerState.RequestPlayersFillTeamLuaCall // (Final|Native|Public) // @ game+0x270da90
	void RequestPlayersFillTeam(); // Function Solarland.SCMPlayerState.RequestPlayersFillTeam // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1ae5e50
	void RequestKickPlayerOutLuaCall(struct ASCMPlayerState* Player); // Function Solarland.SCMPlayerState.RequestKickPlayerOutLuaCall // (Final|Native|Public) // @ game+0x270da00
	void RequestKickPlayerOut(struct ASCMPlayerState* Player); // Function Solarland.SCMPlayerState.RequestKickPlayerOut // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270d970
	void RequestExchangeTeamsAndPos(struct ASCMPlayerState* PlayerA, struct ASCMPlayerState* PlayerB); // Function Solarland.SCMPlayerState.RequestExchangeTeamsAndPos // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270d8a0
	void RequestChangeTeam(struct ASCMPlayerState* Player, struct FString TeamName, int32_t NewPosInTeam); // Function Solarland.SCMPlayerState.RequestChangeTeam // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270d770
	void RequesJoinOB(struct ASCMPlayerState* Player); // Function Solarland.SCMPlayerState.RequesJoinOB // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x270d640
	void OnUpdateLifeTime(); // Function Solarland.SCMPlayerState.OnUpdateLifeTime // (Final|Native|Public) // @ game+0x270d500
	void OnRep_RevivingTeammatePS(struct ASolarPlayerState* LastRevivingTeammatePS); // Function Solarland.SCMPlayerState.OnRep_RevivingTeammatePS // (Final|Native|Public) // @ game+0x270d340
	void OnRep_BattleState(); // Function Solarland.SCMPlayerState.OnRep_BattleState // (Final|Native|Private) // @ game+0x270d320
	void OnPlayerKilled(struct ASCMPlayerState* KillerPlayer, struct FSolarPointDamageEvent& InDamageEvent, struct AActor* InDamageCauser); // Function Solarland.SCMPlayerState.OnPlayerKilled // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerKill(struct ASCMPlayerState* KilledPlayer, struct FSolarPointDamageEvent& InDamageEvent, struct AActor* InDamageCauser); // Function Solarland.SCMPlayerState.OnPlayerKill // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void NotifyUpdateCGMData(struct FString InDataName); // Function Solarland.SCMPlayerState.NotifyUpdateCGMData // (Final|Native|Private) // @ game+0x270d1f0
	void NotifyClientUpdateDataManager(bool bInit); // Function Solarland.SCMPlayerState.NotifyClientUpdateDataManager // (Final|Native|Private) // @ game+0x270d140
	bool NeedConsiderRepData(); // Function Solarland.SCMPlayerState.NeedConsiderRepData // (Final|Native|Public|Const) // @ game+0x270d100
	bool IsPreJoinPlayer(); // Function Solarland.SCMPlayerState.IsPreJoinPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x270d0d0
	void InitTaskInfo(struct FBattlePassInfo& InTaskInfo); // Function Solarland.SCMPlayerState.InitTaskInfo // (Final|Native|Public|HasOutParms) // @ game+0x270cf50
	struct TArray<struct FSCMReplicateHostData> GetReplicateDataArray(); // Function Solarland.SCMPlayerState.GetReplicateDataArray // (Final|Native|Private) // @ game+0x270cf20
	struct TArray<struct ASCMPlayerState*> GetMyTeamPlayerList(); // Function Solarland.SCMPlayerState.GetMyTeamPlayerList // (Final|Native|Public|BlueprintCallable) // @ game+0x270cea0
	void CanPlayerBattle(); // Function Solarland.SCMPlayerState.CanPlayerBattle // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.BattlegroundPlayerState
// Size: 0xd50 (Inherited: 0xcc8)
struct ABattlegroundPlayerState : ASCMPlayerState {
	char pad_CC8[0x20]; // 0xcc8(0x20)
	enum class EBattlegroundPlayerStatus PlayerStatus; // 0xce8(0x01)
	char pad_CE9[0x3]; // 0xce9(0x03)
	int32_t PersonalScore; // 0xcec(0x04)
	char pad_CF0[0x60]; // 0xcf0(0x60)

	void SetPlayerWeaponData(enum class EWeaponSlotType InSlot, int32_t InWeaponID, struct FWeaponPartsData& InWeaponPartsData); // Function Solarland.BattlegroundPlayerState.SetPlayerWeaponData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2662560
	void SetPlayerStatus(enum class EBattlegroundPlayerStatus InPlayerStatus); // Function Solarland.BattlegroundPlayerState.SetPlayerStatus // (Final|Native|Public|BlueprintCallable) // @ game+0x26624e0
	void ServerSetPlayerWeaponData(enum class EWeaponSlotType InSlot, int32_t InWeaponID, struct FWeaponPartsData InWeaponPartsData); // Function Solarland.BattlegroundPlayerState.ServerSetPlayerWeaponData // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x2662330
	void ServerSetPlayerStatus(enum class EBattlegroundPlayerStatus InPlayerStatus); // Function Solarland.BattlegroundPlayerState.ServerSetPlayerStatus // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x26622b0
	void ServerOnPlayerConfirmDeploy(enum class EDeploymentType InType); // Function Solarland.BattlegroundPlayerState.ServerOnPlayerConfirmDeploy // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x2662230
	void OnServerReceivedPlayerConfirmDeploy(struct FTransform& InTransform); // Function Solarland.BattlegroundPlayerState.OnServerReceivedPlayerConfirmDeploy // (Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x2d0d160
	void OnRep_PlayerStatus(); // Function Solarland.BattlegroundPlayerState.OnRep_PlayerStatus // (Final|Native|Protected) // @ game+0x2662120
	void OnRep_PersonalScore(int32_t OldValue); // Function Solarland.BattlegroundPlayerState.OnRep_PersonalScore // (Final|Native|Protected) // @ game+0x1ae6850
	void OnReceivedPlayerStatusChanged(enum class EBattlegroundPlayerStatus InPlayerStatus); // Function Solarland.BattlegroundPlayerState.OnReceivedPlayerStatusChanged // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnReceivedCreateMapElementMark(struct UMapMarkBase* MapMarkClass, struct AActor* InActor, bool bSupportEdge, bool bSupportEdgeInBigMap, int32_t ZOrder); // Function Solarland.BattlegroundPlayerState.OnReceivedCreateMapElementMark // (Event|Protected|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerStatusChangeDelegate__DelegateSignature(enum class EBattlegroundPlayerStatus NewStatus); // DelegateFunction Solarland.BattlegroundPlayerState.OnPlayerStatusChangeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	void OnPlayerGoDeploying(); // Function Solarland.BattlegroundPlayerState.OnPlayerGoDeploying // (Final|Native|Private) // @ game+0x2661ee0
	void OnPlayerConfirmDeploy(enum class EDeploymentType InType); // Function Solarland.BattlegroundPlayerState.OnPlayerConfirmDeploy // (Final|Native|Public|BlueprintCallable) // @ game+0x2661e60
	void OnPersonalScoreChangeDelegate__DelegateSignature(enum class EPersonalScoreType InType, struct FString Param); // DelegateFunction Solarland.BattlegroundPlayerState.OnPersonalScoreChangeDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	enum class EBattlegroundPlayerStatus GetPlayerStatus(); // Function Solarland.BattlegroundPlayerState.GetPlayerStatus // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2661890
	float GetPlayerRebirthWaitTime(); // Function Solarland.BattlegroundPlayerState.GetPlayerRebirthWaitTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2661860
	struct AFactionInfo* GetFaction(); // Function Solarland.BattlegroundPlayerState.GetFaction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26616e0
	void ClientPersonalScoreChanged(enum class EPersonalScoreType InType, struct FString Param); // Function Solarland.BattlegroundPlayerState.ClientPersonalScoreChanged // (Net|Native|Event|Public|NetClient) // @ game+0x2661380
	void ChangePlayerWeapons(enum class EWeaponSlotType InSlot, int32_t InWeaponID, struct FWeaponPartsData& InWeaponPartsData); // Function Solarland.BattlegroundPlayerState.ChangePlayerWeapons // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.SolarTeamInfo
// Size: 0x2a8 (Inherited: 0x228)
struct ASolarTeamInfo : AInfo {
	char pad_228[0x18]; // 0x228(0x18)
	char TeamID; // 0x240(0x01)
	char TeamRank; // 0x241(0x01)
	char KillCount; // 0x242(0x01)
	char MemberLimit; // 0x243(0x01)
	char pad_244[0x4]; // 0x244(0x04)
	struct FText TeamName; // 0x248(0x18)
	char MatchCount; // 0x260(0x01)
	char bHasSettled : 1; // 0x261(0x01)
	char pad_261_1 : 7; // 0x261(0x01)
	struct FMulticastSparseDelegate OnJoinTeam; // 0x262(0x01)
	struct FMulticastSparseDelegate OnLeaveTeam; // 0x263(0x01)
	char pad_264[0x4]; // 0x264(0x04)
	struct TArray<struct ASolarPlayerState*> BotMembers; // 0x268(0x10)
	struct TArray<struct ASolarPlayerState*> PlayerMembers; // 0x278(0x10)
	struct TArray<struct ASolarPlayerState*> TeamMembers; // 0x288(0x10)
	struct USolarTeamInfoComponent* TeamInfoDetails; // 0x298(0x08)
	char pad_2A0[0x1]; // 0x2a0(0x01)
	enum class EMatchResult MatchResult; // 0x2a1(0x01)
	char pad_2A2[0x6]; // 0x2a2(0x06)

	void Settle(char Rank); // Function Solarland.SolarTeamInfo.Settle // (Final|Native|Public|BlueprintCallable) // @ game+0x2960e60
	void RemoveFromTeam(struct ASolarPlayerState* ps); // Function Solarland.SolarTeamInfo.RemoveFromTeam // (Native|Public|BlueprintCallable) // @ game+0x27b3fa0
	void ReceivedTeamID(); // Function Solarland.SolarTeamInfo.ReceivedTeamID // (Native|Public) // @ game+0x1ae6410
	void ReceivedKillCount(); // Function Solarland.SolarTeamInfo.ReceivedKillCount // (Native|Public) // @ game+0x7ec1b0
	void ReceivedHasSettled(); // Function Solarland.SolarTeamInfo.ReceivedHasSettled // (Native|Public) // @ game+0x7ec190
	void RearrangeMembersPos(); // Function Solarland.SolarTeamInfo.RearrangeMembersPos // (Final|Native|Public|BlueprintCallable) // @ game+0x295fec0
	void OnPlayerStateEndPlay(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function Solarland.SolarTeamInfo.OnPlayerStateEndPlay // (Final|Native|Private) // @ game+0x295fb00
	bool IsInTeam(struct ASolarPlayerState* ps); // Function Solarland.SolarTeamInfo.IsInTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x295f590
	bool IsAPlayerTeam(); // Function Solarland.SolarTeamInfo.IsAPlayerTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x295f560
	bool IsAOnlyPlayerTeam(); // Function Solarland.SolarTeamInfo.IsAOnlyPlayerTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x295f530
	bool IsAOnlyBotTeam(); // Function Solarland.SolarTeamInfo.IsAOnlyBotTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x295f500
	bool IsA(enum class ETeamType TeamType); // Function Solarland.SolarTeamInfo.IsA // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x295f470
	void InitFromGameModeConfig(); // Function Solarland.SolarTeamInfo.InitFromGameModeConfig // (Native|Public) // @ game+0x1ae65d0
	bool HasBeenEliminated(); // Function Solarland.SolarTeamInfo.HasBeenEliminated // (Final|Native|Public|BlueprintCallable) // @ game+0x295f440
	struct ASolarPlayerState* GetTeammatePlayerByPosInTeam(int32_t InPosInTeam); // Function Solarland.SolarTeamInfo.GetTeammatePlayerByPosInTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x295f2c0
	int32_t GetSize(); // Function Solarland.SolarTeamInfo.GetSize // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x295f2a0
	void GetSCMPlayerStateTeamMembers(struct TArray<struct ASCMPlayerState*>& OutTeamMembers); // Function Solarland.SolarTeamInfo.GetSCMPlayerStateTeamMembers // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x295f1f0
	int32_t GetAliveTeammateNum(); // Function Solarland.SolarTeamInfo.GetAliveTeammateNum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x295f160
	void AddToTeam(struct ASolarPlayerState* ps); // Function Solarland.SolarTeamInfo.AddToTeam // (Native|Public|BlueprintCallable) // @ game+0x295eef0
};

// Class Solarland.BattlegroundTeamInfo
// Size: 0x2b0 (Inherited: 0x2a8)
struct ABattlegroundTeamInfo : ASolarTeamInfo {
	struct AFactionInfo* MyFaction; // 0x2a8(0x08)

	void OnRep_Faction(); // Function Solarland.BattlegroundTeamInfo.OnRep_Faction // (Native|Public) // @ game+0x1ae4fd0
};

// Class Solarland.BattleHUDForTechDesign
// Size: 0x3b0 (Inherited: 0x3b0)
struct ABattleHUDForTechDesign : ABattleHUDBase {
};

// Class Solarland.UINoticeBase
// Size: 0x428 (Inherited: 0x400)
struct UUINoticeBase : USolarUserWidget {
	struct USolarRichTextBlock* TextWidget; // 0x400(0x08)
	struct UImage* TxtBg; // 0x408(0x08)
	struct UImage* Icon; // 0x410(0x08)
	struct UImage* IconBg; // 0x418(0x08)
	char pad_420[0x8]; // 0x420(0x08)

	void ShowEnterAnimation(); // Function Solarland.UINoticeBase.ShowEnterAnimation // (Native|Public|BlueprintCallable) // @ game+0xbd9710
	void SetIconBrush(struct FString IconPath); // Function Solarland.UINoticeBase.SetIconBrush // (Final|Native|Public|BlueprintCallable) // @ game+0x29c8fe0
	void SetColor(struct FNoticeColorData& InColorData); // Function Solarland.UINoticeBase.SetColor // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x29c8e80
	void ResetIsPlayingVoice(enum class EAkCallbackType CallbackType, struct UAkCallbackInfo* CallbackInfo); // Function Solarland.UINoticeBase.ResetIsPlayingVoice // (Final|Native|Public) // @ game+0x29c8db0
	void ResetIsPlayingBeKillLeaderVoice(enum class EAkCallbackType CallbackType, struct UAkCallbackInfo* CallbackInfo); // Function Solarland.UINoticeBase.ResetIsPlayingBeKillLeaderVoice // (Final|Native|Public) // @ game+0x29c8ce0
	struct UWidgetAnimation* GetExitAnimation(); // Function Solarland.UINoticeBase.GetExitAnimation // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x29c8540
	struct UWidgetAnimation* GetEnterAnimation(); // Function Solarland.UINoticeBase.GetEnterAnimation // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x29c8510
	void DefaultClose(); // Function Solarland.UINoticeBase.DefaultClose // (Final|Native|Public|BlueprintCallable) // @ game+0x29c84f0
	void CloseNotice(); // Function Solarland.UINoticeBase.CloseNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x29c8440
};

// Class Solarland.BattleNoticeEquipReplace
// Size: 0x510 (Inherited: 0x428)
struct UBattleNoticeEquipReplace : UUINoticeBase {
	struct UImage* Img_Item1; // 0x428(0x08)
	struct UImage* Img_Item2; // 0x430(0x08)
	struct UImage* Img_Item1_BG; // 0x438(0x08)
	struct UImage* Img_Item2_BG; // 0x440(0x08)
	struct UTextBlock* Quality1; // 0x448(0x08)
	struct UTextBlock* Quality2; // 0x450(0x08)
	struct UWidgetAnimation* Enter_Animation_1; // 0x458(0x08)
	struct UWidgetAnimation* Enter_Animation_2; // 0x460(0x08)
	struct UWidgetAnimation* Enter_Animation_3; // 0x468(0x08)
	struct TMap<enum class EItemType, struct TSoftObjectPtr<UTexture2D>> DefaultEquipIcons; // 0x470(0x50)
	struct TMap<enum class EWeaponPartType, struct TSoftObjectPtr<UTexture2D>> DefaultWeaponPartIcons; // 0x4c0(0x50)

	void OnEquipReplaceAnimFinished(); // Function Solarland.BattleNoticeEquipReplace.OnEquipReplaceAnimFinished // (Final|Native|Public) // @ game+0x2661bb0
};

// Class Solarland.BattleNoticePickup
// Size: 0x458 (Inherited: 0x428)
struct UBattleNoticePickup : UUINoticeBase {
	struct USolarTextBlock* Txt_PickupNotice_ItemName; // 0x428(0x08)
	struct USolarTextBlock* Txt_PickupNotice_Head; // 0x430(0x08)
	struct USolarTextBlock* Txt_PickupNotice_Tail; // 0x438(0x08)
	struct UImage* Img_Txt_bg; // 0x440(0x08)
	struct TArray<struct FLinearColor> QualityColor; // 0x448(0x10)
};

// Class Solarland.BattleOBHUD
// Size: 0x3c0 (Inherited: 0x3b0)
struct ABattleOBHUD : ABattleHUDBase {
	char pad_3B0[0x8]; // 0x3b0(0x08)
	struct USolarOBUIModel* SolarOBUIModel; // 0x3b8(0x08)

	void SetBattleOBHUDType(enum class EBattleOBHUDType& Type); // Function Solarland.BattleOBHUD.SetBattleOBHUDType // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2662450
	void OpenShortCutKeyboard(); // Function Solarland.BattleOBHUD.OpenShortCutKeyboard // (Final|Native|Public|BlueprintCallable) // @ game+0x2662210
	struct UOBHUDDispatcher* GetOBHUDDispatcher(); // Function Solarland.BattleOBHUD.GetOBHUDDispatcher // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2661830
	enum class EBattleOBHUDType GetBattleOBHUDType(); // Function Solarland.BattleOBHUD.GetBattleOBHUDType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2661500
	void AddWidgetToOBRoot(struct UPanelSlot*& ResultSlot, struct UWidget* InChildWidget, struct FName& PanelName, bool bReplaceOld); // Function Solarland.BattleOBHUD.AddWidgetToOBRoot // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2661200
};

// Class Solarland.BattlePassConfigInfo
// Size: 0x38 (Inherited: 0x28)
struct UBattlePassConfigInfo : UObject {
	struct TArray<struct FBattlePassLevelInfo> BattlePassLevel; // 0x28(0x10)

	bool IsMaxLevelWithExp(int32_t BattlePassID, int32_t TotalExp); // Function Solarland.BattlePassConfigInfo.IsMaxLevelWithExp // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2661900
	void Initialize(); // Function Solarland.BattlePassConfigInfo.Initialize // (Final|Native|Public) // @ game+0x26618e0
	int32_t GetLevelByTestExp(int32_t BattlePassID, int32_t InTestExp); // Function Solarland.BattlePassConfigInfo.GetLevelByTestExp // (Final|Native|Public) // @ game+0x2661710
	int32_t GetExpNeedForLv(int32_t BattlePassID, int32_t Level); // Function Solarland.BattlePassConfigInfo.GetExpNeedForLv // (Final|Native|Public) // @ game+0x2661610
	int32_t GetBattllePassMaxLevel(int32_t BattlePassID); // Function Solarland.BattlePassConfigInfo.GetBattllePassMaxLevel // (Final|Native|Public) // @ game+0x2661530
};

// Class Solarland.BattlePromptWidget
// Size: 0x7b8 (Inherited: 0x400)
struct UBattlePromptWidget : USolarUserWidget {
	char pad_400[0x10]; // 0x400(0x10)
	struct UCanvasPanel* EnterAnimPanel; // 0x410(0x08)
	struct UMeshRectangleWidget* MeshWidget_Arrow; // 0x418(0x08)
	struct UMeshRectangleWidget* MeshWidget_Detail; // 0x420(0x08)
	struct FGameplayTag InhibitTag; // 0x428(0x08)
	struct TMap<enum class EBattlePromptType, enum class EBattlePromptType> DisplayTypeMap; // 0x430(0x50)
	struct TMap<enum class EBattlePromptType, int32_t> TypeUVMap; // 0x480(0x50)
	float ElemIconDifference; // 0x4d0(0x04)
	char pad_4D4[0x4]; // 0x4d4(0x04)
	struct TMap<enum class EBattlePromptType, float> ElemRadiusMap; // 0x4d8(0x50)
	int32_t ThreatFactorDefault; // 0x528(0x04)
	char pad_52C[0x4]; // 0x52c(0x04)
	struct TMap<enum class EBattlePromptType, struct UCurveFloat*> ElemArrowColorCurveMap; // 0x530(0x50)
	struct TMap<enum class EBattlePromptType, struct UCurveFloat*> ElemArrowLengthCurveMap; // 0x580(0x50)
	struct TMap<enum class EBattlePromptType, struct UCurveFloat*> ElemIconScaleCurveMap; // 0x5d0(0x50)
	struct TMap<enum class EBattlePromptType, struct UCurveFloat*> ElemTransparencyCurveMap; // 0x620(0x50)
	int32_t CloseCheckAngleDefault; // 0x670(0x04)
	char pad_674[0x4]; // 0x674(0x04)
	struct UCurveFloat* CloseCheckAngleCurve; // 0x678(0x08)
	float ElemLerpSpeed; // 0x680(0x04)
	int32_t EditorTestColorFactor; // 0x684(0x04)
	int32_t EditorTestLengthFactor; // 0x688(0x04)
	int32_t EditorTestAngle; // 0x68c(0x04)
	struct TSet<struct AActor*> EffectedNightmareActors; // 0x690(0x50)
	char pad_6E0[0x70]; // 0x6e0(0x70)
	struct TArray<struct FPromptElemInfo> Datas; // 0x750(0x10)
	char pad_760[0x58]; // 0x760(0x58)

	void PlayForbidAnim(bool bQuickEnter); // Function Solarland.BattlePromptWidget.PlayForbidAnim // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnSpecTargetChanged(struct ASolarPlayerState* OldTarget, struct ASolarPlayerState* NewTarget); // Function Solarland.BattlePromptWidget.OnSpecTargetChanged // (Final|Native|Public) // @ game+0x2662140
	void OnNightComesActorChanged(struct AActor* InActor); // Function Solarland.BattlePromptWidget.OnNightComesActorChanged // (Final|Native|Public) // @ game+0x2661cf0
	void OnCharacterInhibitTagChanged(struct FGameplayTag Tag, int32_t NewCount); // Function Solarland.BattlePromptWidget.OnCharacterInhibitTagChanged // (Final|Native|Public) // @ game+0x2661a60
};

// Class Solarland.BattleSubSundry
// Size: 0x458 (Inherited: 0x400)
struct UBattleSubSundry : USolarUserWidget {
	struct UScrollBox* PanelInformation; // 0x400(0x08)
	struct UCanvasPanel* Panel_BattleChatInfoSetting; // 0x408(0x08)
	struct USolarRichTextBlock* TxtInformation03; // 0x410(0x08)
	struct USolarRichTextBlock* TxtInformation02; // 0x418(0x08)
	struct USolarRichTextBlock* TxtInformation01; // 0x420(0x08)
	struct UWidgetAnimation* AnimInformationDisappear; // 0x428(0x08)
	int32_t MaxMessageStock; // 0x430(0x04)
	float ChatCoolDown; // 0x434(0x04)
	float InfoKeepDuration; // 0x438(0x04)
	char pad_43C[0x1c]; // 0x43c(0x1c)

	void ReceiveQuickMessage(struct FString InName, struct FString InMessage, bool bLocalPlayer, bool bSound, int32_t PosInTeam, struct FString InMessage2); // Function Solarland.BattleSubSundry.ReceiveQuickMessage // (Final|Native|Protected) // @ game+0x26684f0
	void OnPlayerStateRep(enum class EPlayerStateRepType RepType, struct APlayerState* PlayerState); // Function Solarland.BattleSubSundry.OnPlayerStateRep // (Final|Native|Protected) // @ game+0x26683a0
};

// Class Solarland.BattleUpgradeEffectCategoryData
// Size: 0x80 (Inherited: 0x30)
struct UBattleUpgradeEffectCategoryData : UDataAsset {
	struct TMap<enum class EBattleUpgradeEffectCategory, struct FBattleUpgradeEffectCategoryConfig> CategoryConfigMap; // 0x30(0x50)

	void BreakBattleUpgradeEffectCategoryColorSet(struct FBattleUpgradeEffectCategoryColorSet& ColorSet, struct FLinearColor& BannerCategoryTextColor, struct FLinearColor& BannerIconColor, struct FLinearColor& BannerBorderColor, struct FLinearColor& BannerBackgroundColor, struct FLinearColor& BadgeIconColor, struct FLinearColor& BadgeBackgroundColor); // Function Solarland.BattleUpgradeEffectCategoryData.BreakBattleUpgradeEffectCategoryColorSet // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x2667f10
};

// Class Solarland.BattleUpgradeEffectSettings
// Size: 0x90 (Inherited: 0x38)
struct UBattleUpgradeEffectSettings : UDeveloperSettings {
	struct TSoftObjectPtr<UDataTable> EffectTypeConfig; // 0x38(0x28)
	int32_t SelectEffectHintLocalTextID; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TSoftObjectPtr<UBattleUpgradeEffectCategoryData> EffectCategoryData; // 0x68(0x28)
};

// Class Solarland.BigWaterGun
// Size: 0x390 (Inherited: 0x228)
struct ABigWaterGun : AActor {
	float CylinderRadius; // 0x228(0x04)
	float CylinderLength; // 0x22c(0x04)
	float TraceInterval; // 0x230(0x04)
	float DamageChaPerInterval; // 0x234(0x04)
	float DamageVehPerInterval; // 0x238(0x04)
	float DamageDecayFirst; // 0x23c(0x04)
	float DamageDecaySecond; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct FSoftObjectPath MeshPath; // 0x248(0x18)
	struct FName MeshSocket; // 0x260(0x08)
	struct FRotator WaterColumnEffectRotator; // 0x268(0x0c)
	char pad_274[0x4]; // 0x274(0x04)
	struct UParticleSystem* WaterColumnEffect; // 0x278(0x08)
	struct FName InstigatorEffectID; // 0x280(0x08)
	struct UCameraShake* CameraShakeClass; // 0x288(0x08)
	struct UUserWidget* InCrossHairClass; // 0x290(0x08)
	float NearlyEndTime; // 0x298(0x04)
	bool bShowDebug; // 0x29c(0x01)
	char pad_29D[0x3]; // 0x29d(0x03)
	struct FVector TraceStartRelativeLocation; // 0x2a0(0x0c)
	struct FVector TraceStartRelativeLocation_Crouch; // 0x2ac(0x0c)
	float MuzzleTraceOffset; // 0x2b8(0x04)
	struct FName ShotAnimNotifyName; // 0x2bc(0x08)
	struct FName UnequipAnimNotifyName; // 0x2c4(0x08)
	struct FName UnequipAnimNotifyName_Gatling; // 0x2cc(0x08)
	char pad_2D4[0x4]; // 0x2d4(0x04)
	struct UCurveFloat* DamageDecayCurve; // 0x2d8(0x08)
	struct FGameplayTag ChaSlowDownDecayDataTag; // 0x2e0(0x08)
	struct UCurveFloat* ChaSlowDownDecayCurve; // 0x2e8(0x08)
	struct FGameplayTag VehSlowDownDecayDataTag; // 0x2f0(0x08)
	struct UCurveFloat* VehSlowDownDecayCurve; // 0x2f8(0x08)
	float OcclusionCheckZOffset; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)
	struct TArray<struct ASummonItemBase*> BlockDamageItemClasses; // 0x308(0x10)
	struct USkeletalMeshComponent* Mesh; // 0x318(0x08)
	bool bInFire; // 0x320(0x01)
	bool bHitOther; // 0x321(0x01)
	char pad_322[0x6]; // 0x322(0x06)
	struct UParticleSystemComponent* ClientWaterColumnEffectHandle; // 0x328(0x08)
	int32_t InstigatorEffectHandle; // 0x330(0x04)
	char pad_334[0x4]; // 0x334(0x04)
	struct UCameraShake* CameraShakeInstance; // 0x338(0x08)
	char pad_340[0x8]; // 0x340(0x08)
	struct UCrossHairWidget* CrossHairWidget; // 0x348(0x08)
	struct FGameplayEffectSpecHandle SlowDownEffectHandle; // 0x350(0x10)
	char pad_360[0x20]; // 0x360(0x20)
	struct FName LeftHandIKGripSocketName; // 0x380(0x08)
	struct FGameplayTag BigWaterGunOrnamentTag; // 0x388(0x08)

	void PlayNearlyEndSound(); // Function Solarland.BigWaterGun.PlayNearlyEndSound // (Final|Native|Private) // @ game+0x26684d0
	void OnRep_InFire(); // Function Solarland.BigWaterGun.OnRep_InFire // (Final|Native|Private) // @ game+0x26684b0
	void OnRep_HitOther(); // Function Solarland.BigWaterGun.OnRep_HitOther // (Final|Native|Private) // @ game+0x2668490
	void OnMontageNotifyCallBack(struct FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload); // Function Solarland.BigWaterGun.OnMontageNotifyCallBack // (Final|Native|Private|HasOutParms) // @ game+0x26682b0
};

// Class Solarland.GameManagerBase
// Size: 0x228 (Inherited: 0x228)
struct AGameManagerBase : AInfo {
};

// Class Solarland.BlueCircleManager
// Size: 0x280 (Inherited: 0x228)
struct ABlueCircleManager : AGameManagerBase {
	struct TArray<struct FBlueCircleInfo> BlueCircleInfoList; // 0x228(0x10)
	struct ASolarBlueCircle* BlueCircle; // 0x238(0x08)
	struct AActor* BlueCircleClass; // 0x240(0x08)
	struct TArray<int32_t> LevelToOutcomIDs; // 0x248(0x10)
	struct TArray<int32_t> ExtraOutcomeIDs; // 0x258(0x10)
	struct FBlueCircleInfo ActiveBlueCircleInfo; // 0x268(0x14)
	char pad_27C[0x4]; // 0x27c(0x04)

	void OnRep_ActiveBlueCircleInfo(); // Function Solarland.BlueCircleManager.OnRep_ActiveBlueCircleInfo // (Final|Native|Public) // @ game+0x2668470
	void OnLevelLoaded(struct FString LevelName); // Function Solarland.BlueCircleManager.OnLevelLoaded // (Final|Native|Public) // @ game+0x2668210
	struct TArray<int32_t> GetExtraOutcomeIDs(); // Function Solarland.BlueCircleManager.GetExtraOutcomeIDs // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26681e0
	struct FBlueCircleInfo GetActiveBlueCircleInfo(); // Function Solarland.BlueCircleManager.GetActiveBlueCircleInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26681b0
};

// Class Solarland.SpawnerInGuide
// Size: 0x278 (Inherited: 0x228)
struct ASpawnerInGuide : AActor {
	int32_t BotAISpawnerId; // 0x228(0x04)
	int32_t BotAICharacterId; // 0x22c(0x04)
	int32_t TeamID; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct FString AIName; // 0x238(0x10)
	bool bSpawnDeathBox; // 0x248(0x01)
	bool bSpawnBeginPlay; // 0x249(0x01)
	char pad_24A[0x2]; // 0x24a(0x02)
	float DelaySec; // 0x24c(0x04)
	struct FVector SpawnLocationOffset; // 0x250(0x0c)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct ASolarBotAIController* BotAIControllerClass; // 0x260(0x08)
	char pad_268[0x10]; // 0x268(0x10)

	struct ASolarBotAIController* SpawnBotAI(); // Function Solarland.SpawnerInGuide.SpawnBotAI // (Final|Native|Public|BlueprintCallable) // @ game+0x29b1210
	void SetBotAIConfig(struct ASolarBotAIController* Ctrl); // Function Solarland.SpawnerInGuide.SetBotAIConfig // (Native|Public) // @ game+0x295eef0
	struct ASolarBotAIController* GetSpawnedAIController(); // Function Solarland.SpawnerInGuide.GetSpawnedAIController // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x29b0470
};

// Class Solarland.BotAISpawnerInGuide
// Size: 0x2b8 (Inherited: 0x278)
struct ABotAISpawnerInGuide : ASpawnerInGuide {
	struct UBehaviorTree* BehaviorTree; // 0x278(0x08)
	struct TArray<struct FDeathBoxItemData> DeathBoxItems; // 0x280(0x10)
	int32_t BotDefaultWeaponId; // 0x290(0x04)
	uint32_t BotShootDisperse; // 0x294(0x04)
	float HitRate; // 0x298(0x04)
	float ActiveDamageRate; // 0x29c(0x04)
	float NoDamageLeftHP; // 0x2a0(0x04)
	float BotAttackRange; // 0x2a4(0x04)
	struct FVector MoveTarget; // 0x2a8(0x0c)
	char pad_2B4[0x4]; // 0x2b4(0x04)
};

// Class Solarland.BTDecorator_BlackboardDelay
// Size: 0xc8 (Inherited: 0xc0)
struct UBTDecorator_BlackboardDelay : UBTDecorator_Blackboard {
	float DelaySeconds; // 0xc0(0x04)
	bool bOnlyDelayLowerPri; // 0xc4(0x01)
	char pad_C5[0x3]; // 0xc5(0x03)
};

// Class Solarland.BTDecorator_TickFlow
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_TickFlow : UBTDecorator_BlackboardBase {
	float TickInterval; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Solarland.BTDecorator_BotAttributeCompare
// Size: 0xa8 (Inherited: 0x98)
struct UBTDecorator_BotAttributeCompare : UBTDecorator_TickFlow {
	enum class EBotAttrType AttrType; // 0x98(0x01)
	enum class EBotAttrValueType ValueType; // 0x99(0x01)
	enum class EBotAttrOperator Operator; // 0x9a(0x01)
	char pad_9B[0x1]; // 0x9b(0x01)
	float CompareValue; // 0x9c(0x04)
	bool bCheckVehicle; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float EqualThreshold; // 0xa4(0x04)
};

// Class Solarland.BTDecorator_BotCheck
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheck : UBTDecorator_TickFlow {
	enum class EBotCheckCondition Condition; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	int32_t BulletThreshold; // 0x9c(0x04)
};

// Class Solarland.BTDecorator_BotCheckAIServer
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckAIServer : UBTDecorator_TickFlow {
	enum class EBotCheckAIServer Action; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckGameplayTags
// Size: 0xb8 (Inherited: 0x98)
struct UBTDecorator_BotCheckGameplayTags : UBTDecorator_TickFlow {
	struct FGameplayTagContainer AbilityTags; // 0x98(0x20)
};

// Class Solarland.BTDecorator_BotCheckInEffectArea
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckInEffectArea : UBTDecorator_TickFlow {
	enum class EPerceivableEffectAreaType CheckInAreaType; // 0x98(0x01)
	bool bCheckAreaTendency; // 0x99(0x01)
	enum class EPerceivableEffectAreaTendency AreaTendency; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
};

// Class Solarland.BTDecorator_BotCheckNgaiMLAction
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckNgaiMLAction : UBTDecorator_TickFlow {
	enum class EBotCheckNgaiMLAction Action; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckRoleAbility
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_BotCheckRoleAbility : UBTDecorator {
	struct FGameplayTag AbilityTag; // 0x68(0x08)
};

// Class Solarland.BTDecorator_BotCheckShieldUpgradeItem
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_BotCheckShieldUpgradeItem : UBTDecorator {
};

// Class Solarland.BTDecorator_BotCheckState
// Size: 0xa8 (Inherited: 0x98)
struct UBTDecorator_BotCheckState : UBTDecorator_TickFlow {
	enum class EBotCheckState CheckState; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	struct FGameplayTag CheckTag; // 0x9c(0x08)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class Solarland.BTDecorator_BotCheckTeamMemberState
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckTeamMemberState : UBTDecorator_TickFlow {
	enum class ESolarBotMemberState CheckState; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckWeaponType
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_BotCheckWeaponType : UBTDecorator_BlackboardBase {
	enum class EWeaponType WeaponType; // 0x90(0x01)
	bool bCheckById; // 0x91(0x01)
	char pad_92[0x2]; // 0x92(0x02)
	int32_t weaponid; // 0x94(0x04)
};

// Class Solarland.BTDecorator_BotWasRecentlyDetectArea
// Size: 0xb0 (Inherited: 0x98)
struct UBTDecorator_BotWasRecentlyDetectArea : UBTDecorator_TickFlow {
	float TimeThresholdMax; // 0x98(0x04)
	float TimeThresholdMin; // 0x9c(0x04)
	float TimeThresholdMinDeviation; // 0xa0(0x04)
	bool bSpecifyAreaType; // 0xa4(0x01)
	enum class EPerceivableEffectAreaType SpecifiedAreaType; // 0xa5(0x01)
	bool bSpecifyAreaTendency; // 0xa6(0x01)
	enum class EPerceivableEffectAreaTendency SpecifiedAreaTendency; // 0xa7(0x01)
	float MinInfluenceValue; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Solarland.BTDecorator_BotWasRecentlyHit
// Size: 0xb0 (Inherited: 0x98)
struct UBTDecorator_BotWasRecentlyHit : UBTDecorator_TickFlow {
	float TimeThresholdMax; // 0x98(0x04)
	bool bIncludeHearingHit; // 0x9c(0x01)
	bool bTriggerDelay; // 0x9d(0x01)
	char pad_9E[0x2]; // 0x9e(0x02)
	float TriggerDelaySeconds; // 0xa0(0x04)
	float TriggerDelaySecondsDeviation; // 0xa4(0x04)
	float TriggerExpiredSeconds; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Solarland.BTDecorator_CheckGetOnPlayerVehicle
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_CheckGetOnPlayerVehicle : UBTDecorator_TickFlow {
	float AcceptableRadius; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Solarland.BTDecorator_CheckTagState
// Size: 0xc8 (Inherited: 0xc0)
struct UBTDecorator_CheckTagState : UBTDecorator_Blackboard {
	struct FGameplayTag CheckStateTag; // 0xc0(0x08)
};

// Class Solarland.BTDecorator_DistanceCompare
// Size: 0x128 (Inherited: 0x98)
struct UBTDecorator_DistanceCompare : UBTDecorator_TickFlow {
	enum class EDistanceComparison Operator; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
	struct FBlackboardKeySelector BlackboardKeyFrom; // 0xa0(0x28)
	struct FBlackboardKeySelector BlackboardKeyTo; // 0xc8(0x28)
	float DistanceToCompare; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct FBlackboardKeySelector BBK_DistanceToCompare; // 0xf8(0x28)
	bool bDistance2D; // 0x120(0x01)
	char pad_121[0x3]; // 0x121(0x03)
	float EqualThreshold; // 0x124(0x04)
};

// Class Solarland.BTDecorator_TimeLimitRand
// Size: 0x78 (Inherited: 0x70)
struct UBTDecorator_TimeLimitRand : UBTDecorator_TimeLimit {
	float RandDeviation; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Solarland.BTDecorator_VehicleCheck
// Size: 0xa8 (Inherited: 0x98)
struct UBTDecorator_VehicleCheck : UBTDecorator_TickFlow {
	struct TArray<int32_t> VehicleIDs; // 0x98(0x10)
};

// Class Solarland.BuffEffectActorElem
// Size: 0x48 (Inherited: 0x28)
struct UBuffEffectActorElem : UObject {
	char pad_28[0x20]; // 0x28(0x20)
};

// Class Solarland.BuffEffectLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuffEffectLibrary : UBlueprintFunctionLibrary {

	void StopScreenEffect(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.StopScreenEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x266e750
	void StopActorEffect(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.StopActorEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x266e600
	int32_t StartScreenEffect(struct UObject* WorldContextObject, struct FString RowName); // Function Solarland.BuffEffectLibrary.StartScreenEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x266e3d0
	int32_t StartActorEffect(struct UObject* WorldContextObject, struct FString RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectLibrary.StartActorEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x266e0d0
	bool IsDamageScreenEffectEnabled(struct UObject* WorldContextObject); // Function Solarland.BuffEffectLibrary.IsDamageScreenEffectEnabled // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x266de70
	struct TArray<struct UParticleSystemComponent*> GetActorEffectPSComponents(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.GetActorEffectPSComponents // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x266dc80
};

// Class Solarland.BuffEffectScreenPanel
// Size: 0x5b0 (Inherited: 0x400)
struct UBuffEffectScreenPanel : USolarUserWidget {
	char pad_400[0x10]; // 0x400(0x10)
	struct UCanvasPanel* LayerDurationGroup; // 0x410(0x08)
	struct UCanvasPanel* LayerDurationTwoSidePart; // 0x418(0x08)
	struct UCanvasPanel* LayerDurationBottomHalfPart; // 0x420(0x08)
	struct UCanvasPanel* LayerDurationBorderPart; // 0x428(0x08)
	struct UCanvasPanel* LayerDurationTopHalfPart; // 0x430(0x08)
	struct UCanvasPanel* LayerDurationFullPart; // 0x438(0x08)
	struct UCanvasPanel* LayerInstantGroup; // 0x440(0x08)
	struct UCanvasPanel* LayerInstantTwoSidePart; // 0x448(0x08)
	struct UCanvasPanel* LayerInstantBottomHalfPart; // 0x450(0x08)
	struct UCanvasPanel* LayerInstantBorderPart; // 0x458(0x08)
	struct UCanvasPanel* LayerInstantTopHalfPart; // 0x460(0x08)
	struct UCanvasPanel* LayerInstantFullPart; // 0x468(0x08)
	char pad_470[0xa0]; // 0x470(0xa0)
	struct TMap<int32_t, struct USolarScreenEffectWidget*> HandleToWidget; // 0x510(0x50)
	struct TMap<struct USolarScreenEffectWidget*, struct FScreenEffectWidgetCacheInfo> WidgetsCanBeReused; // 0x560(0x50)
};

// Class Solarland.BuffEffectSubsystem
// Size: 0x258 (Inherited: 0x30)
struct UBuffEffectSubsystem : UWorldSubsystem {
	char pad_30[0x20]; // 0x30(0x20)
	struct TMap<uint32_t, struct FBuffParticleEffectGroup> BuffEffectActorGroupMap; // 0x50(0x50)
	struct TMap<uint32_t, struct UBuffEffectActorElem*> BuffEffectActorElemMap; // 0xa0(0x50)
	struct TMap<int32_t, struct FBuffParticleEffectInstance> BuffEffectActorHandleMap; // 0xf0(0x50)
	struct FBuffEffectActorElemPool BuffEffectActorElemPool; // 0x140(0x10)
	struct FMulticastInlineDelegate OnDamageScreenEffectEnableChangedDelegate; // 0x150(0x10)
	struct TMap<enum class EBuffEffectTagType, struct FScreenEffectGroup> ScreenEffectGroups; // 0x160(0x50)
	char pad_1B0[0xa8]; // 0x1b0(0xa8)

	void StopScreenEffect(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.StopScreenEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x266e810
	void StopActorEffect(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.StopActorEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x266e6c0
	int32_t StartScreenEffectSafe(struct FName& RowName); // Function Solarland.BuffEffectSubsystem.StartScreenEffectSafe // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x266e560
	int32_t StartScreenEffect(struct FString RowName); // Function Solarland.BuffEffectSubsystem.StartScreenEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x266e4b0
	int32_t StartActorEffectSafe(struct FName& RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectSubsystem.StartActorEffectSafe // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x266e2e0
	int32_t StartActorEffect(struct FString RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectSubsystem.StartActorEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x266e1f0
	void OnPSCompFinish(struct UParticleSystemComponent* PSComponent); // Function Solarland.BuffEffectSubsystem.OnPSCompFinish // (Final|Native|Private) // @ game+0x266df30
	void OnDamageScreenEffectEnableChangedDelegate__DelegateSignature(bool bEnabled); // DelegateFunction Solarland.BuffEffectSubsystem.OnDamageScreenEffectEnableChangedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x2d0d160
	bool IsDamageScreenEffectEnabled(); // Function Solarland.BuffEffectSubsystem.IsDamageScreenEffectEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x266df00
	struct TArray<struct UParticleSystemComponent*> GetActorEffectPSComponents(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.GetActorEffectPSComponents // (Final|Native|Public|BlueprintCallable) // @ game+0x266dd90
};

// Class Solarland.CameraAnimationSequenceCameraStandIn
// Size: 0x700 (Inherited: 0x60)
struct UCameraAnimationSequenceCameraStandIn : USceneComponentTransformStandIn {
	float FieldOfView; // 0x60(0x04)
	char bConstrainAspectRatio : 1; // 0x64(0x01)
	char pad_64_1 : 7; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	float AspectRatio; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x70(0x5c0)
	float PostProcessBlendWeight; // 0x630(0x04)
	struct FCameraFilmbackSettings Filmback; // 0x634(0x0c)
	struct FCameraLensSettings LensSettings; // 0x640(0x18)
	struct FCameraFocusSettings FocusSettings; // 0x658(0x58)
	float CurrentFocalLength; // 0x6b0(0x04)
	float CurrentAperture; // 0x6b4(0x04)
	float CurrentFocusDistance; // 0x6b8(0x04)
	char pad_6BC[0x44]; // 0x6bc(0x44)
};

// Class Solarland.CameraAnimationSequencePlayer
// Size: 0x808 (Inherited: 0x28)
struct UCameraAnimationSequencePlayer : UObject {
	char pad_28[0x450]; // 0x28(0x450)
	struct UObject* BoundObjectOverride; // 0x478(0x08)
	struct UMovieSceneSequence* Sequence; // 0x480(0x08)
	struct FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x488(0x320)
	char pad_7A8[0x60]; // 0x7a8(0x60)
};

// Class Solarland.CameraModifier_CameraShakeWithCurve
// Size: 0xb8 (Inherited: 0x48)
struct UCameraModifier_CameraShakeWithCurve : UCameraModifier {
	struct TMap<struct UCameraShakeWithCurve*, struct FCameraShakeWithCurvePool> ShakePoolByClass; // 0x48(0x50)
	struct TArray<struct FCameraShakeWithCurveTemplatePool> ShakePoolByTemplate; // 0x98(0x10)
	struct TArray<struct FActiveCameraShakeWithCurve> ActiveShakes; // 0xa8(0x10)
};

// Class Solarland.CameraShakeWithCurve
// Size: 0xe0 (Inherited: 0x28)
struct UCameraShakeWithCurve : UObject {
	bool bSingleInstance; // 0x28(0x01)
	bool bDisableObjectPool; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
	struct UCameraModifier_CameraShakeWithCurve* Modifier; // 0x30(0x08)
	float ShakeTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FRuntimeFloatCurve ShakeCurve; // 0x40(0x88)
	struct TArray<struct UCameraShakeWithCurve_Element*> ShakeElements; // 0xc8(0x10)
	char pad_D8[0x8]; // 0xd8(0x08)
};

// Class Solarland.CameraShakeWithCurve_Element
// Size: 0x28 (Inherited: 0x28)
struct UCameraShakeWithCurve_Element : UObject {
};

// Class Solarland.CameraShakeWithCurve_Location
// Size: 0x60 (Inherited: 0x28)
struct UCameraShakeWithCurve_Location : UCameraShakeWithCurve_Element {
	struct FSymmetricRangeFloat XRange; // 0x28(0x0c)
	struct FSymmetricRangeFloat YRange; // 0x34(0x0c)
	struct FSymmetricRangeFloat ZRange; // 0x40(0x0c)
	bool bLocalSpace; // 0x4c(0x01)
	char pad_4D[0x13]; // 0x4d(0x13)
};

// Class Solarland.CameraShakeWithCurve_Rotation
// Size: 0x58 (Inherited: 0x28)
struct UCameraShakeWithCurve_Rotation : UCameraShakeWithCurve_Element {
	struct FSymmetricRangeFloat PitchRange; // 0x28(0x0c)
	struct FSymmetricRangeFloat YawRange; // 0x34(0x0c)
	struct FSymmetricRangeFloat RollRange; // 0x40(0x0c)
	char pad_4C[0xc]; // 0x4c(0x0c)
};

// Class Solarland.CameraShakeWithCurve_FOV
// Size: 0x38 (Inherited: 0x28)
struct UCameraShakeWithCurve_FOV : UCameraShakeWithCurve_Element {
	struct FRangeFloat FOVRange; // 0x28(0x08)
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Solarland.CapsuleFormationData
// Size: 0x90 (Inherited: 0x30)
struct UCapsuleFormationData : UDataAsset {
	struct TMap<char, struct FEchelonFormation> TeamFormation; // 0x30(0x50)
	struct FCruiseFormation CruiseFormation; // 0x80(0x10)

	void OverrideTeamFormation(struct TMap<char, struct FEchelonFormation>& InNewFormation); // Function Solarland.CapsuleFormationData.OverrideTeamFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x266dfc0
	void ClearTeamFormationData(); // Function Solarland.CapsuleFormationData.ClearTeamFormationData // (Final|Native|Public|BlueprintCallable) // @ game+0x266dc60
	void ClearCruiseFormationData(); // Function Solarland.CapsuleFormationData.ClearCruiseFormationData // (Final|Native|Public|BlueprintCallable) // @ game+0x266dc40
	void AddTeamFormationLocation(char InEchelon, struct FVector& InLocation); // Function Solarland.CapsuleFormationData.AddTeamFormationLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x266db70
	void AddLocationToTeamFormation(struct TMap<char, struct FEchelonFormation>& InFormation, char InEchelon, struct FVector& InLocation); // Function Solarland.CapsuleFormationData.AddLocationToTeamFormation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x266d9e0
	void AddEchelonFormation(char InEchelon, struct FEchelonFormation& InFormation); // Function Solarland.CapsuleFormationData.AddEchelonFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x266d8f0
	void AddCruiseFormation(struct FCruiseFormation& InFormation); // Function Solarland.CapsuleFormationData.AddCruiseFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x266d840
};

// Class Solarland.CardView
// Size: 0x228 (Inherited: 0x138)
struct UCardView : UWidget {
	struct UUserWidget* EntryWidgetClass; // 0x138(0x08)
	struct FUserWidgetPool EntryWidgetPool; // 0x140(0x80)
	float CenterScale; // 0x1c0(0x04)
	float CenterOffset; // 0x1c4(0x04)
	float PageSpacing; // 0x1c8(0x04)
	float AlignmentPercent; // 0x1cc(0x04)
	enum class EOrientation Orientation; // 0x1d0(0x01)
	char pad_1D1[0x7]; // 0x1d1(0x07)
	struct TArray<struct UObject*> ListItems; // 0x1d8(0x10)
	char pad_1E8[0x10]; // 0x1e8(0x10)
	struct FMulticastInlineDelegate BP_OnItemClicked; // 0x1f8(0x10)
	struct FMulticastInlineDelegate BP_OnSelectedItemChanged; // 0x208(0x10)
	struct FMulticastInlineDelegate BP_OnSelectedIndexChanged; // 0x218(0x10)

	void SetListItems(struct TArray<struct UObject*>& InListItems); // Function Solarland.CardView.SetListItems // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x26722f0
	void RemoveItem(struct UObject* InItem); // Function Solarland.CardView.RemoveItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x2673500
	struct TArray<struct UObject*> GetListItems(); // Function Solarland.CardView.GetListItems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2673070
	struct TArray<struct UUserWidget*> GetDisplayedEntryWidgets(); // Function Solarland.CardView.GetDisplayedEntryWidgets // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2672e70
	void ClearListItems(); // Function Solarland.CardView.ClearListItems // (Final|Native|Protected|BlueprintCallable) // @ game+0x2672880
	void BP_SetSelectedItem(struct UObject* Item); // Function Solarland.CardView.BP_SetSelectedItem // (Final|Native|Private|BlueprintCallable) // @ game+0x2672470
	void BP_SetSelectedIndex(int32_t Index, bool bFromFirst); // Function Solarland.CardView.BP_SetSelectedIndex // (Final|Native|Private|BlueprintCallable) // @ game+0x26723a0
	void BP_SetListItems(struct TArray<struct UObject*>& InListItems); // Function Solarland.CardView.BP_SetListItems // (Final|Native|Private|HasOutParms|BlueprintCallable) // @ game+0x26722f0
	struct UObject* BP_GetSelectedItem(); // Function Solarland.CardView.BP_GetSelectedItem // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x26722c0
	int32_t BP_GetSelectedIndex(); // Function Solarland.CardView.BP_GetSelectedIndex // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x2672290
	void AddItem(struct UObject* InItem); // Function Solarland.CardView.AddItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x2672200
};

// Class Solarland.CardViewDesignerPreviewItem
// Size: 0x28 (Inherited: 0x28)
struct UCardViewDesignerPreviewItem : UObject {
};

// Class Solarland.CGCustomeBattleRoyaleComponent
// Size: 0xd8 (Inherited: 0xd0)
struct UCGCustomeBattleRoyaleComponent : UGameModeCompBase {
	char pad_D0[0x8]; // 0xd0(0x08)

	void ChangeEnvironmentTime(struct ASolarTimeLineManager* SolarTimeLineManager, int32_t DaylightChange); // Function Solarland.CGCustomeBattleRoyaleComponent.ChangeEnvironmentTime // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.CGFormula
// Size: 0x258 (Inherited: 0x228)
struct ACGFormula : AInfo {
	struct FKnockoutParams KnockoutParams; // 0x228(0x28)
	bool bInitKnockParams; // 0x250(0x01)
	char pad_251[0x7]; // 0x251(0x07)

	struct TArray<struct FString> MakeStringForLuaByAnyStruct(struct UObject* AnyStruct); // Function Solarland.CGFormula.MakeStringForLuaByAnyStruct // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x26732f0
	bool IsSettlementBagItem(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.IsSettlementBagItem // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void InitKnockoutPointParams(struct FKnockoutParams& InParams); // Function Solarland.CGFormula.InitKnockoutPointParams // (Final|Native|Public|HasOutParms) // @ game+0x2673210
	int32_t GetZomborg(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetZomborg // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2d0d160
	void GetWeeklyChallenge(struct FString InSolarPlayerID, struct TArray<struct FString>& OutChallengeName, struct TArray<int32_t>& OutChallengeValue); // Function Solarland.CGFormula.GetWeeklyChallenge // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	int32_t GetWeaponExp(struct ASolarPlayerState* InPS, int32_t InWeaponID); // Function Solarland.CGFormula.GetWeaponExp // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void GetTeamScoreComparison(struct ASolarPlayerState* InPS, struct FString& OutTeamScore); // Function Solarland.CGFormula.GetTeamScoreComparison // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void GetStrategyGuideConditions(struct ASolarPlayerState* InPS, struct TArray<int32_t>& OutResult); // Function Solarland.CGFormula.GetStrategyGuideConditions // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void GetShowPageIndexs(struct ASolarPlayerState* InPS, struct FSettlePageParam& InParam, struct TArray<int32_t>& OutResult); // Function Solarland.CGFormula.GetShowPageIndexs // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	struct TArray<struct FSettlementReward> GetSettlementRewards(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetSettlementRewards // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	struct TArray<struct FString> GetPersonalResultPlayerExData(struct FString SolarPlayerID, struct FString& InPBName); // Function Solarland.CGFormula.GetPersonalResultPlayerExData // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	float GetKDA(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetKDA // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	struct TArray<struct FString> GetGroupResultPlayerExData(struct FString SolarPlayerID, struct FString& InPBName); // Function Solarland.CGFormula.GetGroupResultPlayerExData // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	struct TArray<struct FSettlementParam_ExtraRewardInfo> GetExtraRewards(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetExtraRewards // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	int32_t GetCombatScore(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetCombatScore // (Native|Event|Public|BlueprintEvent) // @ game+0x2672c30
	struct TMap<int32_t, int32_t> GetCollectionItemRewards(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetCollectionItemRewards // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void GetCharacterExp(struct ASolarPlayerState* InPS, int32_t& OutGetExp, struct TArray<int32_t>& OutReason); // Function Solarland.CGFormula.GetCharacterExp // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	int32_t GetAccountExp(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetAccountExp // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2d0d160
	int32_t CalculateTeamRank(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculateTeamRank // (Native|Event|Public|BlueprintEvent) // @ game+0x26727e0
	struct TArray<enum class ESCMPlayerPunishType> CalculatePunish(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculatePunish // (Native|Event|Public|BlueprintEvent) // @ game+0x2672700
	int32_t CalculatePlayerRank(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculatePlayerRank // (Native|Event|Public|BlueprintEvent) // @ game+0x2672660
	float CalculateMVPScore(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculateMVPScore // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	int32_t CalculateKnockoutPoints(int32_t InTeamRank, int32_t InKillNum, float InTotalDamage, float InTotalDamageTaken); // Function Solarland.CGFormula.CalculateKnockoutPoints // (Final|Native|Public) // @ game+0x2672500
};

// Class Solarland.CGMCrossLevelDataMgr
// Size: 0x80 (Inherited: 0x28)
struct UCGMCrossLevelDataMgr : UObject {
	struct TMap<struct FString, struct UObject*> CrossLevelData; // 0x28(0x50)
	char pad_78[0x8]; // 0x78(0x08)

	void SkipNextClear(); // Function Solarland.CGMCrossLevelDataMgr.SkipNextClear // (Final|Native|Public|BlueprintCallable) // @ game+0x2673660
	void RegistryCrossLevelData(struct FString InSoltName, struct UObject* InDataObj); // Function Solarland.CGMCrossLevelDataMgr.RegistryCrossLevelData // (Final|Native|Public|BlueprintCallable) // @ game+0x2673420
	struct UObject* GetCrossLevelData(struct FString InSoltName); // Function Solarland.CGMCrossLevelDataMgr.GetCrossLevelData // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x2672cd0
};

// Class Solarland.CustomGameModeComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UCustomGameModeComponent : UGameModeCompBase {
};

// Class Solarland.CGMDataComponent
// Size: 0xe8 (Inherited: 0xd0)
struct UCGMDataComponent : UCustomGameModeComponent {
	struct AGameDataManager* DataManager; // 0xd0(0x08)
	struct UDataTable* DataTable; // 0xd8(0x08)
	float ConfigRepDeltaTime; // 0xe0(0x04)
	float ConfigRepMaxNum; // 0xe4(0x04)
};

// Class Solarland.CGMDeathComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UCGMDeathComponent : UCustomGameModeComponent {

	void ReceivePlayerResurrect(struct ASolarCharacter* ResurrectCharacter, struct ASCMPlayerState* ResurrectPlayer); // Function Solarland.CGMDeathComponent.ReceivePlayerResurrect // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerKill(struct ASCMPlayerState* Killer, struct ASCMPlayerState* Killed, struct TArray<struct ASCMPlayerState*>& Assists, struct FSolarPointDamageEvent& InDamageEvent, struct AActor* InDamageCauser); // Function Solarland.CGMDeathComponent.ReceivePlayerKill // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerDeathVerge(struct ASCMPlayerState* InAttacker, struct ASCMPlayerState* InDeathVergePlayer, struct FSolarPointDamageEvent& InDamageEvent, struct AActor* InDamageCauser); // Function Solarland.CGMDeathComponent.ReceivePlayerDeathVerge // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.GameplayConfigBase
// Size: 0x38 (Inherited: 0x30)
struct UGameplayConfigBase : UDataAsset {
	struct UGameModeGlobalSetting* GameModeSettingTemplate; // 0x30(0x08)
};

// Class Solarland.CGMGameplayConfig
// Size: 0x420 (Inherited: 0x38)
struct UCGMGameplayConfig : UGameplayConfigBase {
	struct ACGFormula* Formula; // 0x38(0x08)
	bool bAllowChangePlayer; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct USettlementPageConfig* SettlePageConfig; // 0x48(0x08)
	struct TMap<struct FString, struct FSCMMapConfig> MapConfig; // 0x50(0x50)
	float VictorySlomoDelay; // 0xa0(0x04)
	float VictorySlomoDilation; // 0xa4(0x04)
	float VictorySlomoDuration; // 0xa8(0x04)
	struct FCharacterMovementNetworkOptions VictoryMovementNetworkOptions; // 0xac(0x0c)
	struct TMap<struct FString, float> VictorySFXAndVOMap; // 0xb8(0x50)
	float VictoryMusicDelayTime; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct FString VictoryMusicName; // 0x110(0x10)
	float VictoryUIWaittime; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct FSoftObjectPath VictoryHitEffect; // 0x128(0x18)
	struct FName VictoryHitSocketName; // 0x140(0x08)
	float VictoryHitEffectDelayTime; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct FSoftObjectPath VictoryDeathEffect; // 0x150(0x18)
	float VictoryDeathEffectDelayTime; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)
	struct FDataManagerConfig DataManagerConfig; // 0x170(0x10)
	bool EnableUltimateSkill; // 0x180(0x01)
	enum class ERoleSkillOperation UltimateSkillStateOperationOnInit; // 0x181(0x01)
	bool EnableTacticalSkill; // 0x182(0x01)
	enum class ERoleSkillOperation TacticalSkillStateOperationOnInit; // 0x183(0x01)
	int32_t AirDropSkillMode; // 0x184(0x04)
	struct TArray<struct UGameplayAbility*> CharacterExtraAbilities; // 0x188(0x10)
	bool EnableWeaponUpgrade; // 0x198(0x01)
	char pad_199[0x3]; // 0x199(0x03)
	int32_t InitInGamePlayerLevel; // 0x19c(0x04)
	bool EnablePlayerUpgrade; // 0x1a0(0x01)
	char pad_1A1[0x7]; // 0x1a1(0x07)
	struct FInGameLevelingConfig InGameLevelingConfig; // 0x1a8(0x08)
	struct TArray<enum class ESolarTablesEnum_BattleUpgradeEffectType> CharacterDamageUpgradeTypes; // 0x1b0(0x10)
	struct FExpItemConfig ExpItemConfig; // 0x1c0(0x10)
	struct FExpItemReduceRate ExpItemReduceRateConfig; // 0x1d0(0x08)
	struct FBoxBurstItemConfig BoxBurstItemConfig; // 0x1d8(0x08)
	bool bIfShouldSpawnDeathBox; // 0x1e0(0x01)
	bool bIfSupportDeathverge; // 0x1e1(0x01)
	char pad_1E2[0x6]; // 0x1e2(0x06)
	struct TMap<int32_t, int32_t> DeathBoxEnergyLimitConfig; // 0x1e8(0x50)
	bool bAutoMarkDamagedEnemy; // 0x238(0x01)
	char pad_239[0x7]; // 0x239(0x07)
	struct TMap<enum class ECustomParamType, float> CustomParams; // 0x240(0x50)
	float MoveSpeedScale; // 0x290(0x04)
	float ShieldScale; // 0x294(0x04)
	float HealthScale; // 0x298(0x04)
	int32_t Resurgence; // 0x29c(0x04)
	bool EnableSect; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	struct FCustomRoomData CustomRoomData; // 0x2a8(0xd8)
	bool bIsCustomRoomMode; // 0x380(0x01)
	bool bEnableTracking; // 0x381(0x01)
	char pad_382[0x2]; // 0x382(0x02)
	float InitTrackingDelay; // 0x384(0x04)
	float TrackingTimeInterval; // 0x388(0x04)
	float DefaultTrackMaxRevealDistance; // 0x38c(0x04)
	float TrackReplaceDistance; // 0x390(0x04)
	float MinRevealDistance; // 0x394(0x04)
	float TrackTimeout; // 0x398(0x04)
	int32_t MaxTrackNum; // 0x39c(0x04)
	struct FFinalsBGMData FinalsBGMData; // 0x3a0(0x28)
	bool bEnableSkydivingTrail; // 0x3c8(0x01)
	char pad_3C9[0x7]; // 0x3c9(0x07)
	struct TSoftClassPtr<UObject> FlyTrailClass; // 0x3d0(0x28)
	struct TSoftClassPtr<UObject> DebugTrailEffectClass; // 0x3f8(0x28)

	bool TryGetCustomParam(enum class ECustomParamType InType, float& OutValue); // Function Solarland.CGMGameplayConfig.TryGetCustomParam // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x2673680
	void SetCustomParam(enum class ECustomParamType InType, float InValue); // Function Solarland.CGMGameplayConfig.SetCustomParam // (Final|Native|Public|BlueprintCallable) // @ game+0x2673590
	void OnRep_MoveSpeedScale(); // Function Solarland.CGMGameplayConfig.OnRep_MoveSpeedScale // (Final|Native|Public) // @ game+0x2673400
	bool IsEnableSect(); // Function Solarland.CGMGameplayConfig.IsEnableSect // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26732d0
	bool IsCustomRoomMode(); // Function Solarland.CGMGameplayConfig.IsCustomRoomMode // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xcb4e00
	int32_t GetRequiredExpForLevel(int32_t InLevel); // Function Solarland.CGMGameplayConfig.GetRequiredExpForLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2673170
	int32_t GetMaxShieldMatCountToDeathbox(int32_t InLevel); // Function Solarland.CGMGameplayConfig.GetMaxShieldMatCountToDeathbox // (Final|Native|Public|Const) // @ game+0x26730d0
	int32_t GetMaxInGameLevel(); // Function Solarland.CGMGameplayConfig.GetMaxInGameLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26730a0
	float GetExpItemReduceRate(int32_t DeathCount); // Function Solarland.CGMGameplayConfig.GetExpItemReduceRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2672fd0
	int32_t GetExpItemCountByLevel(int32_t InLevel, int32_t InLevelGap); // Function Solarland.CGMGameplayConfig.GetExpItemCountByLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2672f00
	struct FCustomRoomData GetCustomRoomData(); // Function Solarland.CGMGameplayConfig.GetCustomRoomData // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x2672d80
	struct TArray<int32_t> GetBurstItemSplitPiles(int32_t ItemID); // Function Solarland.CGMGameplayConfig.GetBurstItemSplitPiles // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2672b50
	struct FRotator GetBurstItemRotator(int32_t ItemID); // Function Solarland.CGMGameplayConfig.GetBurstItemRotator // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x2672aa0
	struct TArray<float> GetBurstItemModelScale(int32_t ItemID); // Function Solarland.CGMGameplayConfig.GetBurstItemModelScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26729c0
	int32_t GetBurstItemMaxPileNum(int32_t ItemID); // Function Solarland.CGMGameplayConfig.GetBurstItemMaxPileNum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2672920
	struct TArray<int32_t> GetBurstItemIDs(); // Function Solarland.CGMGameplayConfig.GetBurstItemIDs // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x26728a0
};

// Class Solarland.CGMLogicComponent
// Size: 0x180 (Inherited: 0xd0)
struct UCGMLogicComponent : UCustomGameModeComponent {
	float TimeOutSeconds; // 0xd0(0x04)
	char pad_D4[0x64]; // 0xd4(0x64)
	bool bUseNewAiComp; // 0x138(0x01)
	char pad_139[0x7]; // 0x139(0x07)
	struct FMulticastInlineDelegate OnConfigInitiated; // 0x140(0x10)
	struct FMulticastInlineDelegate OnBattleStart; // 0x150(0x10)
	struct FMulticastInlineDelegate OnPlayerOut; // 0x160(0x10)
	struct FMulticastInlineDelegate OnPlayerReconnected; // 0x170(0x10)

	void UpdateAliveTeamsAndPlayers(); // Function Solarland.CGMLogicComponent.UpdateAliveTeamsAndPlayers // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ad6f40
	void ReceiveSpectatorJoinData(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.ReceiveSpectatorJoinData // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveServerLevelLoaded(struct FString LevelName); // Function Solarland.CGMLogicComponent.ReceiveServerLevelLoaded // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	bool ReceivePlayerTeamPreJoinRequest(struct TArray<struct ASCMPlayerState*>& PreJoinPlayers, int32_t TeamID); // Function Solarland.CGMLogicComponent.ReceivePlayerTeamPreJoinRequest // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2677cd0
	bool ReceivePlayerReJoinRequest(struct FString PlayerId, struct FString& ErrorMsg); // Function Solarland.CGMLogicComponent.ReceivePlayerReJoinRequest // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2677bb0
	void ReceivePlayerReJoin(struct ASCMPlayerState* NewPlayer); // Function Solarland.CGMLogicComponent.ReceivePlayerReJoin // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerPreLogin(struct FString PlayerId, struct ASCMPlayerState* OfflinePlayer, struct FString& ErrorMsg); // Function Solarland.CGMLogicComponent.ReceivePlayerPreLogin // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerNonSpectatorJoinData(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.ReceivePlayerNonSpectatorJoinData // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerLevelLoaded(struct ASCMPlayerController* Player, struct FString LevelName); // Function Solarland.CGMLogicComponent.ReceivePlayerLevelLoaded // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerJoinData(struct FString PlayerId); // Function Solarland.CGMLogicComponent.ReceivePlayerJoinData // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerJoinBattle(struct ASCMPlayerState* NewPlayer, bool IsAI); // Function Solarland.CGMLogicComponent.ReceivePlayerJoinBattle // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerJoin(struct ASCMPlayerState* NewPlayer, bool IsAI); // Function Solarland.CGMLogicComponent.ReceivePlayerJoin // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerCancelJoin(struct FString PlayerId); // Function Solarland.CGMLogicComponent.ReceivePlayerCancelJoin // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceivePlayerBattleEnd(struct ASCMPlayerState* Player, enum class ESCMPlayerOutType OutType); // Function Solarland.CGMLogicComponent.ReceivePlayerBattleEnd // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveOBPlayersChanged(); // Function Solarland.CGMLogicComponent.ReceiveOBPlayersChanged // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveGameModeInit(); // Function Solarland.CGMLogicComponent.ReceiveGameModeInit // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveBattleTick(float BattleTime, float DeltaTime); // Function Solarland.CGMLogicComponent.ReceiveBattleTick // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveBattleEnd(); // Function Solarland.CGMLogicComponent.ReceiveBattleEnd // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void ReceiveBattleBegin(); // Function Solarland.CGMLogicComponent.ReceiveBattleBegin // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnStartBattle(); // Function Solarland.CGMLogicComponent.OnStartBattle // (Final|Native|Public|BlueprintCallable) // @ game+0x2677b90
	void OnPlayerSettled(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.OnPlayerSettled // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerReconnect(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.OnPlayerReconnect // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerOfflineTimeOut(struct ASCMPlayerState* OfflineTimeoutPlayer); // Function Solarland.CGMLogicComponent.OnPlayerOfflineTimeOut // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerGiveUp(struct ASCMPlayerState* OfflineTimeoutPlayer); // Function Solarland.CGMLogicComponent.OnPlayerGiveUp // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerDisconnect(struct ASCMPlayerState* OfflinePlayer); // Function Solarland.CGMLogicComponent.OnPlayerDisconnect // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerCheat(struct ASCMPlayerState* CheatPlayer); // Function Solarland.CGMLogicComponent.OnPlayerCheat // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnPlayerAbnormal(struct ASCMPlayerState* CheatPlayer); // Function Solarland.CGMLogicComponent.OnPlayerAbnormal // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnMatchEnd(int32_t RPCID); // Function Solarland.CGMLogicComponent.OnMatchEnd // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnDSClose(); // Function Solarland.CGMLogicComponent.OnDSClose // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	void OnBotAIDataReady(int32_t AICount); // Function Solarland.CGMLogicComponent.OnBotAIDataReady // (Event|Public|BlueprintEvent) // @ game+0x2d0d160
	bool IsAllowReconnectGame(struct ASCMPlayerState* InPC); // Function Solarland.CGMLogicComponent.IsAllowReconnectGame // (Native|Event|Public|BlueprintEvent) // @ game+0x26775d0
	void CallOnPlayerReconnected(struct ASCMPlayerState* InPlayerState); // Function Solarland.CGMLogicComponent.CallOnPlayerReconnected // (Final|Native|Protected|BlueprintCallable) // @ game+0x2676db0
	void CallOnPlayerOut(struct ASCMPlayerState* InPlayerState); // Function Solarland.CGMLogicComponent.CallOnPlayerOut // (Final|Native|Protected|BlueprintCallable) // @ game+0x2676d20
	void CallOnConfigInitiated(); // Function Solarland.CGMLogicComponent.CallOnConfigInitiated // (Final|Native|Protected|BlueprintCallable) // @ game+0x2676d00
	void CallOnBattleStart(); // Function Solarland.CGMLogicComponent.CallOnBattleStart // (Final|Native|Protected|BlueprintCallable) // @ game+0x2676ce0
};

// Class Solarland.SolarGameplayConfigComponent
// Size: 0xd8 (Inherited: 0xb0)
struct USolarGameplayConfigComponent : UActorComponent {
	bool EnableTestGameplayConfig; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct UGameplayConfigBase* CGMConfig; // 0xb8(0x08)
	struct UGameplayConfigBase* TestCGMConfig; // 0xc0(0x08)
	struct UGameplayConfigBase* InstGameplayConfig; // 0xc8(0x08)
	struct UGameplayConfigBase* InstTestGameplayConfig; // 0xd0(0x08)

	struct UGameplayConfigBase* GetConfigs(); // Function Solarland.SolarGameplayConfigComponent.GetConfigs // (Native|Public|BlueprintCallable) // @ game+0x27d3a10
};

// Class Solarland.CGMManagerConfigComponent
// Size: 0xd8 (Inherited: 0xd8)
struct UCGMManagerConfigComponent : USolarGameplayConfigComponent {
};

// Class Solarland.CGMMapInfo
// Size: 0x180 (Inherited: 0xd0)
struct UCGMMapInfo : UGameModeCompBase {
	struct TArray<struct FVector> AreaPosArray; // 0xd0(0x10)
	int32_t MapID; // 0xe0(0x04)
	int32_t UsedAirlineID; // 0xe4(0x04)
	struct FAirlineData UsedAirlineData; // 0xe8(0x28)
	char pad_110[0x10]; // 0x110(0x10)
	struct TMap<int32_t, struct FAirlineData> AirlineDataList; // 0x120(0x50)
	int32_t MaskWidth; // 0x170(0x04)
	float MaskScale; // 0x174(0x04)
	int32_t MapWidth; // 0x178(0x04)
	int32_t MapHeight; // 0x17c(0x04)

	void LoadAirlineData(); // Function Solarland.CGMMapInfo.LoadAirlineData // (Final|Native|Protected|BlueprintCallable) // @ game+0x2677670
	void InitInfo(int32_t InMapID); // Function Solarland.CGMMapInfo.InitInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x2677540
	int32_t GetUsedAirlineData(struct FAirlineData& OutData); // Function Solarland.CGMMapInfo.GetUsedAirlineData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x2677490
	int32_t GetMapIDByName(struct ASCustomGameState* InGameState, struct FString Name); // Function Solarland.CGMMapInfo.GetMapIDByName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x2677360
};

// Class Solarland.CGMSettlementComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UCGMSettlementComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct USettlementPageConfig* PageConfig; // 0xb8(0x08)
	struct TArray<int32_t> PageIndexs; // 0xc0(0x10)
	bool IsCustomRoom; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)

	bool SkipToTarget(); // Function Solarland.CGMSettlementComponent.SkipToTarget // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	bool ShowNextStage(); // Function Solarland.CGMSettlementComponent.ShowNextStage // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
	void PlayHighlight(); // Function Solarland.CGMSettlementComponent.PlayHighlight // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x2d0d160
};

// Class Solarland.ChaAT_AddSynchronizedForce
// Size: 0xe0 (Inherited: 0x80)
struct UChaAT_AddSynchronizedForce : UAbilityTask {
	char pad_80[0x60]; // 0x80(0x60)
};

// Class Solarland.ChaAT_AltitudeQuery
// Size: 0x130 (Inherited: 0x80)
struct UChaAT_AltitudeQuery : UAbilityTask {
	struct FMulticastInlineDelegate OnResponsed; // 0x80(0x10)
	char pad_90[0xa0]; // 0x90(0xa0)

	struct UChaAT_AltitudeQuery* StartSphereAltitudeQuery(struct UGameplayAbility* OwningAbility, float InAltitude, float Radius, struct TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, bool bIgnoreSelf, bool bUsingAsyncQuery, bool bInTriggerOnce); // Function Solarland.ChaAT_AltitudeQuery.StartSphereAltitudeQuery // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable) // @ game+0x2678090
	struct UChaAT_AltitudeQuery* StartLineAltitudeQuery(struct UGameplayAbility* OwningAbility, float InAltitude, struct TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, bool bIgnoreSelf, bool bUsingAsyncQuery, bool bInTriggerOnce); // Function Solarland.ChaAT_AltitudeQuery.StartLineAltitudeQuery // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable) // @ game+0x2677dd0
};

// Class Solarland.ChaAT_Blink
// Size: 0xc0 (Inherited: 0x80)
struct UChaAT_Blink : USolarAbilityTask {
	char pad_80[0x40]; // 0x80(0x40)

