// Enum Solarland.EBoolean
enum class EBoolean : uint8 {
	BranchFalse = 0,
	BranchTrue = 1,
	EBoolean_MAX = 2
};

// Enum Solarland.EActorRegisterType
enum class EActorRegisterType : uint8 {
	EART_None = 0,
	EART_Character = 1,
	EART_Vehicle = 2,
	EART_Turret = 4,
	EART_TreasureBox = 8,
	EART_ChargingPile = 16,
	EART_Summon = 32,
	EART_HumanoidTarget = 64,
	EART_Water = 128,
	EART_MAX = 129
};

// Enum Solarland.ESolarNetMode
enum class ESolarNetMode : uint8 {
	NM_Standalone = 0,
	NM_DedicatedServer = 1,
	NM_ListenServer = 2,
	NM_Client = 3,
	NM_MAX = 4,
	NM_Unknown = 5
};

// Enum Solarland.ESolarPlayStage
enum class ESolarPlayStage : uint8 {
	None = 0,
	Login = 1,
	Lobby = 2,
	Battle = 3,
	Settlement = 4,
	PlaceHolder1 = 5,
	PlaceHolder2 = 6,
	PlaceHolder3 = 7,
	ESolarPlayStage_MAX = 8
};

// Enum Solarland.ERoleSkillOperation
enum class ERoleSkillOperation : uint8 {
	None = 0,
	ToNormal = 1,
	ClearCD = 2,
	ResetCD = 3,
	Forbid = 4,
	Unforbid = 5,
	ERoleSkillOperation_MAX = 6
};

// Enum Solarland.ECustomParamType
enum class ECustomParamType : uint8 {
	WeaponDamageScale = 0,
	SkillDamageScale = 1,
	HeadShootDamageScale = 2,
	VehicleDamageScale = 3,
	MoveSpeedScale = 4,
	ShieldScale = 5,
	HealthScale = 6,
	Resurgence = 7,
	GravityScale = 8,
	None = 9,
	ECustomParamType_MAX = 10
};

// Enum Solarland.EBattleEndType
enum class EBattleEndType : uint8 {
	None = 0,
	BattleOver = 1,
	PlayerNotEnough = 2,
	BeginTimeOut = 3,
	Abandoned = 4,
	EBattleEndType_MAX = 5
};

// Enum Solarland.ESCTournamentType
enum class ESCTournamentType : uint8 {
	None = 0,
	SingleRace = 1,
	PointRace = 2,
	KnockoutRace = 3,
	PointRaceV2 = 4,
	ESCTournamentType_MAX = 5
};

// Enum Solarland.ESCRoomType
enum class ESCRoomType : uint8 {
	None = 0,
	Normal = 1,
	Tournament = 2,
	CustomServer = 3,
	ESCRoomType_MAX = 4
};

// Enum Solarland.ESCMInGameState
enum class ESCMInGameState : uint8 {
	None = 0,
	InPrepare = 1,
	InBattle = 2,
	InBattleEnd = 3,
	ESCMInGameState_MAX = 4
};

// Enum Solarland.ESCMHostType
enum class ESCMHostType : uint8 {
	Global = 0,
	Side = 1,
	Player = 2,
	ESCMHostType_MAX = 3
};

// Enum Solarland.ESCMDataRankType
enum class ESCMDataRankType : uint8 {
	None = 0,
	Ascending = 1,
	AscendingReplace = 2,
	Descending = 3,
	DescendingReplace = 4,
	ESCMDataRankType_MAX = 5
};

// Enum Solarland.ESCMDataChangeType
enum class ESCMDataChangeType : uint8 {
	Add = 0,
	Change = 1,
	Delete = 2,
	DeleteAll = 3,
	ESCMDataChangeType_MAX = 4
};

// Enum Solarland.EStatisticsType
enum class EStatisticsType : uint8 {
	None = 0,
	DSTime = 1,
	G_UnBattleEndPlayerCount = 2,
	G_UnBattleEndTeamCount = 3,
	S_KillCount = 4,
	S_KillDownCount = 5,
	S_AssistCount = 6,
	S_DeathCount = 7,
	S_SaveCount = 8,
	S_UnBattleEndPlayerCount = 9,
	G_KillNum = 10,
	G_KillDown = 11,
	KillNum = 12,
	KillNumToRealPlayer = 13,
	P_KillStreak = 14,
	KillStreakHistory = 15,
	CharacterKillNumWithID = 16,
	KillDownNum = 17,
	AssistNum = 18,
	KillNpcNum = 19,
	KillMonster = 20,
	KillPlayer = 21,
	KillTeammate = 22,
	KillDownTeammate = 23,
	TotalWeaponKillNum = 24,
	WeaponAssistWithID = 25,
	WeaponKillNumWithID = 26,
	KillNumWithIDByVechile = 27,
	TotalVehicleKillNum = 28,
	RevengeNum = 29,
	AccurateKillTimes = 30,
	AccurateKillDownTimes = 31,
	WeaponSkillKillNum = 32,
	PunchKill = 33,
	AreaKillNum_Bubble = 34,
	DeathNum = 35,
	DyingCount = 36,
	DyingByNpc = 37,
	DyingByMonster = 38,
	DeathByVechile = 39,
	DeathByBombingArea = 40,
	CauseDamage = 41,
	CauseDamageToRealPlayer = 42,
	WeaponDamageWithIDToPlayer = 43,
	WeaponDamageWithTypeToPlayer = 44,
	VechileDamageWithIDToPlayer = 45,
	TotalVehicleDamage = 46,
	ReceivedDamage = 47,
	DamageByAI = 48,
	DamageByMonster = 49,
	DamageToMonster = 50,
	DamageToNpc = 51,
	AccurateDamage = 52,
	AttackTimes = 53,
	HitTimes = 54,
	HitedTimes = 55,
	AccurateDameageTimes = 56,
	BeAccurateDameageTimes = 57,
	LifeTime = 58,
	HealSelf = 59,
	SaveCount = 60,
	TeammateHeal = 61,
	ReceivedHeal = 62,
	ResurrectionCount = 63,
	CarSkillCount = 64,
	VechileDistance = 65,
	TotalVechileDistance = 66,
	VehicleTime = 67,
	UseVehicleTypes = 68,
	LastUseVehicleID = 69,
	TakeTheCarOfEnemy = 70,
	DriveCarInAirTime = 71,
	DriveHoverCarInWaterDistance = 72,
	WeaponID1 = 73,
	WeaponID2 = 74,
	WeaponLevel1 = 75,
	WeaponLevel2 = 76,
	UseWeaponSkillNum = 77,
	WeaponUseStartTimeWithID = 78,
	WeaponUseTimeWithID = 79,
	MaxGodWeaponNum = 80,
	CollectEnergy = 81,
	EscapeTimes = 82,
	CollectBoxNum = 83,
	CollectBoxNumWithHighQuality = 84,
	FlyCount = 85,
	ArmorUseCount = 86,
	ShieldRechargeCount = 87,
	EChestOpenNumForID = 88,
	DeathPos = 89,
	LandingPos = 90,
	LandingTime = 91,
	DropoutEvent = 92,
	DropoutTime = 93,
	MedicineUseCount = 94,
	RadarUseCount = 95,
	P_BattleResult = 96,
	OpenAirBoxNum = 97,
	KillInAirNum = 98,
	KillDownInAirNum = 99,
	ResurrectionNum = 100,
	ResurrectionCapsule = 101,
	TeamFriendRevive = 102,
	BuyESElectricNum = 103,
	CarFireCount = 104,
	HangTimeDuration = 105,
	SkydiveLandingDuration = 106,
	SwimDistance = 107,
	DanceCount = 108,
	PosionWalkDistance = 109,
	ShieldExpGainCount = 110,
	UpgradeShieldCount = 111,
	UpgradeRedShieldCount = 112,
	JumpBoardUseCount = 113,
	TerminaterCount = 114,
	UltimateSkillUseCount = 115,
	TacticalSkillUseCount = 116,
	UltimateSkillDamage = 117,
	TacticalSkillDamage = 118,
	UltimateSkillTakenDamage = 119,
	TacticalSkillTakenDamage = 120,
	UltimateSkillKillNum = 121,
	TacticalSkillKillNum = 122,
	HasHighlight = 123,
	WeaponID3 = 124,
	BackpackItems = 125,
	CurrentWeaponID = 126,
	MAX = 127
};

// Enum Solarland.EPlayHighlightEntryType
enum class EPlayHighlightEntryType : uint8 {
	Settlement = 0,
	Lobby = 1,
	TournamentList = 2,
	CustomRoomList = 3,
	EPlayHighlightEntryType_MAX = 4
};

// Enum Solarland.ERecordingType
enum class ERecordingType : uint8 {
	None = 0,
	Local = 1,
	NormalMatch = 2,
	Tournament = 3,
	LiveWatchOnly = 4,
	LocalHighlight = 5,
	ERecordingType_MAX = 6
};

// Enum Solarland.EReplayManagerState
enum class EReplayManagerState : uint8 {
	Initializing = 0,
	Idle = 1,
	Recording = 2,
	PlayingTryToStart = 3,
	PlayingStarted = 4,
	PlayingLoadLevelsStarted = 5,
	PlayingLevelLoaded = 6,
	PlayingStreamReadied = 7,
	PlayingFirstScrubing = 8,
	Playing = 9,
	PlayingAtEnd = 10,
	EReplayManagerState_MAX = 11
};

// Enum Solarland.EReplayPlayingFinishReason
enum class EReplayPlayingFinishReason : uint8 {
	Normal = 0,
	GMForce = 1,
	StreamerDownloadChunkTimeout = 2,
	StreamerServiceUnavailable = 3,
	EReplayPlayingFinishReason_MAX = 4
};

// Enum Solarland.EMultiplePassMaterialChangeCompatibilityMode
enum class EMultiplePassMaterialChangeCompatibilityMode : uint8 {
	Compatible = 0,
	Incompatible = 1,
	CompatibleWithSpecifiedPriorityTags = 2,
	IncompatibleWithSpecifiedPriorityTags = 3,
	EMultiplePassMaterialChangeCompatibilityMode_MAX = 4
};

// Enum Solarland.EMaterialChangeConflictResolveStrategy
enum class EMaterialChangeConflictResolveStrategy : uint8 {
	KeepAll = 0,
	KeepNew = 1,
	KeepOld = 2,
	EMaterialChangeConflictResolveStrategy_MAX = 3
};

// Enum Solarland.EWalkMode
enum class EWalkMode : uint8 {
	Idle = 0,
	Run = 1,
	Sprint = 2,
	CrouchIdle = 3,
	CrouchRun = 4,
	CrouchSprint = 5,
	Crawl = 6,
	EWalkMode_MAX = 7
};

// Enum Solarland.EAirMoveMode
enum class EAirMoveMode : uint8 {
	None = 0,
	Jump = 1,
	JetFly = 2,
	Cruise = 3,
	Skydive = 4,
	Launch = 5,
	Fall = 6,
	Fly = 7,
	WallRun = 8,
	SkywardFly = 9,
	ZipLine = 10,
	EAirMoveMode_MAX = 11
};

// Enum Solarland.EClientMoveTrustType
enum class EClientMoveTrustType : uint8 {
	TrustLocation = 0,
	TrustLocationAndMovementMode = 1,
	EClientMoveTrustType_MAX = 2
};

// Enum Solarland.EItemModifyResult
enum class EItemModifyResult : uint8 {
	Succeed = 0,
	Overflow = 1,
	Deficient = 2,
	IllegalParam = 3,
	Error = 4,
	EItemModifyResult_MAX = 5
};

// Enum Solarland.EEnergyUsage
enum class EEnergyUsage : uint8 {
	Box = 0,
	Weapon = 1,
	Ability = 2,
	Jet = 3,
	Pile = 4,
	Armor = 5,
	Shield = 6,
	Sky = 7,
	RadarStation = 8,
	ElectricShop = 9,
	DeathBox = 10,
	EEnergyUsage_MAX = 11
};

// Enum Solarland.EItemAppearanceType
enum class EItemAppearanceType : uint8 {
	EApprenace_None = 0,
	EApprenace_Outline = 1,
	EApprenace_Float = 2,
	EApprenace_All = 3,
	EApprenace_MAX = 4
};

// Enum Solarland.EItemType
enum class EItemType : int32 {
	NONE = 0,
	SHIELD = 101,
	ARMOR = 102,
	BULLET = 103,
	CARIRIDGE_BAG = 104,
	ARMOR_MATERIAL = 105,
	ENERGY_MODULE = 106,
	EXTRA_ENERGY = 107,
	RADAR_OPERATOR = 108,
	BACKPACK_ENERGY = 109,
	BACKUP_ENERGY = 110,
	SHIELD_RECHARGER = 112,
	BACKPACK_ITEM = 113,
	WEAPON_PARTS = 114,
	JETPACK_MODULE_HORIZONTAL = 111,
	JETPACK_MODULE_VERTICAL = 115,
	REVIVE_ITEM = 116,
	TREASUREBOX = 120,
	AIRDROPBOX = 121,
	DEATHBOX = 122,
	NEUTRAL_CARD = 130,
	COLLECTION_ITEM = 131,
	SHIELD_UPGRADE_MATERIAL = 148,
	EXP_ITEM = 149,
	WEAPON = 151,
	WEAPON_SKIN = 171,
	BACKPACK = 201,
	TAILFLAME = 202,
	CARDPOSE = 203,
	CARDBACKGROUND = 204,
	CAPSULE = 251,
	CHAR_SKIN_MIN = 301,
	CHAR_ANIMATION_MVP = 302,
	CHAR_SKIN_MAX = 350,
	CHARACTER = 351,
	EXPERIENCE = 401,
	GIFTBAG = 404,
	CHARACTER_TRIALCARD = 405,
	CHARACTERSKIN_TRIALCARD = 406,
	ACTIVENESS = 411,
	WEAPONSKIN_TRIALCARD = 412,
	GIFTBAG_ONBACKPACK = 414,
	BACKPACK_TRIALCARD = 415,
	TAILFLAME_TRIALCARD = 416,
	DIAMOND_VOUCHER = 417,
	LOTCOIN = 421,
	ZOMBORG = 422,
	WISHCOIN = 423,
	SURPRISECOIN = 424,
	TOKEN = 430,
	BUSINESSCARDFRAME = 432,
	AVATARFRAME = 434,
	CHARACTER_SHARD = 435,
	CHARACTER_SKIN_SHARD = 436,
	WEAPON_SKIN_SHARD = 437,
	BACKPACK_SHARD = 438,
	TAILFLAME_SHARD = 439,
	CAPSULE_SHARD = 440,
	VEHICLE_SKIN_SHARD = 441,
	ACCOUNT_AVATAR = 443,
	EMOTE = 444,
	SIGNIN_CARD = 447,
	RAFFLE_TICKET = 448,
	HOMEBUILD = 501,
	HOMEINSTALLATION = 502,
	HOMEITEM = 503,
	HOMEDRAWING = 504,
	HOMEPART = 505,
	HOMEDEVICE = 506,
	HOMEMAX = 520,
	VEHICLE_SKIN = 701,
	SUPPLYBOX = 801,
	DISPLAY_ITEM = 999,
	EItemType_MAX = 1000
};

// Enum Solarland.EWeaponSlotType
enum class EWeaponSlotType : int32 {
	EWeaponSlotType_UnArm = -1,
	EWeaponSlotType_Primary = 0,
	EWeaponSlotType_Secondary = 1,
	EWeaponSlotType_Tertiary = 2,
	EWeaponSlotType_MAX = 3
};

// Enum Solarland.EGmType
enum class EGmType : uint8 {
	Fetch = 0,
	Discard = 1,
	ClearBackPack = 2,
	Use = 3,
	RemoveWeapon = 4,
	EGmType_MAX = 5
};

// Enum Solarland.EEnergyState
enum class EEnergyState : uint8 {
	NORMAL = 0,
	SKY = 1,
	PILE = 2,
	BOX = 4,
	E2M = 8,
	M2E = 16,
	EEnergyState_MAX = 17
};

// Enum Solarland.ESocialActionType
enum class ESocialActionType : uint8 {
	None = 0,
	Like = 1,
	Unlike = 2,
	Gift = 3,
	SendTask = 4,
	IncreaseTaskLevel = 5,
	FinishTask = 6,
	ESocialActionType_MAX = 7
};

// Enum Solarland.EVehicleWeaponScopeType
enum class EVehicleWeaponScopeType : uint8 {
	None = 0,
	Magnifier_X2 = 1,
	Magnifier_X4 = 2,
	Magnifier_X8 = 3,
	Max = 4
};

// Enum Solarland.EInteractiveTaskType
enum class EInteractiveTaskType : uint8 {
	None = 0,
	KillWithWeaponType = 1,
	KillWithAnyVehicle = 2,
	KillByFist = 3,
	OpenAirdrop = 4,
	EInteractiveTaskType_MAX = 5
};

// Enum Solarland.ESocialCurrencyType
enum class ESocialCurrencyType : uint8 {
	None = 0,
	Gold = 1,
	Diamond = 2,
	ESocialCurrencyType_MAX = 3
};

// Enum Solarland.EFindSpectateTargetType
enum class EFindSpectateTargetType : uint8 {
	Teammate = 0,
	PlayerKiller = 1,
	AIKiller = 2,
	AllNonBot = 3,
	All = 4,
	EFindSpectateTargetType_MAX = 5
};

// Enum Solarland.ESpectatePhase
enum class ESpectatePhase : uint8 {
	NotSpectate = 0,
	LookAtSelfDeathBox = 1,
	SpectateTeammates = 2,
	BlockWhenAllTeammatesDead = 3,
	SpectateAllPlayers = 4,
	ESpectatePhase_MAX = 5
};

// Enum Solarland.ESolarTablesEnum_BattleUpgradeEffectType
enum class ESolarTablesEnum_BattleUpgradeEffectType : uint8 {
	MaxHp = 0,
	BulletDamage = 1,
	CharacterSkillDamage = 2,
	VehicleWeaponDamage = 3,
	VehicleSkillDamage = 4,
	VehicleStrikeDamage = 5,
	CharacterPunchDamage = 6,
	CharacterUpgradeDamage = 7,
	_Count = 8,
	ESolarTablesEnum_MAX = 9
};

// Enum Solarland.EPlayerStateRepType
enum class EPlayerStateRepType : uint8 {
	Character = 0,
	Controller = 1,
	EPlayerStateRepType_MAX = 2
};

// Enum Solarland.EPlayerChangedGoldResult
enum class EPlayerChangedGoldResult : uint8 {
	None = 0,
	Success = 1,
	GoldIsNotEnough = 2,
	NetworkError = 3,
	EPlayerChangedGoldResult_MAX = 4
};

// Enum Solarland.EPlayerChangedGoldType
enum class EPlayerChangedGoldType : uint8 {
	None = 0,
	CostedGold = 1,
	ReceivedGold = 2,
	EPlayerChangedGoldType_MAX = 3
};

// Enum Solarland.EExpBehaviorType
enum class EExpBehaviorType : uint8 {
	None = 0,
	Kill = 1,
	Assist = 2,
	Damage = 3,
	Pickup = 4,
	Survival = 5,
	Spawner = 6,
	Device = 7,
	TreasureBox = 8,
	DeathBox = 9,
	Airdrop = 10,
	PureDrop = 11,
	EExpBehaviorType_MAX = 12
};

// Enum Solarland.ECharacterStateInGame
enum class ECharacterStateInGame : uint8 {
	None = 0,
	InVehicle = 1,
	Dying = 2,
	Dead = 4,
	MaxState = 7,
	ECharacterStateInGame_MAX = 8
};

// Enum Solarland.EPlayerStateInGame
enum class EPlayerStateInGame : uint8 {
	None = 0,
	AppHasDeactivated = 1,
	AppHasReactivated = 2,
	Talking = 4,
	MaxState = 7,
	EPlayerStateInGame_MAX = 8
};

// Enum Solarland.EPassiveTriggeredVoice
enum class EPassiveTriggeredVoice : int32 {
	NOVOICE = 0,
	Personality = 1,
	TakeIt = 1002,
	Alright = 1003,
	GotIt = 1004,
	MarkLocation = 1005,
	AirdropsDelivering = 4001,
	AirdropsDelivered = 4002,
	Remaining3EnemySuqads = 4003,
	Remaining2EnemySuqads = 4004,
	Remaining1EnemySuqads = 4005,
	SafeZoneRetract30s = 4006,
	ResurrectionPeriodEnded = 4007,
	WelcomeToFarlight84 = 4008,
	AirdropsArriveIn60 = 4009,
	AirdropsArriveIn45 = 4010,
	AirdropsArriveIn30 = 4011,
	CharAppear = 5000,
	UsingMedicine = 5001,
	AddingShield = 5002,
	Reloading = 5003,
	HelpingTeammate = 5004,
	HitEnemy = 5005,
	KillEnemy = 5006,
	DestroyOtherTeam = 5007,
	ReviveTeammate = 5008,
	TakeDamage = 5009,
	Defeated = 5010,
	GetKilled = 5011,
	TeammataDefeated = 5012,
	TooFarApart = 5013,
	Charging50 = 5014,
	ChargingFinish = 5015,
	BecomeKillLeader = 5016,
	BackInTheFight = 5017,
	ParachuteFollowMe = 5018,
	ParachuteStartJump = 5019,
	NeedWeapons = 2009,
	NeedVehicle = 2010,
	NeedMuzzle = 3001,
	NeedGrip = 3002,
	NeedMagazine = 3003,
	NeedStock = 3004,
	NeedScope = 3005,
	NeedShield = 3006,
	NeedBatteryPack = 3007,
	NeedHorizontalCooldown = 3008,
	NeedVerticalCooldown = 3009,
	NeedSMGAmmo = 3010,
	NeedShutGunAmmo = 3011,
	NeedRifleAmmo = 3012,
	NeedSniperAmmo = 3013,
	NeedMedKit = 3014,
	NeedShieldRestorer = 3015,
	NeedSpecialWeapon = 3016,
	NeedRespawnPod = 3017,
	NeedBigShield = 3018,
	UseSuperSkill = 5021,
	Level1 = 2301,
	Level2 = 2303,
	Level3 = 2303,
	Level4 = 2304,
	Level5 = 2305,
	RemindTeammateRevive = 2006,
	EPassiveTriggeredVoice_MAX = 5022
};

// Enum Solarland.EPlayerNetStateInGame
enum class EPlayerNetStateInGame : uint8 {
	None = 0,
	Online = 1,
	Offline = 2,
	EPlayerNetStateInGame_MAX = 3
};

// Enum Solarland.ETeamType
enum class ETeamType : uint8 {
	PlayerTeam = 0,
	AITeam = 1,
	OnlyPlayerTeam = 2,
	EmptyTeam = 3,
	AnyTeam = 4,
	ETeamType_MAX = 5
};

// Enum Solarland.ETalentState
enum class ETalentState : uint8 {
	Activating = 0,
	CoolingDown = 1,
	Unactivated = 2,
	Invalid = 3,
	ETalentState_MAX = 4
};

// Enum Solarland.EInteractableType
enum class EInteractableType : uint8 {
	FIRECIRCLE = 0,
	JUMPPAD = 1,
	VEHICLEPAD = 2,
	RADARSTATION = 3,
	ELECTRICSHOP = 4,
	CHARGINGPILE = 5,
	SHIELDUPGRADEITEM = 6,
	SHIELDCREATOR = 7,
	MAX = 8
};

// Enum Solarland.EWorldMarkType
enum class EWorldMarkType : uint8 {
	ITEM = 0,
	INVALID = 1,
	WARNING = 2,
	MINIMAP = 3,
	BIGMAP = 4,
	VEHICLE = 5,
	INTERACTABLEACTOR = 6,
	QUICKCHATWHEEL = 7,
	ATTACHED = 8,
	SUMMONACTOR = 9,
	MAX = 10
};

// Enum Solarland.EAppLifetimeState
enum class EAppLifetimeState : uint8 {
	NONE = 0,
	NORMAL = 1,
	Background = 2,
	Deactive = 3,
	Terminated = 4,
	EAppLifetimeState_MAX = 5
};

// Enum Solarland.ESkydivingState
enum class ESkydivingState : uint8 {
	NotStarted = 0,
	PreStart = 1,
	InProgress = 2,
	Completed = 3,
	ESkydivingState_MAX = 4
};

// Enum Solarland.ESCMPlayerOutPath
enum class ESCMPlayerOutPath : uint8 {
	None = 0,
	OutFromSettingUI = 1,
	OutBySelf = 2,
	KickOutByServer = 3,
	OBSwitchScene = 4,
	ESCMPlayerOutPath_MAX = 5
};

// Enum Solarland.ESCMPlayerPunishType
enum class ESCMPlayerPunishType : uint8 {
	None = 0,
	HangUp = 1,
	DropOut = 2,
	IsolationPool = 3,
	KillTeammate = 4,
	ESCMPlayerPunishType_MAX = 5
};

// Enum Solarland.EReplayCameraMode
enum class EReplayCameraMode : uint8 {
	None = 0,
	ThirdPersonMode = 1,
	LockMode = 2,
	FreeMode = 3,
	LookAtMode = 4,
	CircularMode = 5,
	FreeLookAtMode = 6,
	EReplayCameraMode_MAX = 7
};

// Enum Solarland.ESolarSummonDeathReason
enum class ESolarSummonDeathReason : uint8 {
	SelfTimeDecay = 0,
	SelfLifeDecay = 1,
	OtherDestroy = 2,
	ESolarSummonDeathReason_MAX = 3
};

// Enum Solarland.ESkydiveStage
enum class ESkydiveStage : uint8 {
	None = 0,
	Flying = 1,
	Landing = 2,
	ESkydiveStage_MAX = 3
};

// Enum Solarland.ESolarCharacterType
enum class ESolarCharacterType : uint8 {
	ESolarCharacterType_None = 0,
	ESolarCharacterType_Player = 1,
	ESolarCharacterType_Bot = 2,
	ESolarCharacterType_Monster = 3,
	ESolarCharacterType_MAX = 4
};

// Enum Solarland.ECharacterSoundOpt
enum class ECharacterSoundOpt : uint8 {
	None = 0,
	Shield_Hit_1P = 1,
	Shield_Hit_3P = 2,
	Shield_Broken_1P = 3,
	Shield_Broken_3P = 4,
	Vehicle_Speedboard_1P = 5,
	Body_Hit_With_Bullet_Common_1P = 6,
	Body_Hit_By_Bullet_Common_1P = 7,
	Body_Hit_With_Punch_Common_1P = 8,
	Body_Hit_By_Punch_Common_1P = 9,
	Headshot_1P = 10,
	Headshot_Kill_UI = 11,
	Shot_Down_UI = 12,
	Shot_Down_1P = 13,
	Shot_Down_3P = 14,
	Shot_Down_3P_Enemy = 15,
	Death_UI = 16,
	Death_1P = 17,
	Death_3P = 18,
	Airborne_Fall_Start_1P = 19,
	Water_Fall_1P = 20,
	Water_Fall_3P = 21,
	Water_Fall_3P_Enemy = 22,
	Squat_1P = 23,
	Squat_3P = 24,
	Squat_3P_Enemy = 25,
	Stop_Climb_1P = 26,
	Stop_Climb_3P = 27,
	Stop_Climb_3P_Enemy = 28,
	Loop_Knapsack_Solar_Percent_1P = 29,
	Stop_Knapsack_Solar_Percent_1P = 30,
	Knapsack_Solar_Charging_Done_1P = 31,
	Knapsack_Solar_On_1P = 32,
	Knapsack_Solar_Off_1P = 33,
	Sniper_B01_Skill_On_1P = 34,
	Sniper_B01_Skill_Off_1P = 35,
	B9A04_Skill_Loop_1P = 36,
	B9A04_Skill_Loop_3P = 37,
	B9A04_Skill_Loop_3P_Enemy = 38,
	B9A04_Skill_Loop_End_1P = 39,
	B9A04_Skill_Loop_End_3P = 40,
	B9A04_Skill_Loop_End_3P_Enemy = 41,
	Knapsack_Landing_1P = 42,
	Knapsack_Landing_3P = 43,
	Knapsack_Landing_3P_Enemy = 44,
	Knapsack_Fly_Water_1P = 45,
	Knapsack_Fly_Water_3P = 46,
	Knapsack_Fly_Water_3P_Enemy = 47,
	Play_Shield_OneSet_1P = 48,
	Play_Shield_OneSet_3P = 49,
	Play_Shield_OneSet_3P_Enemy = 50,
	Play_Shield_Charging_1P = 51,
	Play_Shield_Multi_Charging_1P = 52,
	Play_Shield_Charging_3P = 53,
	Play_Shield_Charging_3P_Enemy = 54,
	Play_Shield_Charged_1P = 55,
	Play_Shield_Charged_3P = 56,
	Play_Shield_Charged_3P_Enemy = 57,
	Play_Shield_Charge_To_Max_1P = 58,
	Play_Shield_Charge_To_Max_3P = 59,
	Play_Shield_Charge_To_Max_3P_Enemy = 60,
	Play_Shield_Charge_Break_1P = 61,
	Play_Shield_Charge_Break_3P = 62,
	Play_Shield_Charge_Break_3P_Enemy = 63,
	Play_Hit_By_EMP_1P = 64,
	Play_Hit_By_EMP_3P = 65,
	Play_Hit_By_EMP_3P_Enemy = 66,
	Stop_Hit_By_EMP_1P = 67,
	Stop_Hit_By_EMP_3P = 68,
	Stop_Hit_By_EMP_3P_Enemy = 69,
	Play_Monster_Appear = 70,
	Play_Monster_Die = 71,
	Play_Heal_Wrap_1P = 72,
	Play_Heal_Wrap_3P = 73,
	Play_Heal_Wrap_3P_Enemy = 74,
	Stop_Heal_Wrap_1P = 75,
	Stop_Heal_Wrap_3P = 76,
	Stop_Heal_Wrap_3P_Enemy = 77,
	Play_Heal_Wrap_Cancel_1P = 78,
	Play_Heal_Wrap_Cancel_3P = 79,
	Play_Heal_Wrap_Cancel_3P_Enemy = 80,
	Play_Heal_Wrap_Complete_1P = 81,
	Play_Heal_Wrap_Complete_3P = 82,
	Play_Heal_Wrap_Complete_3P_Enemy = 83,
	Stop_Shield_Charging_1P = 84,
	Stop_Shield_Charging_3P = 85,
	Stop_Shield_Charging_3P_Enemy = 86,
	Mark_Select_Dial_UI = 87,
	Mark_Select_Pin_UI = 88,
	Mark_Select_Cancel_UI = 89,
	Mark_Select_Common_UI = 90,
	Mark_Danger_UI = 91,
	Play_Skill_Fast_Reload = 92,
	Play_char_skill_passive_targetlock = 93,
	Max = 94
};

// Enum Solarland.ESCMDamageType
enum class ESCMDamageType : uint8 {
	Point = 0,
	Poison = 1,
	Bomb = 2,
	AirDrop = 3,
	Dying = 4,
	VehicleHit = 5,
	VehicleExplosion = 6,
	Weapon = 7,
	UnarmWeapon = 8,
	VehicleWeapon = 9,
	SummonWeapon = 10,
	VehicleAbility = 11,
	WeaponAbility = 12,
	HelplessDeathVerge = 13,
	DeathVergeInWater = 14,
	GMCmd = 15,
	BackToLobby = 16,
	AppEnterBackground = 17,
	LongTimeDisconnect = 18,
	ClassSkill = 19,
	TacticalSkill = 20,
	ESCMDamageType_MAX = 21
};

// Enum Solarland.EDamageResultType
enum class EDamageResultType : uint8 {
	Normal = 0,
	Down = 1,
	Die = 2,
	EDamageResultType_MAX = 3
};

// Enum Solarland.EHealthChangeType
enum class EHealthChangeType : uint8 {
	Normal = 0,
	Self = 1,
	Ability = 2,
	Ability_Deadly = 3,
	Item = 4,
	Teammate = 5,
	Environment = 6,
	EHealthChangeType_MAX = 7
};

// Enum Solarland.ESolarAttributeType
enum class ESolarAttributeType : uint8 {
	ESolarAttributeType_None = 0,
	ESolarAttributeType_BasePhysicalDamage = 1,
	ESolarAttributeType_BaseEnergyDamage = 2,
	ESolarAttributeType_Health = 3,
	ESolarAttributeType_DeadlyDamage = 4,
	ESolarAttributeType_Energy = 5,
	ESolarAttributeType_Shield = 6,
	ESolarAttributeType_Weapon = 7,
	ESolarAttributeType_Mark = 8,
	ESolarAttributeType_MaxHealth = 9,
	ESolarAttributeType_MaxItemPile = 10,
	ESolarAttributeType_MoveSpeed = 11,
	ESolarAttributeType_ShieldRechargeCost = 12,
	ESolarAttributeType_Max = 13
};

// Enum Solarland.EShieldUpgradeInteractAckType
enum class EShieldUpgradeInteractAckType : uint8 {
	Success = 0,
	ItemReachLimit = 1,
	AlreadyInteracted = 2,
	SuccessWithReconnect = 3,
	EShieldUpgradeInteractAckType_MAX = 4
};

// Enum Solarland.EShieldCancelRechargeReason
enum class EShieldCancelRechargeReason : uint8 {
	None = 0,
	StopAutoRecharge = 1,
	EShieldCancelRechargeReason_MAX = 2
};

// Enum Solarland.ESolarHitType
enum class ESolarHitType : uint8 {
	None = 0,
	Character_Hit = 1,
	Character_Kill = 2,
	Character_BreakArmor = 3,
	Character_BreakShield = 4,
	Character_PendingKill = 5,
	Character_Headshot = 6,
	Character_HitShield = 7,
	Character_HitArmor = 8,
	Character_HitDown = 9,
	Character_HeadshotKill = 10,
	Vehicle_Hit = 51,
	Vehicle_HitWeakness = 52,
	ESolarHitType_MAX = 53
};

// Enum Solarland.EPlayerWeaponMsgType
enum class EPlayerWeaponMsgType : uint8 {
	EPlayerWeaponMsgType_HitPawn = 0,
	EPlayerWeaponMsgType_PlayerAssist = 1,
	EPlayerWeaponMsgType_NpcAssist = 2,
	EPlayerWeaponMsgType_SafeAreaUpdate = 3,
	EPlayerWeaponMsgType_ForbidShooting = 4,
	EPlayerWeaponMsgType_AddExp = 5,
	EPlayerWeaponMsgType_Max = 6
};

// Enum Solarland.EShieldRechargeState
enum class EShieldRechargeState : uint8 {
	AutoRecharge = 0,
	ManualRecharge = 1,
	None = 2,
	EShieldRechargeState_MAX = 3
};

// Enum Solarland.ECharacterOperation
enum class ECharacterOperation : uint8 {
	ECharacterOperation_None = 0,
	ECharacterOperation_OpenScope = 1,
	ECharacterOperation_CloseScope = 2,
	ECharacterOperation_OpenScopeInstant = 3,
	ECharacterOperation_MAX = 4
};

// Enum Solarland.EItemChangeType
enum class EItemChangeType : uint8 {
	Default = 0,
	PickUp = 1,
	Drop = 2,
	EItemChangeType_MAX = 3
};

// Enum Solarland.ECustomJumpType
enum class ECustomJumpType : uint8 {
	None = 0,
	Jump = 1,
	Launch = 2,
	ECustomJumpType_MAX = 3
};

// Enum Solarland.EDriveState
enum class EDriveState : uint8 {
	None = 0,
	Driver = 1,
	Passenger = 2,
	EDriveState_MAX = 3
};

// Enum Solarland.ERoleSkillStatus
enum class ERoleSkillStatus : uint8 {
	Normal = 0,
	WaitTriggerAgain = 1,
	Disable = 2,
	InCD = 3,
	Forbidden = 4,
	ERoleSkillStatus_MAX = 5
};

// Enum Solarland.ESpecAnimInstType
enum class ESpecAnimInstType : uint8 {
	Base = 0,
	Vehicle = 1,
	OneHandThrow = 2,
	KeepFiring = 3,
	Gatling = 4,
	CardsThrow = 5,
	DuckRolling = 6,
	InvisibleZone = 7,
	ESpecAnimInstType_MAX = 8
};

// Enum Solarland.EWeaponPartType
enum class EWeaponPartType : uint8 {
	Muzzle = 0,
	Scope = 1,
	Clip = 2,
	Rune = 3,
	Grip = 4,
	GunStock = 5,
	Scope2x = 6,
	Scope4x = 7,
	Scope8x = 8,
	MAX = 9
};

// Enum Solarland.EVelocityStatus
enum class EVelocityStatus : uint8 {
	Any = 0,
	Stationary = 1,
	Moving = 2,
	EVelocityStatus_MAX = 3
};

// Enum Solarland.EWeaponType
enum class EWeaponType : uint8 {
	AssualtRifle = 0,
	Submachinegun = 1,
	Shotgun = 2,
	Sniper = 3,
	VehicleMounted = 4,
	ItemWeapon = 5,
	SummonWeapon = 6,
	AntiVehicle = 7,
	Unarm = 8,
	Unknown = 9,
	EWeaponType_MAX = 10
};

// Enum Solarland.EShieldWidgetState
enum class EShieldWidgetState : uint8 {
	None = 0,
	PreAdd = 1,
	DoAdd = 2,
	CancelAdd = 3,
	DoSub = 4,
	EShieldWidgetState_MAX = 5
};

// Enum Solarland.EEnterBattleType
enum class EEnterBattleType : uint8 {
	OnHit = 0,
	OnWeaponFire = 1,
	NotEnter = 2,
	EEnterBattleType_MAX = 3
};

// Enum Solarland.EJetFlyType
enum class EJetFlyType : uint8 {
	None = 0,
	VerticalJetFly = 1,
	HorizontalJetFly = 2,
	CustomJetFly = 3,
	EJetFlyType_MAX = 4
};

// Enum Solarland.EShieldState
enum class EShieldState : uint8 {
	NONE = 0,
	SPAWN = 1,
	NORMAL = 2,
	RECHARGE = 3,
	BREAK = 4,
	PILE = 5,
	MAX = 6
};

// Enum Solarland.EHitSoundTargetType
enum class EHitSoundTargetType : uint8 {
	Default = 0,
	CharacterBody = 1,
	CharacterHead = 2,
	CharacterShieldBody = 3,
	CharacterShieldHead = 4,
	CharacterHitDown = 5,
	CharacterKill = 6,
	CharacterKill2 = 7,
	Vehicle = 8,
	VehicleWeakPoint = 9,
	SummonItemSolid = 10,
	SummonItemVirtual = 11,
	EHitSoundTargetType_MAX = 12
};

// Enum Solarland.EHitSoundSourceType
enum class EHitSoundSourceType : uint8 {
	Default = 0,
	Weapon = 1,
	Melee = 2,
	Skill = 3,
	VehicleWeapon = 4,
	VehicleSkill = 5,
	VehicleHit = 6,
	Poison = 7,
	AirDrop = 8,
	Bomb = 9,
	EHitSoundSourceType_MAX = 10
};

// Enum Solarland.ESingleCruiseState
enum class ESingleCruiseState : uint8 {
	NONE = 0,
	Fly = 1,
	Parachute = 2,
	ESingleCruiseState_MAX = 3
};

// Enum Solarland.ESolarTreatmentState
enum class ESolarTreatmentState : uint8 {
	None = 0,
	Treating = 1,
	End = 2,
	ESolarTreatmentState_MAX = 3
};

// Enum Solarland.EShieldSoundType
enum class EShieldSoundType : uint8 {
	StartRecharge = 0,
	Charging = 1,
	Charged = 2,
	ChargedToMax = 3,
	ChargeBreak = 4,
	ShieldHitted = 5,
	ShieldBroken = 6,
	StopRecharge = 7,
	MultiCharging = 8,
	EShieldSoundType_MAX = 9
};

// Enum Solarland.EShieldSoundEventType
enum class EShieldSoundEventType : uint8 {
	Type_1P = 0,
	Type_3P = 1,
	Type_3P_Enemy = 2,
	Type_MAX = 3
};

// Enum Solarland.EIdleTurnType
enum class EIdleTurnType : uint8 {
	Turn_Idle = 0,
	Turn_Left = 1,
	Turn_Right = 2,
	Turn_MAX = 3
};

// Enum Solarland.ETreasureBoxState
enum class ETreasureBoxState : uint8 {
	None = 0,
	Close = 1,
	Open = 2,
	ETreasureBoxState_MAX = 3
};

// Enum Solarland.EWallRunState
enum class EWallRunState : uint8 {
	WallRunning = 0,
	Success = 1,
	EWallRunState_MAX = 2
};

// Enum Solarland.ESkillAnimRightHandType
enum class ESkillAnimRightHandType : uint8 {
	Default = 0,
	Card = 1,
	ESkillAnimRightHandType_MAX = 2
};

// Enum Solarland.ESkillAnimType
enum class ESkillAnimType : uint8 {
	None = 0,
	SkillWithoutAnim = 1,
	OneHandThrow = 2,
	DoubleHandsThrow = 3,
	KeepFiring = 4,
	Gatling = 5,
	CardsThrow = 6,
	DuckRolling = 7,
	InvisibleZone = 8,
	ESkillAnimType_MAX = 9
};

// Enum Solarland.EBGMInBattle
enum class EBGMInBattle : uint8 {
	None = 0,
	Curise = 1,
	Skydiving = 2,
	Land = 3,
	End = 4,
	EBGMInBattle_MAX = 5
};

// Enum Solarland.ECruiseState
enum class ECruiseState : uint8 {
	None = 0,
	Boarded = 1,
	CruisePendingStarted = 2,
	CruiseStarted = 3,
	ParachuteAllowed = 4,
	ParachutePendingStarted = 5,
	ParachuteStarted = 6,
	End = 7,
	Max = 8
};

// Enum Solarland.ERescueState
enum class ERescueState : uint8 {
	EState_None = 0,
	EState_Dying = 1,
	EState_Rescuing = 2,
	EState_BeingRescue = 3,
	EState_MAX = 4
};

// Enum Solarland.EBackpackPropellingMode
enum class EBackpackPropellingMode : uint8 {
	Default = 0,
	Skydive = 1,
	EBackpackPropellingMode_MAX = 2
};

// Enum Solarland.EFXJetType
enum class EFXJetType : uint8 {
	JetDefault = 0,
	JetSingle = 1,
	JetLoop = 2,
	VerticalLaunch = 3,
	WallRun = 4,
	EFXJetType_MAX = 5
};

// Enum Solarland.ECharacterBodyScaleType
enum class ECharacterBodyScaleType : uint8 {
	None = 0,
	Woman = 1,
	Man = 2,
	DuckMan = 3,
	SmallWoman = 4,
	ECharacterBodyScaleType_MAX = 5
};

// Enum Solarland.EVehicleClass
enum class EVehicleClass : uint8 {
	All = 0,
	Wheeled = 1,
	Legged = 2,
	Hover = 3,
	EVehicleClass_MAX = 4
};

// Enum Solarland.EWeaponUIType
enum class EWeaponUIType : uint8 {
	All = 0,
	AssualtRifle = 1,
	Submachinegun = 2,
	Shotgun = 3,
	Sniper = 4,
	Others = 5,
	EWeaponUIType_MAX = 6
};

// Enum Solarland.ECustomParamValueType
enum class ECustomParamValueType : uint8 {
	None = 0,
	Bool = 1,
	Int = 2,
	Float = 3,
	Percent = 4,
	Enum_S = 5,
	Enum_M = 6,
	AvailableWeapons = 7,
	AvailableVehicles = 8,
	ECustomParamValueType_MAX = 9
};

// Enum Solarland.ERemovedReasonType
enum class ERemovedReasonType : uint8 {
	None = 0,
	TimeOut = 1,
	Abandoned = 2,
	OwnerKick = 3,
	NotEnough = 4,
	ServerKick = 5,
	ERemovedReasonType_MAX = 6
};

// Enum Solarland.ESolarSupportLanguages
enum class ESolarSupportLanguages : uint8 {
	DefaultLanguage = 0,
	SimplifiedChinese = 1,
	TraditionalChinese = 2,
	Arabic = 3,
	German = 4,
	English = 5,
	Spanish = 6,
	French = 7,
	Hindi = 8,
	Indonesian = 9,
	Italian = 10,
	Japanese = 11,
	Korean = 12,
	Malay = 13,
	Polish = 14,
	Portuguese = 15,
	Russian = 16,
	Thai = 17,
	Turkish = 18,
	Vietnamese = 19,
	Tagalog = 20,
	PO = 253,
	OP = 254,
	ESolarSupportLanguages_MAX = 255
};

// Enum Solarland.EReplayActivityHeatKillUseType
enum class EReplayActivityHeatKillUseType : uint8 {
	None = 0,
	Weapon = 1,
	Vehicle = 2,
	Skill = 3,
	EReplayActivityHeatKillUseType_MAX = 4
};

// Enum Solarland.EPlayerActivityHeatType
enum class EPlayerActivityHeatType : uint8 {
	None = 0,
	Parachute = 1,
	ResurrectionParachute = 2,
	KillDown = 3,
	MultiKill = 4,
	BeKillDown = 5,
	Death = 6,
	Win = 7,
	Max = 8
};

// Enum Solarland.EShotMomentFlag
enum class EShotMomentFlag : uint8 {
	shotting = 0,
	hit = 1,
	killed = 2,
	invalid = 3,
	EShotMomentFlag_MAX = 4
};

// Enum Solarland.EShotModeFlag
enum class EShotModeFlag : uint8 {
	orgin = 0,
	d3d = 1,
	dwm = 2,
	rand = 3,
	EShotModeFlag_MAX = 4
};

// Enum Solarland.ESolarInputMode
enum class ESolarInputMode : uint8 {
	GameOnly = 0,
	GameAndUI = 1,
	UIOnly = 2,
	ESolarInputMode_MAX = 3
};

// Enum Solarland.EInputSwitchType
enum class EInputSwitchType : uint8 {
	ActionBinding = 0,
	ActionRemove = 1,
	AxisBinding = 2,
	AxisRemove = 3,
	EInputSwitchType_MAX = 4
};

// Enum Solarland.ESolarIgnoreCollisionType
enum class ESolarIgnoreCollisionType : uint8 {
	EnergyShield = 0,
	SummonItemCore = 1,
	SummonItem = 2,
	Character = 3,
	Vehicle = 4,
	UAV = 5,
	Water = 6,
	ESolarIgnoreCollisionType_MAX = 7
};

// Enum Solarland.EAlertDirection
enum class EAlertDirection : uint8 {
	Forward = 0,
	Backward = 1,
	Left = 2,
	Right = 3,
	EAlertDirection_MAX = 4
};

// Enum Solarland.ECustomNoticeColor
enum class ECustomNoticeColor : uint8 {
	None = 0,
	Red = 1,
	Green = 2,
	Blue = 3,
	Yellow = 4,
	ECustomNoticeColor_MAX = 5
};

// Enum Solarland.ECustomNoticeType
enum class ECustomNoticeType : uint8 {
	SmallNotice = 0,
	MediumNotice = 1,
	BigNotice = 2,
	KillEffectNotice = 3,
	GlobalKillNotice = 4,
	LocalKillNotice = 5,
	PickUpNotice = 6,
	WeaponExpNotice = 7,
	EquipReplaceNotice = 8,
	TaskNotice = 9,
	ECustomNoticeType_MAX = 10
};

// Enum Solarland.EResurrectionState
enum class EResurrectionState : uint8 {
	Alive = 0,
	WaitingTeammatesHelp = 1,
	TimeOut = 2,
	AllTeammatesDied = 3,
	LeaveBattle = 4,
	EResurrectionState_MAX = 5
};

// Enum Solarland.ESCMDataType
enum class ESCMDataType : uint8 {
	None = 0,
	Byte = 1,
	Int = 2,
	Float = 3,
	Bool = 4,
	FVector = 5,
	FString = 6,
	ESCMDataType_MAX = 7
};

// Enum Solarland.ETaskPage
enum class ETaskPage : uint8 {
	TPNone = 0,
	TPDaily = 1,
	TPGrow = 2,
	TPHomeDaily = 3,
	TPSeason = 4,
	TPPassDaily = 5,
	TPPassWelfare = 6,
	TPPassWeek = 7,
	TPMonthlyDaily = 8,
	TPMonthlyWeek = 9,
	TPHalMonth = 10,
	TPWeekChallenge = 11,
	TPShareCodeDaily = 12,
	TPShareCodePersonal = 13,
	TPShareCodeFriend = 14,
	TPCollectRedeem = 15,
	ETaskPage_MAX = 16
};

// Enum Solarland.ESCMPlayerGameRole
enum class ESCMPlayerGameRole : uint8 {
	StandBy = 0,
	OBPlayer = 1,
	Player = 2,
	Spectator = 3,
	ESCMPlayerGameRole_MAX = 4
};

// Enum Solarland.ESCMPlayerType
enum class ESCMPlayerType : uint8 {
	None = 0,
	Player = 1,
	BotAI = 2,
	Monster = 3,
	ESCMPlayerType_MAX = 4
};

// Enum Solarland.ESCMPlayerOutType
enum class ESCMPlayerOutType : uint8 {
	None = 0,
	SelfLogout = 1,
	BattleEnd = 2,
	SelfEnd = 3,
	OfflineEnd = 4,
	Cheating = 5,
	Abnormal = 6,
	ESCMPlayerOutType_MAX = 7
};

// Enum Solarland.ESCMPlayerState
enum class ESCMPlayerState : uint8 {
	None = 0,
	PreLogin = 1,
	NotJoin = 2,
	InBattle = 4,
	Suspend = 8,
	BattleEnd = 16,
	ESCMPlayerState_MAX = 17
};

// Enum Solarland.EPersonalScoreType
enum class EPersonalScoreType : uint8 {
	None = 0,
	Kill = 1,
	Assist = 2,
	OccupyingPerSec = 3,
	Capture = 4,
	Release = 5,
	EPersonalScoreType_MAX = 6
};

// Enum Solarland.EBattlegroundPlayerStatus
enum class EBattlegroundPlayerStatus : uint8 {
	WaitForBattle = 0,
	Battle = 1,
	WaitForRebirth = 2,
	Deploying = 3,
	EBattlegroundPlayerStatus_MAX = 4
};

// Enum Solarland.EDeploymentType
enum class EDeploymentType : uint8 {
	None = 0,
	BlueHome = 1,
	RedHome = 2,
	A = 3,
	B = 4,
	C = 5,
	D = 6,
	EDeploymentType_MAX = 7
};

// Enum Solarland.EMatchResult
enum class EMatchResult : uint8 {
	None = 0,
	Victory = 1,
	Fail = 2,
	Draw = 3,
	EMatchResult_MAX = 4
};

// Enum Solarland.EFactionType
enum class EFactionType : uint8 {
	Neutral = 0,
	Blue = 1,
	Red = 2,
	EFactionType_MAX = 3
};

// Enum Solarland.EBasicSettingBool
enum class EBasicSettingBool : uint8 {
	NotInit = 0,
	Off = 1,
	On = 2,
	EBasicSettingBool_MAX = 3
};

// Enum Solarland.ESolarDamageTextDisplayModeType
enum class ESolarDamageTextDisplayModeType : uint8 {
	DamageTextDisplayMode_Off = 0,
	DamageTextDisplayMode_Stacked = 1,
	DamageTextDisplayMode_Floating = 2,
	DamageTextDisplayMode_Combined = 3,
	DamageTextDisplayMode_MAX = 4
};

// Enum Solarland.ESolarGyroscopeChooseType
enum class ESolarGyroscopeChooseType : uint8 {
	DefaultGyroscope = 0,
	ALWAYS = 1,
	FOCUS = 2,
	NEVER = 3,
	ESolarGyroscopeChooseType_MAX = 4
};

// Enum Solarland.ESolarChatOperatorType
enum class ESolarChatOperatorType : uint8 {
	All = 0,
	Team = 1,
	Off = 2,
	ESolarChatOperatorType_MAX = 3
};

// Enum Solarland.EWheeledVehicleDriveUserType
enum class EWheeledVehicleDriveUserType : uint8 {
	DirectionalInput = 0,
	SteeringInput = 1,
	JoyStickInput = 2,
	EWheeledVehicleDriveUserType_MAX = 3
};

// Enum Solarland.ESolarGraphicsQualityLevel
enum class ESolarGraphicsQualityLevel : uint8 {
	ESGQL_Invalid = 0,
	ESGQL_Level1 = 1,
	ESGQL_Level2 = 2,
	ESGQL_Level3 = 3,
	ESGQL_Level4 = 4,
	ESGQL_Level5 = 5,
	ESGQL_Level6 = 6,
	ESGQL_Level7 = 7,
	ESGQL_VALUE_MIN = 1,
	ESGQL_VALUE_MAX = 7,
	ESGQL_MAX = 8
};

// Enum Solarland.ESolarColorTheme
enum class ESolarColorTheme : uint8 {
	ESCT_Default = 0,
	ESCT_Bright = 1,
	ESCT_Soft = 2,
	ESCT_Cold = 3,
	ESCT_MAX = 4
};

// Enum Solarland.ESolarContentScaleFactorLevel
enum class ESolarContentScaleFactorLevel : uint8 {
	ESCSFL_NONE = 0,
	ESCSFL_Low = 1,
	ESCSFL_Mid = 2,
	ESCSFL_High = 3,
	ESCSFL_HighEnd = 4,
	ESCSFL_MAX = 5
};

// Enum Solarland.ESolarFrameRateLevel
enum class ESolarFrameRateLevel : uint8 {
	ESFRL_NONE = 0,
	ESFRL_Low = 1,
	ESFRL_Mid = 2,
	ESFRL_High = 3,
	ESFRL_HighEnd = 4,
	ESFRL_EXTREME = 5,
	ESFRL_MAX = 6
};

// Enum Solarland.ESolarTouchAccMode
enum class ESolarTouchAccMode : uint8 {
	Velocity = 0,
	Constant = 1,
	Distance = 2,
	ESolarTouchAccMode_MAX = 3
};

// Enum Solarland.ESolarShakeMainType
enum class ESolarShakeMainType : uint8 {
	OFF = 0,
	LOW = 1,
	MEDIUM = 2,
	HIGH = 3,
	ESolarShakeMainType_MAX = 4
};

// Enum Solarland.ESolarAudioMode
enum class ESolarAudioMode : uint8 {
	PushToTalk = 0,
	FreeToTalk = 1,
	ESolarAudioMode_MAX = 2
};

// Enum Solarland.ESolarSoundQuality
enum class ESolarSoundQuality : uint8 {
	NotInit = 0,
	Low = 1,
	High = 2,
	Ultra = 3,
	ESolarSoundQuality_MAX = 4
};

// Enum Solarland.ESolarWeaponDoScopeMode
enum class ESolarWeaponDoScopeMode : uint8 {
	Click = 0,
	Press = 1,
	Mixed = 2,
	ESolarWeaponDoScopeMode_MAX = 3
};

// Enum Solarland.EConfigVersion
enum class EConfigVersion : uint8 {
	BeforeCustomVersionWasAdded = 0,
	FixedCanAutoSteering = 1,
	FixedDefaultFOV = 2,
	VersionPlusOne = 3,
	LatestVersion = 2,
	EConfigVersion_MAX = 4
};

// Enum Solarland.ESolarColorBlindMode
enum class ESolarColorBlindMode : uint8 {
	Default = 0,
	RedGreen = 1,
	RedBlue = 2,
	YellowGreen = 3,
	ESolarColorBlindMode_MAX = 4
};

// Enum Solarland.ESolarGraphicQuality
enum class ESolarGraphicQuality : uint8 {
	Default = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	ESolarGraphicQuality_MAX = 4
};

// Enum Solarland.ESolarRenderingResolutionScaleLevel
enum class ESolarRenderingResolutionScaleLevel : uint8 {
	Default = 0,
	Percent25 = 1,
	Percent50 = 2,
	Percent75 = 3,
	Percent100 = 4,
	Invalid = 255,
	ESolarRenderingResolutionScaleLevel_MAX = 256
};

// Enum Solarland.ESolarPostProcessingEffectsLevel
enum class ESolarPostProcessingEffectsLevel : uint8 {
	Default = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	ExtraHigh = 4,
	ESolarPostProcessingEffectsLevel_MAX = 5
};

// Enum Solarland.ESolarReflectionQualityLevel
enum class ESolarReflectionQualityLevel : uint8 {
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	ExtraHigh = 4,
	Invalid = 255,
	ESolarReflectionQualityLevel_MAX = 256
};

// Enum Solarland.ESolarSSGIQualityLevel
enum class ESolarSSGIQualityLevel : uint8 {
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	ExtraHigh = 4,
	Invalid = 255,
	ESolarSSGIQualityLevel_MAX = 256
};

// Enum Solarland.ESolarAmbientOcclusionQualityLevel
enum class ESolarAmbientOcclusionQualityLevel : uint8 {
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	Invalid = 255,
	ESolarAmbientOcclusionQualityLevel_MAX = 256
};

// Enum Solarland.ESolarPointLightShadowDetailsLevel
enum class ESolarPointLightShadowDetailsLevel : uint8 {
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	VeryHigh = 4,
	ExtraHigh = 5,
	ESolarPointLightShadowDetailsLevel_MAX = 6
};

// Enum Solarland.ESolarMaxCSMResolutionLevel
enum class ESolarMaxCSMResolutionLevel : uint8 {
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	Invalid = 255,
	ESolarMaxCSMResolutionLevel_MAX = 256
};

// Enum Solarland.ESolarSunlightShadowDetailLevel
enum class ESolarSunlightShadowDetailLevel : uint8 {
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	Invalid = 255,
	ESolarSunlightShadowDetailLevel_MAX = 256
};

// Enum Solarland.ESolarAnisotropicFilterLevel
enum class ESolarAnisotropicFilterLevel : uint8 {
	Default = 0,
	Level1X = 1,
	Level2X = 2,
	Level4X = 3,
	Level8X = 4,
	Level16X = 5,
	Invalid = 255,
	ESolarAnisotropicFilterLevel_MAX = 256
};

// Enum Solarland.ESolarAntiAliasingLevel
enum class ESolarAntiAliasingLevel : uint8 {
	Off = 0,
	FXAA = 1,
	TAA = 2,
	MSAA = 3,
	Invalid = 255,
	ESolarAntiAliasingLevel_MAX = 256
};

// Enum Solarland.ESolarMotionBlurLevel
enum class ESolarMotionBlurLevel : uint8 {
	Off = 0,
	Low = 1,
	Medium = 2,
	High = 3,
	Ultra = 4,
	Invalid = 255,
	ESolarMotionBlurLevel_MAX = 256
};

// Enum Solarland.ESolarRayTracingLevel
enum class ESolarRayTracingLevel : uint8 {
	Off = 0,
	HighPerformance = 1,
	HighQuality = 2,
	ESolarRayTracingLevel_MAX = 3
};

// Enum Solarland.ESolarNvdiaReflexLevel
enum class ESolarNvdiaReflexLevel : uint8 {
	Off = 0,
	On = 1,
	High = 2,
	ESolarNvdiaReflexLevel_MAX = 3
};

// Enum Solarland.ESolarGraphicsMode
enum class ESolarGraphicsMode : uint8 {
	Default = 0,
	HighPerformance = 1,
	HighQuality = 2,
	ESolarGraphicsMode_MAX = 3
};

// Enum Solarland.ESolarFPS
enum class ESolarFPS : uint8 {
	Default = 0,
	FPS30 = 1,
	FPS60 = 2,
	FPS90 = 3,
	FPS120 = 4,
	FPS144 = 5,
	FPS240 = 6,
	FPS360 = 7,
	FPS500 = 8,
	SameWithMonitor = 9,
	ESolarFPS_MAX = 10
};

// Enum Solarland.ESolarMonitor
enum class ESolarMonitor : uint8 {
	Default = 0,
	Monitor1 = 1,
	Monitor2 = 2,
	Monitor3 = 3,
	ESolarMonitor_MAX = 4
};

// Enum Solarland.ESolarResolution
enum class ESolarResolution : uint8 {
	Default = 0,
	Resolution1 = 1,
	Resolution2 = 2,
	Resolution3 = 3,
	Resolution4 = 4,
	Resolution5 = 5,
	ESolarResolution_MAX = 6
};

// Enum Solarland.ESolarWheelModeType
enum class ESolarWheelModeType : uint8 {
	Default = 0,
	Click = 1,
	Release = 2,
	ESolarWheelModeType_MAX = 3
};

// Enum Solarland.ESolarSprintModeType
enum class ESolarSprintModeType : uint8 {
	Default = 0,
	Pressing = 1,
	Toggle = 2,
	Auto = 3,
	ESolarSprintModeType_MAX = 4
};

// Enum Solarland.ESolarITemHUDStyle
enum class ESolarITemHUDStyle : uint8 {
	Spread = 0,
	Wheel = 1,
	ESolarITemHUDStyle_MAX = 2
};

// Enum Solarland.EFileDownloadError
enum class EFileDownloadError : uint8 {
	None = 0,
	ConnectFailed = 1,
	RequestHeadFailed = 2,
	CreateFileFailed = 3,
	DownloadFailed = 4,
	WriteFailed = 5,
	DeleteOldFailed = 6,
	MoveFailed = 7,
	EFileDownloadError_MAX = 8
};

// Enum Solarland.EDownloadFailedStep
enum class EDownloadFailedStep : uint8 {
	DownloadServerListFailed = 0,
	DownloadPakListFailed = 1,
	DownloadPakFileFailed = 2,
	MountPakFileFailed = 3,
	EDownloadFailedStep_MAX = 4
};

// Enum Solarland.EBuffEffectTagType
enum class EBuffEffectTagType : uint8 {
	None = 0,
	TopHalfPart = 1,
	BottomHalfPart = 2,
	TwoSidePart = 3,
	BorderPart = 4,
	FullPart = 5,
	EBuffEffectTagType_MAX = 6
};

// Enum Solarland.ESolarTablesEnum_InputTriggerType
enum class ESolarTablesEnum_InputTriggerType : uint8 {
	InputTriggerPressed = 0,
	InputTriggerTap = 1,
	InputTriggerDoubleTap = 2,
	InputTriggerHold = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Enum Solarland.ESolarTablesEnum_InputActionType
enum class ESolarTablesEnum_InputActionType : uint8 {
	Action = 0,
	Axis = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Enum Solarland.EPickupItemType
enum class EPickupItemType : uint8 {
	None = 0,
	Normal = 1,
	TreasureBox = 2,
	DeathBox = 3,
	HomeItem = 4,
	EPickupItemType_MAX = 5
};

// Enum Solarland.EJetFlyForbiddenType
enum class EJetFlyForbiddenType : uint8 {
	Water = 0,
	Climb = 1,
	EJetFlyForbiddenType_MAX = 2
};

// Enum Solarland.ECountDownState
enum class ECountDownState : uint8 {
	CD_Normal = 0,
	CD_Buff = 1,
	CD_MAX = 2
};

// Enum Solarland.EInputButton
enum class EInputButton : uint8 {
	EInputButton_None = 0,
	EInputButton_Jump = 1,
	EInputButton_RechargeShield = 2,
	EInputButton_BigRechargeShield = 3,
	EInputButton_Crouch = 4,
	EInputButton_JetVertical = 5,
	EInputButton_JetHorizontal = 6,
	EInputButton_Fire = 7,
	EInputButton_LeftFire = 8,
	EInputButton_AltFire = 9,
	EInputButton_QuickAds = 10,
	EInputButton_CancelAction = 11,
	EInputButton_FreeLook = 12,
	EInputButton_Interact = 13,
	EInputButton_InteractAlternative = 14,
	EInputButton_Reload = 15,
	EInputButton_TogglePrimaryWeapon = 16,
	EInputButton_ToggleSecondaryWeapon = 17,
	EInputButton_ToggleTertiaryWeapon = 18,
	EInputButton_TogglePrimaryWeapon_Checkbox = 19,
	EInputButton_ToggleSecondaryWeapon_Checkbox = 20,
	EInputButton_ToggleTertiaryWeapon_Checkbox = 21,
	EInputButton_ToggleGunsight = 22,
	EInputButton_Gunsight = 23,
	EInputButton_SprintFreeOnPC = 24,
	EInputButton_SprintFreeOnMobile = 25,
	EInputButton_SprintLock = 26,
	EInputButton_Equip1 = 27,
	EInputButton_Equip2 = 28,
	EInputButton_Map = 29,
	EInputButton_Eject = 30,
	EInputButton_OutVehicle = 31,
	EInputButton_Backpack = 32,
	EInputButton_UseMedicine = 33,
	EInputButton_UseRecommendItem = 34,
	EInputButton_Pickup = 35,
	EInputButton_TogglePickup = 36,
	EInputButton_SwitchFireMode = 37,
	EInputButton_SwitchToSeat1 = 38,
	EInputButton_SwitchToSeat2 = 39,
	EInputButton_SwitchToSeat3 = 40,
	EInputButton_SwitchToSeat4 = 41,
	EInputButton_VehicleAbility1 = 42,
	EInputButton_VehicleAbility2 = 43,
	EInputButton_RoleSkillSuper = 44,
	EInputButton_RoleSkillTactical = 45,
	EInputButton_ShieldUpgrade = 46,
	EInputButton_ShieldUpgradeCancel = 47,
	EInputButton_TogglePutAwayWeapon = 48,
	EInputButton_Max = 49
};

// Enum Solarland.EKillParamsCompressInfo
enum class EKillParamsCompressInfo : int32 {
	Default = 0,
	bKillLeaderChange = 1,
	bKillLeaderShutDown = 2,
	bRevenge = 4,
	bShutDown = 8,
	bDown = 16,
	bClearTeam = 32,
	bKillDefender = 64,
	bKillerDead = 128,
	bHitHead = 256,
	bKillLeaderKill = 512,
	EKillParamsCompressInfo_MAX = 513
};

// Enum Solarland.ESpectateReferToState
enum class ESpectateReferToState : uint8 {
	Invalid = 0,
	Enter = 1,
	Change = 2,
	Exit = 3,
	ESpectateReferToState_MAX = 4
};

// Enum Solarland.EVehicleInterationUIState
enum class EVehicleInterationUIState : uint8 {
	None = 0,
	Repair = 1,
	Drive = 2,
	Passenger = 4,
	Backpacker = 8,
	EVehicleInterationUIState_MAX = 9
};

// Enum Solarland.ETransformerType
enum class ETransformerType : uint8 {
	Wheeled = 0,
	Legged = 1,
	Max = 2
};

// Enum Solarland.EPlayerNamePanelScale
enum class EPlayerNamePanelScale : uint8 {
	ExtraSmallSize = 0,
	SmallSize = 1,
	DefaultSize = 2,
	LargeSize = 3,
	ExtraLargeSize = 4,
	EPlayerNamePanelScale_MAX = 5
};

// Enum Solarland.EBattleOBHUDType
enum class EBattleOBHUDType : uint8 {
	None = 0,
	SpectatePlayer = 1,
	FreeView = 2,
	FreeLookAt = 3,
	Director = 4,
	EBattleOBHUDType_MAX = 5
};

// Enum Solarland.EOBPlayerHeadInfoWidgetStyle
enum class EOBPlayerHeadInfoWidgetStyle : uint8 {
	NearMode = 0,
	MiddleMode = 1,
	FarMode = 2,
	MAX = 3
};

// Enum Solarland.EUIPanelName
enum class EUIPanelName : uint8 {
	None = 0,
	SolarBattleControll = 1,
	WorldMarkPanel = 2,
	WeaponCrosshairPanel = 3,
	SolarBattle_Backpack = 4,
	Separate_Discarded_MultiItem = 5,
	HUD_ElectricShop = 6,
	BigMapUMG = 7,
	HUD_CustomizedNotice = 8,
	UI_Settings = 9,
	UI_OB_Root = 10,
	UI_OB_GlobalControl = 11,
	UI_OB_BigMap = 12,
	UI_OB_Settlement = 13,
	UI_OB_Settlement_InputMask = 14,
	UI_OB_HeadInfo = 15,
	UI_OB_ShortKeyboard = 16,
	UI_OpeningShow = 17,
	UI_Eliminate = 18,
	UI_Skill_Scan = 19,
	UI_HeroPick = 20,
	JobEffectDetailPanel = 21,
	UI_BuffEffectScreenPanel = 22,
	UI_TestCustomPanel = 23,
	Solarland_DevDebugUI_Widget = 24,
	UI_Highlight_Overview = 25,
	UI_BattleGround_End = 26,
	EUIPanelName_MAX = 27
};

// Enum Solarland.EWidgetBackKeyType
enum class EWidgetBackKeyType : uint8 {
	Invalid = 0,
	FromKey = 1,
	FromClose = 2,
	EWidgetBackKeyType_MAX = 3
};

// Enum Solarland.EWidgetLayerLevel
enum class EWidgetLayerLevel : uint8 {
	NormalWidget = 0,
	SameLevelCacheWidget = 1,
	SameLevelReplaceWidget = 2,
	CloseAllBackKeyWidget = 3,
	CloseAllBackKeyAndNormalWidget = 4,
	EWidgetLayerLevel_MAX = 5
};

// Enum Solarland.EWidgetScope
enum class EWidgetScope : uint8 {
	World = 0,
	Global = 1,
	EWidgetScope_MAX = 2
};

// Enum Solarland.ELayoutPreviewType
enum class ELayoutPreviewType : uint8 {
	Mobile = 0,
	Desktop = 1,
	ELayoutPreviewType_MAX = 2
};

// Enum Solarland.EInputCapture
enum class EInputCapture : uint8 {
	EIC_None = 0,
	EIC_Start = 1,
	EIC_End = 2,
	EIC_Move = 4,
	EIC_Transient = 3,
	EIC_All = 7,
	EIC_MAX = 8
};

// Enum Solarland.ESpecialItemID
enum class ESpecialItemID : int32 {
	NONE = 0,
	CARIRIDGE_BAG = 1040101,
	REVIVE_ITEM = 1160501,
	RADAR_SCANNER = 1080101,
	SHIELD_RECHARGER = 1120100,
	SHIELD_BIG_RECHARGER = 1120101,
	AMMO_ASSAULT_RIFLE = 1030101,
	AMMO_RIFLE = 1030102,
	AMMO_SNIPER = 1030103,
	AMMO_SHOTGUN = 1030104,
	SHIELD_UPGRADE_MATERIAL = 148023,
	EXP_ITEM = 149022,
	ESpecialItemID_MAX = 1160502
};

// Enum Solarland.EImageURLDownloadState
enum class EImageURLDownloadState : uint8 {
	NotStarted = 0,
	Processing = 1,
	Success = 2,
	Failed = 3,
	EImageURLDownloadState_MAX = 4
};

// Enum Solarland.ECustomGameModeTypeForUI
enum class ECustomGameModeTypeForUI : uint8 {
	Type_Default = 0,
	Type_Sabotage = 1,
	Type_MAX = 2
};

// Enum Solarland.EShopWeaponUpgradeState
enum class EShopWeaponUpgradeState : uint8 {
	Upgrade_None = 0,
	Upgrade_Enable = 1,
	Upgrade_Max = 2,
	Upgrade_NotEnoughEnergy = 3
};

// Enum Solarland.EActionWheelOperateType
enum class EActionWheelOperateType : uint8 {
	NeedClick = 0,
	AutoCommand = 1,
	EActionWheelOperateType_MAX = 2
};

// Enum Solarland.EActionWheelCommandType
enum class EActionWheelCommandType : uint8 {
	None = 0,
	UseItem = 1,
	WorldMark = 2,
	UseSticker = 3,
	PlayAnimation = 4,
	PlaySound = 5,
	Max = 6
};

// Enum Solarland.EActorMaterialChangeRebuildReason
enum class EActorMaterialChangeRebuildReason : uint8 {
	OriginalMeshChanged = 0,
	MeshAddedOrRemoved = 1,
	EActorMaterialChangeRebuildReason_MAX = 2
};

// Enum Solarland.EMaterialChangeTextureOverrideMode
enum class EMaterialChangeTextureOverrideMode : uint8 {
	None = 0,
	OverrideAllTextures = 1,
	OverrideSpecifiedTextures = 2,
	EMaterialChangeTextureOverrideMode_MAX = 3
};

// Enum Solarland.EMaterialParameterTypeFlags
enum class EMaterialParameterTypeFlags : uint8 {
	None = 0,
	Scaler = 1,
	Vector = 2,
	Texture = 4,
	Font = 8,
	AllWithoutFont = 7,
	All = 15,
	EMaterialParameterTypeFlags_MAX = 16
};

// Enum Solarland.EMaterialParameterType2
enum class EMaterialParameterType2 : uint8 {
	Scaler = 0,
	Vector = 1,
	Texture = 2,
	Font = 3,
	EMaterialParameterType2_MAX = 4
};

// Enum Solarland.EMaterialChangeType
enum class EMaterialChangeType : uint8 {
	Normal = 0,
	MultiplePass = 1,
	EMaterialChangeType_MAX = 2
};

// Enum Solarland.EActorParticleEffectAttachOption
enum class EActorParticleEffectAttachOption : uint8 {
	None = 0,
	AttachToActor = 1,
	AttachToMesh = 2,
	EActorParticleEffectAttachOption_MAX = 3
};

// Enum Solarland.EOperator
enum class EOperator : uint8 {
	IDLE = 0,
	ADD = 1,
	MINUS = 2,
	CANCEL = 3,
	EOperator_MAX = 4
};

// Enum Solarland.EAirDropOpenState
enum class EAirDropOpenState : uint8 {
	Closed = 0,
	Opening = 1,
	Opened = 2,
	EAirDropOpenState_MAX = 3
};

// Enum Solarland.EAirDropMovementState
enum class EAirDropMovementState : uint8 {
	None = 0,
	Waiting = 1,
	FreeFalling = 2,
	UniformFalling = 3,
	DecelerateFalling = 4,
	Landing = 5,
	Landed = 6,
	Removed = 7,
	EAirDropMovementState_MAX = 8
};

// Enum Solarland.EBulletTraceTargetType
enum class EBulletTraceTargetType : uint8 {
	None = 0,
	Character = 1,
	Vehicle = 4,
	SummonItem = 8,
	EBulletTraceTargetType_MAX = 9
};

// Enum Solarland.EBounceType
enum class EBounceType : uint8 {
	NONE = 0,
	ONCE = 1,
	STICK = 2,
	MAX = 3
};

// Enum Solarland.ETriggerType
enum class ETriggerType : uint8 {
	KEY_DOWN = 0,
	KEY_UP = 1,
	KEY_HOLD = 2,
	MAX = 3
};

// Enum Solarland.EHoldActionType
enum class EHoldActionType : uint8 {
	HT_Charge = 0,
	HT_Projectile = 1,
	HT_None = 2,
	HT_MAX = 3
};

// Enum Solarland.EVirtualBulletType
enum class EVirtualBulletType : uint8 {
	LinearBullet = 0,
	CurveBullet = 1,
	GravityBullet = 2,
	TracingBullet = 3,
	EVirtualBulletType_MAX = 4
};

// Enum Solarland.ETrajectoryType
enum class ETrajectoryType : uint8 {
	LINE = 0,
	LINE_GRAVITY = 1,
	CURVE = 2,
	CANISTER = 3,
	BEAM = 4,
	Rocket = 5,
	VirtualBullet = 6,
	MAX = 7
};

// Enum Solarland.EWeaponSkillChargedState
enum class EWeaponSkillChargedState : uint8 {
	PREPARE = 0,
	START = 1,
	COMPLETECHARGE = 2,
	EXECUTE = 3,
	EWeaponSkillChargedState_MAX = 4
};

// Enum Solarland.EFireMethodType
enum class EFireMethodType : uint8 {
	BULLET = 0,
	SKILL = 1,
	SUMMONBULLET = 2,
	MAX = 3
};

// Enum Solarland.ECostFireType
enum class ECostFireType : uint8 {
	DESCRETE = 0,
	CONTINUOUS = 1,
	MAX = 2
};

// Enum Solarland.EShootingSoundOpt
enum class EShootingSoundOpt : uint8 {
	EShootingSound_SINGLE_1P = 0,
	EShootingSound_SINGLE_3P = 1,
	EShootingSound_SINGLE_3P_ENEMY = 2,
	EShootingSound_AUTO_1P = 3,
	EShootingSound_AUTO_3P = 4,
	EShootingSound_AUTO_3P_ENEMY = 5,
	EShootingSound_BURST_1P = 6,
	EShootingSound_BURST_3P = 7,
	EShootingSound_BURST_3P_ENEMY = 8,
	EShootingSound_FIRE_LAST_1P = 9,
	EShootingSound_FIRE_LAST_3P = 10,
	EShootingSound_SKILL_CAST_1P = 11,
	EShootingSound_SKILL_CAST_3P = 12,
	EShootingSound_LAND_COMMON_HIT_3P = 13,
	EShootingSound_SKILL_FX_START_1P = 14,
	EShootingSound_SKILL_FX_START_3P = 15,
	EShootingSound_SHIELD_HIT_1P = 16,
	EShootingSound_SHIELD_HIT_3P = 17,
	EShootingSound_SHIELD_BROKEN_1P = 18,
	EShootingSound_SHIELD_BROKEN_3P = 19,
	EShootingSound_BODY_HIT_1P = 20,
	EShootingSound_BODY_HIT_3P = 21,
	EShootingSound_FIRE_OVERLOAD_1P = 22,
	EShootingSound_FIRE_OVERLOAD_3P = 23,
	EShootingSound_Fly_Loop = 24,
	EShootingSound_Fly_Once = 25,
	EShootingSound_Vehicle_Gun_On = 26,
	EShootingSound_Vehicle_Gun_Off = 27,
	EShootingSound_Smoke_Loop = 28,
	EShootingSound_B9A04Skill = 29,
	EShootingSound_Reload_1P_2 = 30,
	EShootingSound_Reload_3P_2 = 31,
	EShootingSound_Reload_1P_3 = 32,
	EShootingSound_Reload_3P_3 = 33,
	EShootingSound_Reload_1P_4 = 34,
	EShootingSound_Reload_3P_4 = 35,
	EShootingSound_Bolt_1P = 36,
	EShootingSound_Bolt_3P = 37,
	EShootingSound_MAX = 38
};

// Enum Solarland.EShootingOpt
enum class EShootingOpt : uint8 {
	EShootingOpt_SINGLE = 0,
	EShootingOpt_AUTO = 1,
	EShootingOpt_BURST = 2,
	EShootingOpt_MAX = 3
};

// Enum Solarland.EFootEffectType
enum class EFootEffectType : uint8 {
	Effect_None = 0,
	Effect_Water = 1,
	Effect_MAX = 2
};

// Enum Solarland.EAttributeSubBehavior
enum class EAttributeSubBehavior : uint8 {
	Apply = 0,
	Cancel = 1,
	Update = 2,
	EAttributeSubBehavior_MAX = 3
};

// Enum Solarland.EBackPackTransitionAnimState
enum class EBackPackTransitionAnimState : int32 {
	TransitionAnimStateDefault = 0,
	SkyCharge2NoCharge_NoFly = 535,
	SkyCharge2NoEnergy_NoFly = 545,
	SkyCharge2NoCharge_Fly = 636,
	SkyCharge2NoEnergy_Fly = 646,
	SkyCharge2NoCharge_IntoFly = 536,
	SkyCharge2NoEnergy_IntoFly = 546,
	NoCharge2SkyCharge_NoFly = 3505,
	NoEnergy2SkyCharge_NoFly = 4505,
	NoCharge2SkyCharge_Fly = 3606,
	NoEnergy2SkyCharge_Fly = 4606,
	NoCharge2SkyCharge_OutFly = 3605,
	NoEnergy2SkyCharge_OutFly = 4605,
	PileCharge2NoCharge_NoFly = 1535,
	PileCharge2NoEnergy_NoFly = 1545,
	PileCharge2NoCharge_Fly = 1636,
	PileCharge2NoEnergy_Fly = 1646,
	PileCharge2NoCharge_IntoFly = 1536,
	PileCharge2NoEnergy_IntoFly = 1546,
	NoCharge2PileCharge_NoFly = 3515,
	NoEnergy2PileCharge_NoFly = 4515,
	NoCharge2PileCharge_Fly = 3616,
	NoEnergy2PileCharge_Fly = 4616,
	NoCharge2PileCharge_OutFly = 3615,
	NoEnergy2PileCharge_OutFly = 4615,
	BoxCharge2NoCharge_NoFly = 2535,
	BoxCharge2NoEnergy_NoFly = 2545,
	BoxCharge2NoCharge_Fly = 2636,
	BoxCharge2NoEnergy_Fly = 2646,
	BoxCharge2NoCharge_IntoFly = 2536,
	BoxCharge2NoEnergy_IntoFly = 2546,
	NoCharge2BoxCharge_NoFly = 3525,
	NoEnergy2BoxCharge_NoFly = 4525,
	NoCharge2BoxCharge_Fly = 3626,
	NoEnergy2BoxCharge_Fly = 4626,
	NoCharge2BoxCharge_OutFly = 3625,
	NoEnergy2BoxCharge_OutFly = 4625,
	NoCharge2NoEnergy_NoFly = 3545,
	NoCharge2NoEnergy_IntoFly = 3546,
	NoEnergy2NoCharge_NoFly = 4535,
	NoEnergy2NoCharge_OutFly = 4635,
	EBackPackTransitionAnimState_MAX = 4636
};

// Enum Solarland.EBackPackFixedAnimState
enum class EBackPackFixedAnimState : uint8 {
	FixedAnimStateDefault = 0,
	FixedSkyChargeNoFly = 5,
	FixedPileChargeNoFly = 15,
	FixedBoxChargeNoFly = 25,
	FixedNoChargeNoFly = 35,
	FixedNoEnergyNoFly = 45,
	FixedSkyChargeIsFly = 6,
	FixedPileChargeIsFly = 16,
	FixedBoxChargeIsFly = 26,
	FixedNoChargeIsFly = 36,
	FixedNoEnergyIsFly = 46,
	EBackPackFixedAnimState_MAX = 47
};

// Enum Solarland.EBackPackAnimSubType
enum class EBackPackAnimSubType : uint8 {
	SkyChargeNoFly = 1,
	PileChargeNoFly = 2,
	BoxChargeNoFly = 3,
	NoChargeNoFly = 4,
	NoEnergyNoFly = 5,
	SkyChargeIsFly = 6,
	PileChargeIsFly = 7,
	BoxChargeIsFly = 8,
	NoChargeIsFly = 9,
	NoEnergyIsFly = 10,
	Charge2NoCharge_NoFly = 50,
	Charge2NoEnergy_NoFly = 51,
	Charge2NoCharge_Fly = 52,
	Charge2NoEnergy_Fly = 53,
	Charge2NoCharge_IntoFly = 54,
	Charge2NoEnergy_IntoFly = 55,
	NoCharge2Charge_NoFly = 56,
	NoEnergy2Charge_NoFly = 57,
	NoCharge2Charge_Fly = 58,
	NoEnergy2Charge_Fly = 59,
	NoCharge2Charge_OutFly = 60,
	NoEnergy2Charge_OutFly = 61,
	NoCharge2NoEnergy_NoFly = 62,
	NoCharge2NoEnergy_IntoFly = 63,
	NoEnergy2NoCharge_NoFly = 64,
	NoEnergy2NoCharge_OutFly = 65,
	ETypeDefault = 0,
	EBackPackAnimSubType_MAX = 66
};

// Enum Solarland.EBackPackAnimType
enum class EBackPackAnimType : uint8 {
	SkyCharge = 0,
	PileCharge = 1,
	BoxCharge = 2,
	NoCharge = 3,
	NoEnergy = 4,
	NoFly = 5,
	IsFly = 6,
	EBackPackAnimType_MAX = 7
};

// Enum Solarland.EProgressStatus
enum class EProgressStatus : uint8 {
	Min = 0,
	Max = 1,
	NoChange = 2,
	Increase = 3,
	Decrease = 4
};

// Enum Solarland.EControlPointStatus
enum class EControlPointStatus : uint8 {
	None = 0,
	Neutral = 1,
	Owned = 2,
	Enemy = 3,
	EControlPointStatus_MAX = 4
};

// Enum Solarland.EBattlegroundPlayerStartRegion
enum class EBattlegroundPlayerStartRegion : uint8 {
	Default = 0,
	Inner = 1,
	Outer = 2,
	EBattlegroundPlayerStartRegion_MAX = 3
};

// Enum Solarland.EBattlegroundMapElementType
enum class EBattlegroundMapElementType : uint8 {
	None = 0,
	Home = 1,
	ControlPoint = 2,
	AirWall = 3,
	PlayerStart = 4,
	VehicleSpawner = 5,
	Custom = 6,
	EBattlegroundMapElementType_MAX = 7
};

// Enum Solarland.EBattleRoyalTimeLineEnum
enum class EBattleRoyalTimeLineEnum : uint8 {
	None = 0,
	CreateBombingZone = 1,
	CreateAirdrop = 2,
	ModifyEnvironmentState = 3,
	EBattleRoyalTimeLineEnum_MAX = 4
};

// Enum Solarland.EBattleUpgradeEffectCategory
enum class EBattleUpgradeEffectCategory : uint8 {
	None = 0,
	Attack = 1,
	Defence = 2,
	Speed = 3,
	Bag = 4,
	Cooldown = 5,
	PlaceHolder1 = 6,
	PlaceHolder2 = 7,
	PlaceHolder3 = 8,
	PlaceHolder4 = 9,
	EBattleUpgradeEffectCategory_MAX = 10
};

// Enum Solarland.EBombingZoneState
enum class EBombingZoneState : uint8 {
	Waiting = 0,
	Firing = 1,
	Ending = 2,
	End = 3,
	EBombingZoneState_MAX = 4
};

// Enum Solarland.EBotAttrOperator
enum class EBotAttrOperator : uint8 {
	Equal = 0,
	Greater = 1,
	Less = 2,
	EBotAttrOperator_MAX = 3
};

// Enum Solarland.EBotAttrValueType
enum class EBotAttrValueType : uint8 {
	Current = 0,
	Max = 1,
	Percent = 2
};

// Enum Solarland.EBotAttrType
enum class EBotAttrType : uint8 {
	Health = 0,
	Shield = 1,
	Energy = 2,
	Difficulty = 3,
	EBotAttrType_MAX = 4
};

// Enum Solarland.EBotCheckCondition
enum class EBotCheckCondition : uint8 {
	AlwaysPass = 0,
	ReadyFight = 1,
	CanJetVertical = 2,
	CanJetHorizontal = 3,
	ReadyWeaponSkill = 4,
	IsIndependent = 5,
	NeedReloading = 6,
	EBotCheckCondition_MAX = 7
};

// Enum Solarland.EBotCheckAIServer
enum class EBotCheckAIServer : uint8 {
	AlwaysPass = 0,
	AIServerIsOnline = 1,
	EBotCheckAIServer_MAX = 2
};

// Enum Solarland.EBotCheckNgaiMLAction
enum class EBotCheckNgaiMLAction : uint8 {
	AlwaysPass = 0,
	DoOnceFire = 1,
	DoJump = 2,
	DoJetVertical = 3,
	DoJetForward = 4,
	DoUseRoleSkillOne = 5,
	DoUseRoleSkillTwo = 6,
	DoContinueFire = 7,
	DoMoveTo = 8,
	DoUseMedicine = 9,
	DoUseShieldRecharger = 10,
	DoVehicleFire = 11,
	DoUseVehicleFirstSkill = 12,
	DoUseVehicleSecondSkill = 13,
	EBotCheckNgaiMLAction_MAX = 14
};

// Enum Solarland.EBotCheckState
enum class EBotCheckState : uint8 {
	None = 0,
	Falling = 1,
	Driving = 2,
	Passager = 3,
	Swiming = 4,
	Dying = 5,
	Dead = 6,
	WeaponReloading = 7,
	ShootAiming = 8,
	SiegeVehicleLocated = 9,
	BeingRescued = 10,
	Cruising = 11,
	Skydiving = 12,
	SkydivingInitially = 13,
	SkydivingAfterRebirth = 14,
	SkydivingByLauncher = 15,
	EBotCheckState_MAX = 16
};

// Enum Solarland.EDistanceComparison
enum class EDistanceComparison : uint8 {
	Equal = 0,
	Greater = 1,
	Less = 2,
	EDistanceComparison_MAX = 3
};

// Enum Solarland.ESameScreenEffectHandleType
enum class ESameScreenEffectHandleType : uint8 {
	Ignore = 0,
	StopPrev = 1,
	ESameScreenEffectHandleType_MAX = 2
};

// Enum Solarland.EBuffEffectDurationType
enum class EBuffEffectDurationType : uint8 {
	Instant = 0,
	HasDuration = 1,
	EBuffEffectDurationType_MAX = 2
};

// Enum Solarland.ELevelLoadType
enum class ELevelLoadType : uint8 {
	ClientAntServer = 0,
	ClientOnly = 1,
	ServerOnly = 2,
	ELevelLoadType_MAX = 3
};

// Enum Solarland.EVaultType
enum class EVaultType : uint8 {
	None = 0,
	Step = 1,
	Step_Cross = 2,
	Step_Sprint = 3,
	Step_Sprint_Cross = 4,
	Vault = 5,
	Vault_Cross = 6,
	Vault_Sprint = 7,
	Vault_Sprint_Cross = 8,
	Climb = 9,
	Climb_Cross = 10,
	Climb_Sprint = 11,
	Climb_Sprint_Cross = 12,
	Climb_Water = 13,
	HighClimb = 14,
	HighClimb_Cross = 15,
	HighClimb_Sprint = 16,
	HighClimb_Sprint_Cross = 17,
	WallRun = 18,
	WallRunFailed = 19,
	EVaultType_MAX = 20
};

// Enum Solarland.EObstacleDetectorType
enum class EObstacleDetectorType : uint8 {
	Knee = 0,
	Waist = 1,
	Chest = 2,
	Overhead = 3,
	Nullifier = 7,
	EObstacleDetectorType_MAX = 8
};

// Enum Solarland.EMatActionOnRemoved
enum class EMatActionOnRemoved : uint8 {
	None = 0,
	ResetToBeginValue = 1,
	ResetToEndValue = 2,
	EMatActionOnRemoved_MAX = 3
};

// Enum Solarland.EBuffEffectType
enum class EBuffEffectType : uint8 {
	Both = 0,
	ScreenEffect = 1,
	ActorEffect = 2,
	EBuffEffectType_MAX = 3
};

// Enum Solarland.EActorEffectAffectedActorType
enum class EActorEffectAffectedActorType : uint8 {
	CharacterOnly = 0,
	All = 1,
	EActorEffectAffectedActorType_MAX = 2
};

// Enum Solarland.ECueContentVisibleTargetFlag
enum class ECueContentVisibleTargetFlag : uint8 {
	None = 0,
	Self = 1,
	Teammate = 2,
	Other = 4,
	Observer = 8,
	Anyone = 15,
	ECueContentVisibleTargetFlag_MAX = 16
};

// Enum Solarland.ECueContentPlayTiming
enum class ECueContentPlayTiming : uint8 {
	OnExecute = 0,
	OnActive = 1,
	WhileActive = 2,
	OnRemove = 3,
	OnCustomEvent = 4,
	ECueContentPlayTiming_MAX = 5
};

// Enum Solarland.EUseType
enum class EUseType : uint8 {
	NORMAL = 0,
	HANDSETTING = 101,
	EUseType_MAX = 102
};

// Enum Solarland.EWeaponEquipSlot
enum class EWeaponEquipSlot : uint8 {
	None = 0,
	First = 1,
	Second = 2,
	EWeaponEquipSlot_MAX = 3
};

// Enum Solarland.ECrossHairState
enum class ECrossHairState : uint8 {
	None = 0,
	Normal = 1,
	Reload = 2,
	Overload = 3,
	Forbid = 4,
	ECrossHairState_MAX = 5
};

// Enum Solarland.ESpreadType
enum class ESpreadType : uint8 {
	Absolute = 0,
	Relative = 1,
	ESpreadType_MAX = 2
};

// Enum Solarland.ECrossHairSpecialFireState
enum class ECrossHairSpecialFireState : uint8 {
	PrepareFire = 0,
	ActivateFire = 1,
	KeepFiring = 2,
	EndFire = 3,
	ECrossHairSpecialFireState_MAX = 4
};

// Enum Solarland.ECurvedEffectControllerStopMode
enum class ECurvedEffectControllerStopMode : uint8 {
	KeepCurrentProgress = 0,
	SetProgressToBegin = 1,
	SetProgressToEnd = 2,
	ECurvedEffectControllerStopMode_MAX = 3
};

// Enum Solarland.EUsePlayerType
enum class EUsePlayerType : uint8 {
	Self = 0,
	Teammate = 1,
	Enemy = 2,
	EUsePlayerType_MAX = 3
};

// Enum Solarland.EUseEmojiScene
enum class EUseEmojiScene : uint8 {
	None = 0,
	Lobby = 1,
	Battle = 2,
	EUseEmojiScene_MAX = 3
};

// Enum Solarland.EAnimationType
enum class EAnimationType : uint8 {
	Overload = 0,
	Overlay = 1,
	EAnimationType_MAX = 2
};

// Enum Solarland.EWeaponInfiniteAmmoMode
enum class EWeaponInfiniteAmmoMode : uint8 {
	Default = 0,
	InfiniteClip = 1,
	InfinitePkg = 2,
	InfiniteBoth = 3,
	EWeaponInfiniteAmmoMode_MAX = 4
};

// Enum Solarland.EJetAltitudeLimitationMode
enum class EJetAltitudeLimitationMode : uint8 {
	Default = 0,
	Home = 1,
	EJetAltitudeLimitationMode_MAX = 2
};

// Enum Solarland.EWeaponVibrateFactor
enum class EWeaponVibrateFactor : uint8 {
	Off = 0,
	Low = 10,
	Middle = 20,
	High = 30,
	EWeaponVibrateFactor_MAX = 31
};

// Enum Solarland.EWeaponVibrateType
enum class EWeaponVibrateType : uint8 {
	None = 0,
	Fire = 1,
	Reload_GetOld = 2,
	Reload_Restore = 3,
	Bolt = 4,
	Charge = 5,
	EWeaponVibrateType_MAX = 6
};

// Enum Solarland.EGameplayVibrateIntensity
enum class EGameplayVibrateIntensity : uint8 {
	Off = 0,
	Low = 10,
	Middle = 20,
	High = 30,
	EGameplayVibrateIntensity_MAX = 31
};

// Enum Solarland.EGameplayVibrateCategory
enum class EGameplayVibrateCategory : uint8 {
	None = 0,
	SelfBeingHit = 1,
	SelfJetpackFlying = 2,
	SelfContinuousDamaged = 3,
	TriggerCharacterDown = 4,
	TriggerCharacterDie = 5,
	EGameplayVibrateCategory_MAX = 6
};

// Enum Solarland.EVibrateDeviceType
enum class EVibrateDeviceType : uint8 {
	Nonsupport = 0,
	Mobile = 1,
	Gamepad = 2,
	EVibrateDeviceType_MAX = 3
};

// Enum Solarland.ESCMDataGatherType_Settle
enum class ESCMDataGatherType_Settle : uint8 {
	None = 0,
	Self = 1,
	Side = 2,
	All = 3,
	ESCMDataGatherType_MAX = 4
};

// Enum Solarland.ESCMDataReplicateType
enum class ESCMDataReplicateType : uint8 {
	None = 0,
	RepOwner = 1,
	RepSide = 2,
	RepGlobal = 3,
	ESCMDataReplicateType_MAX = 4
};

// Enum Solarland.ESCMRankCheckType
enum class ESCMRankCheckType : uint8 {
	New = 0,
	Change = 1,
	Delete = 2,
	ESCMRankCheckType_MAX = 3
};

// Enum Solarland.ESCMDataSetType
enum class ESCMDataSetType : uint8 {
	None = 0,
	Array = 1,
	Map = 2,
	ESCMDataSetType_MAX = 3
};

// Enum Solarland.EGaugeType
enum class EGaugeType : uint8 {
	None = 0,
	Degree_361 = 1,
	Degree_181 = 2,
	Degree_91 = 3,
	DownUp = 4,
	LeftRight = 5,
	EGaugeType_MAX = 6
};

// Enum Solarland.EAimOffsetAdjustType
enum class EAimOffsetAdjustType : uint8 {
	None = 0,
	AdjustPitch = 1,
	AdjustYaw = 2,
	AdjustBoth = 3,
	EAimOffsetAdjustType_MAX = 4
};

// Enum Solarland.EPosture
enum class EPosture : uint8 {
	Stand = 0,
	Crouch = 1,
	EPosture_MAX = 2
};

// Enum Solarland.EAimTraceOriginType
enum class EAimTraceOriginType : uint8 {
	Default = 0,
	Muzzle = 1,
	Camera = 2,
	EAimTraceOriginType_MAX = 3
};

// Enum Solarland.EUIHeroPickListCellState
enum class EUIHeroPickListCellState : uint8 {
	Show = 0,
	Lock = 1,
	Forbidden = 2,
	EUIHeroPickListCellState_MAX = 3
};

// Enum Solarland.EHeroOwnedType
enum class EHeroOwnedType : uint8 {
	Own = 0,
	OwnForNow = 1,
	NotOwn = 2,
	EHeroOwnedType_MAX = 3
};

// Enum Solarland.EHeroPickType
enum class EHeroPickType : uint8 {
	AllSidePlayer = 0,
	SpecificPlayer = 1,
	AllPlayer = 2,
	EHeroPickType_MAX = 3
};

// Enum Solarland.EUIHeroPickPlayerState
enum class EUIHeroPickPlayerState : uint8 {
	Waiting = 0,
	Selecting = 1,
	Confirm = 2,
	Done = 3,
	EUIHeroPickPlayerState_MAX = 4
};

// Enum Solarland.EHomeJetPackflag
enum class EHomeJetPackflag : uint8 {
	NONE = 0,
	Horizontal = 1,
	Vertical = 2,
	Stop = 3,
	EHomeJetPackflag_MAX = 4
};

// Enum Solarland.ESkillStateType
enum class ESkillStateType : uint8 {
	Normal = 0,
	CD = 1,
	NoneSkill = 2,
	ESkillStateType_MAX = 3
};

// Enum Solarland.EKeyMappingStatus
enum class EKeyMappingStatus : uint8 {
	EMPTY = 0,
	BASE = 1,
	OTHER = 2,
	OTHERANDBASE = 3,
	INVALID = 4,
	DONE = 5,
	EKeyMappingStatus_MAX = 6
};

// Enum Solarland.EKillNoticeType
enum class EKillNoticeType : uint8 {
	BeKillLeader = 0,
	ShutDownKillLeader = 1,
	Revenge = 2,
	ShutDown = 3,
	CumulativeKill = 4,
	Down = 5,
	ClearTeam = 6,
	KillDefender = 7,
	SelfKillNotify = 8,
	KillLeaderChange = 9,
	KillLeaderShutDown = 10,
	GlobalKillNotify = 11,
	EKillNoticeType_MAX = 12
};

// Enum Solarland.EMapCellSelectionAccess
enum class EMapCellSelectionAccess : uint8 {
	Can = 0,
	Cannot = 1,
	EMapCellSelectionAccess_MAX = 2
};

// Enum Solarland.EMassInvState
enum class EMassInvState : uint8 {
	Begin = 0,
	Prepare = 1,
	Normal = 2,
	Sprint = 3,
	End = 4,
	EMassInvState_MAX = 5
};

// Enum Solarland.EMapState
enum class EMapState : uint8 {
	Idle = 0,
	FOVScale = 1,
	EMapState_MAX = 2
};

// Enum Solarland.EMapFOVParamType
enum class EMapFOVParamType : uint8 {
	VehicleSpeed = 0,
	PoisonCircle = 1,
	EMapFOVParamType_MAX = 2
};

// Enum Solarland.EMapFOVState
enum class EMapFOVState : uint8 {
	Default = 0,
	Fov1 = 1,
	Fov2 = 2,
	EMapFOVState_MAX = 3
};

// Enum Solarland.EAirdropStatus
enum class EAirdropStatus : uint8 {
	Default = 0,
	Coming = 1,
	Available = 2,
	Opening = 3,
	Opened = 4,
	EAirdropStatus_MAX = 5
};

// Enum Solarland.EMeshWidgetDisplayType
enum class EMeshWidgetDisplayType : uint8 {
	Icon = 0,
	Flash = 1,
	Diffuse = 2,
	EMeshWidgetDisplayType_MAX = 3
};

// Enum Solarland.EMissileSwarmDebugFlag
enum class EMissileSwarmDebugFlag : uint8 {
	Aim = 0,
	Trail = 1,
	Trace = 2,
	Explode = 3,
	Mesh = 4,
	EMissileSwarmDebugFlag_MAX = 5
};

// Enum Solarland.EMeshProgressType
enum class EMeshProgressType : uint8 {
	Normal = 0,
	Damage = 1,
	Background = 2,
	EMeshProgressType_MAX = 3
};

// Enum Solarland.E_Type_OB_Scoreboard
enum class E_Type_OB_Scoreboard : uint8 {
	OB_Settlement = 0,
	OB_InGame = 1,
	Lobby_League_Settlement = 2,
	Lobby_CreateRoom_Settlement = 3,
	E_Type_OB_MAX = 4
};

// Enum Solarland.EOBPithyPlayerState
enum class EOBPithyPlayerState : uint8 {
	Alive = 0,
	Dying = 1,
	Dead = 2,
	EOBPithyPlayerState_MAX = 3
};

// Enum Solarland.EOBTeamListTab
enum class EOBTeamListTab : uint8 {
	Pithy = 0,
	All = 1,
	Nearby = 2,
	EOBTeamListTab_MAX = 3
};

// Enum Solarland.ERoleWidgetStatus
enum class ERoleWidgetStatus : uint8 {
	Normal = 0,
	WaitTriggerAgain = 1,
	Disable = 2,
	InCD = 3,
	Forbidden = 4,
	ERoleWidgetStatus_MAX = 5
};

// Enum Solarland.ERoleWidgetType
enum class ERoleWidgetType : uint8 {
	Super = 0,
	Tactical = 1,
	ERoleWidgetType_MAX = 2
};

// Enum Solarland.ESCMMapElementVisibilityType
enum class ESCMMapElementVisibilityType : uint8 {
	Visible = 0,
	Hidden = 1,
	ESCMMapElementVisibilityType_MAX = 2
};

// Enum Solarland.ESCMMapElementStateType
enum class ESCMMapElementStateType : uint8 {
	Normal = 0,
	Suspend = 1,
	ESCMMapElementStateType_MAX = 2
};

// Enum Solarland.ESCMMapElementType
enum class ESCMMapElementType : uint8 {
	PlayerStart = 0,
	ItemSpawner = 1,
	AirDrop = 2,
	ChargingPile = 3,
	JumpPad = 4,
	CarPad = 5,
	Vehicle = 6,
	Poison = 7,
	Custom = 8,
	ESCMMapElementType_MAX = 9
};

// Enum Solarland.EMatchType
enum class EMatchType : uint8 {
	NONE = 0,
	Team = 1,
	AverageSide = 2,
	SingleSide = 3,
	EMatchType_MAX = 4
};

// Enum Solarland.EPlayerResurrectType
enum class EPlayerResurrectType : uint8 {
	NONE = 0,
	SelfResurrectionCoin = 1,
	RequestTeamResurrect = 2,
	EPlayerResurrectType_MAX = 3
};

// Enum Solarland.EPlayerPawnType
enum class EPlayerPawnType : uint8 {
	NONE = 0,
	Character = 1,
	Vehicle = 2,
	Other = 3,
	EPlayerPawnType_MAX = 4
};

// Enum Solarland.ESCMGameSceneType
enum class ESCMGameSceneType : uint8 {
	None = 0,
	InBattle = 1,
	Settlement = 2,
	ESCMGameSceneType_MAX = 3
};

// Enum Solarland.EDownloadState
enum class EDownloadState : uint8 {
	None = 0,
	Downloading = 1,
	Successful = 2,
	Failed = 3,
	EDownloadState_MAX = 4
};

// Enum Solarland.EShieldUpgradeItemShopOpenState
enum class EShieldUpgradeItemShopOpenState : uint8 {
	Closed = 0,
	Opening = 1,
	Open = 2,
	Closing = 3,
	EShieldUpgradeItemShopOpenState_MAX = 4
};

// Enum Solarland.ESolarWeaponBrand
enum class ESolarWeaponBrand : uint8 {
	WeaponBrand_None = 0,
	WeaponBrand_9A = 1,
	WeaponBrand_Wasteland = 2,
	WeaponBrand_Murphy = 3,
	WeaponBrand_Prism = 4,
	WeaponBrand_MAX = 5
};

// Enum Solarland.ERoleAbilityVoiceTriggerTiming
enum class ERoleAbilityVoiceTriggerTiming : uint8 {
	None = 0,
	Active = 1,
	Commit = 2,
	ERoleAbilityVoiceTriggerTiming_MAX = 3
};

// Enum Solarland.ESolarAbilityInstanceType
enum class ESolarAbilityInstanceType : uint8 {
	ESolarAbilityInstanceType_Multiple = 0,
	ESolarAbilityInstanceType_SingleReplace = 1,
	ESolarAbilityInstanceType_SingleYield = 2,
	ESolarAbilityInstanceType_Max = 3
};

// Enum Solarland.ESolarAttributeDurationType
enum class ESolarAttributeDurationType : uint8 {
	Instant = 0,
	HasDuration = 1,
	Infinite = 2,
	ESolarAttributeDurationType_MAX = 3
};

// Enum Solarland.ESolarAttributeValueSourceType
enum class ESolarAttributeValueSourceType : uint8 {
	Value = 0,
	FromConfig = 1,
	ESolarAttributeValueSourceType_MAX = 2
};

// Enum Solarland.EAchievementCondition
enum class EAchievementCondition : uint8 {
	None = 0,
	AchTSubAchievement = 1,
	AchTMinuteKill = 2,
	AchTUseVehicle = 3,
	AchTHPKill = 4,
	AchTLimitWin = 5,
	AchTDyingWin = 6,
	AchTAssistWin = 7,
	AchTRescue = 8,
	AchTLevel = 9,
	AchTSkyKill = 10,
	AchTOnlyLiveWin = 11,
	AchTFirstKill = 12,
	AchTBlindSniper = 13,
	AchTFriendNum = 14,
	AchTOpenBoxNum = 15,
	AchTenemyVehicle = 16,
	AchTDie = 17,
	AchTMarsWin = 18,
	AchTFistKill = 19,
	AchTAirUmbrella = 20,
	AchTAirTrapeze = 21,
	AchTAirSpeed = 22,
	AchTBubbleKill = 23,
	AchTCharacterNum = 24,
	AchAdvancedWeapon = 25,
	AchTBombingDie = 26,
	AchTRevengeKill = 27,
	EAchievementCondition_MAX = 28
};

// Enum Solarland.EAchievementReportType
enum class EAchievementReportType : uint8 {
	None = 0,
	SingleBattlle = 1,
	MultiBattle = 2,
	NoBattle = 3,
	EAchievementReportType_MAX = 4
};

// Enum Solarland.ESigninItemState
enum class ESigninItemState : uint8 {
	Got = 0,
	UnGot = 1,
	No = 2,
	ESigninItemState_MAX = 3
};

// Enum Solarland.EWidgetOverrideParamType
enum class EWidgetOverrideParamType : uint8 {
	None = 0,
	Text = 1,
	Image = 2,
	Custom = 3,
	GameplayTag = 4,
	EWidgetOverrideParamType_MAX = 5
};

// Enum Solarland.EWidgetLoadType
enum class EWidgetLoadType : uint8 {
	Start = 0,
	Delay = 1,
	EWidgetLoadType_MAX = 2
};

// Enum Solarland.EProgressBoardChannelState
enum class EProgressBoardChannelState : uint8 {
	None = 0,
	Add = 1,
	Minus = 2,
	HoldOn = 3,
	EProgressBoardChannelState_MAX = 4
};

// Enum Solarland.ESolarAIValueCompareOp
enum class ESolarAIValueCompareOp : uint8 {
	Equal = 0,
	Greater = 1,
	Less = 2,
	ESolarAIValueCompareOp_MAX = 3
};

// Enum Solarland.ESolarAudioDetailCatalog
enum class ESolarAudioDetailCatalog : uint8 {
	SADC_Common = 0,
	SADC_Music = 1,
	SADC_UI = 2,
	SADC_Gun = 3,
	SADC_Vehicle = 4,
	SADC_Object = 5,
	SADC_Character = 6,
	SADC_Voice = 7,
	SADC_VoiceEx = 8,
	SADC_MAX = 9
};

// Enum Solarland.ESolarAudioDetailUnloadMode
enum class ESolarAudioDetailUnloadMode : uint8 {
	SADU_NeverUnload = 0,
	SADU_SwitchLevel = 1,
	SADU_Manual = 2,
	SADU_EnterOtherScene = 3,
	SADU_LeaveLobby = 4,
	SADU_LeaveTutorial = 5,
	SADU_LeaveHome = 6,
	SADU_LeaveWaiting = 7,
	SADU_LeaveGame = 8,
	SADU_DontCare = 9,
	SADU_MAX = 10
};

// Enum Solarland.ESolarAudioDetailLoadMode
enum class ESolarAudioDetailLoadMode : uint8 {
	SADL_BeginPlay = 0,
	SADL_OnDemand = 1,
	SADL_Manual = 2,
	SADL_EnterBindScene = 3,
	SADL_EnterLobby = 4,
	SADL_EnterTutorial = 5,
	SADL_EnterHome = 6,
	SADL_EnterWaiting = 7,
	SADL_EnterGame = 8,
	SADL_NeverLoad = 9,
	SADL_MAX = 10
};

// Enum Solarland.EBankLoadState
enum class EBankLoadState : uint8 {
	NotLoaded = 0,
	Loaded = 1,
	AsyncLoading = 2,
	AsyncUnloading = 3,
	EBankLoadState_MAX = 4
};

// Enum Solarland.EAnimBlendDirection
enum class EAnimBlendDirection : uint8 {
	Idle = 0,
	Forward = 1,
	Back = 2,
	Right = 3,
	Left = 4,
	Max = 5
};

// Enum Solarland.EInVehicleState
enum class EInVehicleState : uint8 {
	None = 0,
	Driving = 1,
	Riding = 2,
	StickingOut = 3,
	EInVehicleState_MAX = 4
};

// Enum Solarland.ECruiseAnimState
enum class ECruiseAnimState : uint8 {
	None = 0,
	Looping = 1,
	Leaving = 2,
	End = 3,
	ECruiseAnimState_MAX = 4
};

// Enum Solarland.ECharacterMontage
enum class ECharacterMontage : uint8 {
	Invalid = 0,
	Bolt = 1,
	Equip = 2,
	PreFire = 3,
	Rechamber = 4,
	Fire1 = 5,
	Reload = 6,
	ReloadWithBolt = 7,
	Max = 8
};

// Enum Solarland.EVehicleAnimationType
enum class EVehicleAnimationType : uint8 {
	None = 0,
	Suv = 1,
	Sports = 2,
	MotorBike = 3,
	Hover = 4,
	Legged = 5,
	IronMan = 6,
	Backpacker = 7,
	EVehicleAnimationType_MAX = 8
};

// Enum Solarland.EDriveTurnType
enum class EDriveTurnType : uint8 {
	EDriveTurnType_Idle = 0,
	EDriveTurnType_Left = 1,
	EDriveTurnType_Right = 2,
	EDriveTurnType_MAX = 3
};

// Enum Solarland.EWeaponStatus
enum class EWeaponStatus : uint8 {
	NoWeapon = 0,
	Peace = 1,
	Aiming = 2,
	EWeaponStatus_MAX = 3
};

// Enum Solarland.EAnoAntiDataType
enum class EAnoAntiDataType : uint8 {
	Unknown = 0,
	SecAntiDataFlow = 1,
	SecAttackFlow = 2,
	EAnoAntiDataType_MAX = 3
};

// Enum Solarland.EMeerkatSubComponentType
enum class EMeerkatSubComponentType : uint8 {
	MB = 0,
	Hp = 1,
	AE = 2,
	AR = 3,
	EMeerkatSubComponentType_MAX = 4
};

// Enum Solarland.EMeerkatGameDispatchEvents
enum class EMeerkatGameDispatchEvents : uint8 {
	ServerFire = 0,
	ServerHit = 1,
	ServerKill = 2,
	ServerKilled = 3,
	ClientFire = 4,
	ClientHit = 5,
	ClientKill = 6,
	ClientKilled = 7,
	ClientHitDown = 8,
	ClientBeHitDown = 9,
	ClientTick = 10,
	ServerTick = 11,
	ClientBeginPlay = 12,
	ServerBeginPlay = 13,
	ClientEndPlay = 14,
	ServerEndPlay = 15,
	EventMax = 16,
	EMeerkatGameDispatchEvents_MAX = 17
};

// Enum Solarland.EItemLoadPriority
enum class EItemLoadPriority : int32 {
	DEFAULT = 0,
	ITEM_MIN = 1,
	ITEM_MAX = 99,
	WEAPON_MIN = 100,
	WEAPON_MAX = 199,
	VEHICLE_MIN = 200,
	VEHICLE_MAX = 299,
	CHARACTER_MIN = 300,
	CHARACTER_MAX = 399,
	CLASS_PRIORITY = 4294967295,
	EItemLoadPriority_MAX = 4294967296
};

// Enum Solarland.EAutoSaveType
enum class EAutoSaveType : uint8 {
	Weapon = 0,
	ItemActor = 1,
	EAutoSaveType_MAX = 2
};

// Enum Solarland.ESolarBotMemberState
enum class ESolarBotMemberState : uint8 {
	None = 0,
	Leader = 1,
	OnCall = 2,
	Separate = 3,
	Leaving = 4,
	Invalid = 5,
	ESolarBotMemberState_MAX = 6
};

// Enum Solarland.EBotTeleportReason
enum class EBotTeleportReason : uint8 {
	Unknown = 0,
	SolveBlock = 1,
	SolveOffMesh = 2,
	BTTask = 3,
	PreservePop = 4,
	EBotTeleportReason_MAX = 5
};

// Enum Solarland.ESolarAITagStateTimeType
enum class ESolarAITagStateTimeType : uint8 {
	DurationInCurrentState = 0,
	TimeSinceLastExitToState = 1,
	ESolarAITagStateTimeType_MAX = 2
};

// Enum Solarland.EBotInteractCondition
enum class EBotInteractCondition : uint8 {
	Invalid = 0,
	NeedToResponsePoison = 1,
	FoundEnemyActor = 2,
	TeammateKillEnemy = 3,
	WeAreTheChampion = 4,
	TeammateMarkTargetLocation = 5,
	TeammateMarkTargetDangerPoint = 6,
	TeammateMarkTargetItem = 7,
	TeammateMarkTargetFootstep = 8,
	TeammateMarkFollowHe = 9,
	TeammateMarkGetOnVehicle = 10,
	TeammateMarkNeedVehicle = 11,
	TeammateMarkNeedWeapon = 12,
	TeammateMarkNeedHelp = 13,
	TeammateMarkAttack = 14,
	TeammateMarkDefend = 15,
	MockEnemy = 16,
	MockDyingEnemy = 17,
	EnterDying = 18,
	BoringEnough = 19,
	EBotInteractCondition_MAX = 20
};

// Enum Solarland.EBotFocusType
enum class EBotFocusType : uint8 {
	FocusToNothing = 0,
	FocusToActor = 1,
	FocusToPoint = 2,
	FocusToDirection = 3,
	EBotFocusType_MAX = 4
};

// Enum Solarland.ENgaiMLType
enum class ENgaiMLType : uint8 {
	None = 0,
	OnlyImitationLearning = 1,
	OnlyReinforcementLearning = 2,
	Both = 3,
	ENgaiMLType_MAX = 4
};

// Enum Solarland.EBotAIType
enum class EBotAIType : uint8 {
	BehaviorTree = 0,
	ImitationLearning = 1,
	ReinforcementLearning = 2,
	MAX = 3
};

// Enum Solarland.EPopLocationType
enum class EPopLocationType : uint8 {
	Default = 0,
	ShowFight = 1,
	Guarantee = 2,
	EPopLocationType_MAX = 3
};

// Enum Solarland.ESolarBotTimelineTriggerAction
enum class ESolarBotTimelineTriggerAction : uint8 {
	None = 0,
	Add = 1,
	Remove = 2,
	Clear = 3,
	ESolarBotTimelineTriggerAction_MAX = 4
};

// Enum Solarland.ESolarBotTimelineFilterParameterType
enum class ESolarBotTimelineFilterParameterType : uint8 {
	None = 0,
	MoreThan = 1,
	LessThan = 2,
	Equal = 3,
	NotEqual = 4,
	Contain = 5,
	NotContain = 6,
	Radius = 7,
	Target = 8,
	ESolarBotTimelineFilterParameterType_MAX = 9
};

// Enum Solarland.ESolarBotTimelineFilterType
enum class ESolarBotTimelineFilterType : uint8 {
	None = 0,
	RankPoint = 1,
	Equipment = 2,
	Disengagement = 3,
	KillNum = 4,
	DamageNum = 5,
	ItemNum = 6,
	SkillCoolingDown = 7,
	SurroundingTeammate = 8,
	SurroundingEnemy = 9,
	ESolarBotTimelineFilterType_MAX = 10
};

// Enum Solarland.ESolarBotTimelineAIDataSettingType
enum class ESolarBotTimelineAIDataSettingType : uint8 {
	None = 0,
	Health = 1,
	Shield = 2,
	ESolarBotTimelineAIDataSettingType_MAX = 3
};

// Enum Solarland.ESolarBotTimelineWeaponPartType
enum class ESolarBotTimelineWeaponPartType : uint8 {
	None = 0,
	Muzzle = 1,
	Grip = 2,
	Clip = 3,
	Scope = 4,
	GunStock = 5,
	ESolarBotTimelineWeaponPartType_MAX = 6
};

// Enum Solarland.ESolarBotTimelineEquipmentSettingType
enum class ESolarBotTimelineEquipmentSettingType : uint8 {
	None = 0,
	PrimaryWeapon = 1,
	SecondaryWeapon = 2,
	Shield = 3,
	VerticalJet = 4,
	HorizontalJet = 5,
	SummonGun = 6,
	ESolarBotTimelineEquipmentSettingType_MAX = 7
};

// Enum Solarland.ESolarBotTimelineTriggerType
enum class ESolarBotTimelineTriggerType : uint8 {
	None = 0,
	Timeline = 1,
	Guarantee = 2,
	ESolarBotTimelineTriggerType_MAX = 3
};

// Enum Solarland.ESolarBotWarmSystemType
enum class ESolarBotWarmSystemType : uint8 {
	Regular = 0,
	Script = 1,
	Unknown = 2,
	ESolarBotWarmSystemType_MAX = 3
};

// Enum Solarland.EBotShotTargetCtlType
enum class EBotShotTargetCtlType : uint8 {
	Player = 0,
	Bot = 1,
	Any = 2,
	EBotShotTargetCtlType_MAX = 3
};

// Enum Solarland.EBotShotTargetType
enum class EBotShotTargetType : uint8 {
	Character = 0,
	Vehicle = 1,
	SummonItem = 2,
	Any = 3,
	EBotShotTargetType_MAX = 4
};

// Enum Solarland.EBotOnVehicleFireType
enum class EBotOnVehicleFireType : uint8 {
	EBotOnVehicleFireType_None = 0,
	EBotOnVehicleFireType_FireOn = 1,
	EBotOnVehicleFireType_FireOnDelayOff = 2,
	EBotOnVehicleFireType_MAX = 3
};

// Enum Solarland.EBotOnVehicleStopType
enum class EBotOnVehicleStopType : uint8 {
	EBotOnVehicleStopType_None = 0,
	EBotOnVehicleStopType_Delay = 1,
	EBotOnVehicleStopType_Stop = 2,
	EBotOnVehicleStopType_MAX = 3
};

// Enum Solarland.EBotFirePolicy
enum class EBotFirePolicy : uint8 {
	AlwaysFire = 0,
	FirstRoughMoveDone = 1,
	FirstPreciseMoveDone = 2,
	PreciseMoveOrGreater = 3,
	FollowMoveOrGreater = 4,
	OnlyWhenHitSimulatedTarget = 5,
	OnlyWhenHitLockedTarget = 6,
	EBotFirePolicy_MAX = 7
};

// Enum Solarland.EBotActionState
enum class EBotActionState : uint8 {
	EBotActionState_Sprite = 0,
	EBotActionState_Crouch = 1,
	EBotActionState_GunAim = 2,
	EBotActionState_MAX = 3
};

// Enum Solarland.EBotBunkerType
enum class EBotBunkerType : uint8 {
	Invalid = 0,
	FullSize = 1,
	HalfSize = 2,
	EBotBunkerType_MAX = 3
};

// Enum Solarland.EBotTeamVehicleDrivePolicy
enum class EBotTeamVehicleDrivePolicy : uint8 {
	DirectlyMove = 0,
	HoldAndWaitPassenger = 1,
	MoveAndTakePassenger = 2,
	EBotTeamVehicleDrivePolicy_MAX = 3
};

// Enum Solarland.EPoisonResponseType
enum class EPoisonResponseType : uint8 {
	NoResponse = 0,
	LowPriority = 1,
	HighPriority = 2,
	Immediately = 3,
	EPoisonResponseType_MAX = 4
};

// Enum Solarland.ESolarTaskScoringItemType
enum class ESolarTaskScoringItemType : uint8 {
	None = 0,
	CurrentHP = 1,
	IfSelfInBattle = 2,
	IfSelfInSafeArea = 3,
	IfSelfInPoisonCircle = 4,
	TimeToEnterSafeArea = 5,
	TimeToEnterPoisonCircleXPoisonDamage = 6,
	IfRelativeActorInSafeArea = 7,
	IfRelativeActorInPoisonCircle = 8,
	IfRescueTargetIsPlayer = 9,
	TimeToMovetoRescueTarget = 10,
	DistanceFromRescueTargetToSafeArea = 11,
	DistanceFromRescueTargetToPoisonCircleXPoisonDamage = 12,
	IfRescuingThisTarget = 13,
	IfRescuingOtherTarget = 14,
	TimePoisonToRescueTarget = 15,
	CurrentPoisonDamage = 16,
	ESolarTaskScoringItemType_MAX = 17
};

// Enum Solarland.ESolarTeamTaskType
enum class ESolarTeamTaskType : uint8 {
	RescueTeammate = 0,
	ESolarTeamTaskType_MAX = 1
};

// Enum Solarland.EJetTaskFinishMode
enum class EJetTaskFinishMode : uint8 {
	AfterResponded = 0,
	AfterDone = 1,
	EJetTaskFinishMode_MAX = 2
};

// Enum Solarland.EJetPackMode
enum class EJetPackMode : uint8 {
	Horizontal = 0,
	Vertical = 1,
	EJetPackMode_MAX = 2
};

// Enum Solarland.EJumpTaskFinishMode
enum class EJumpTaskFinishMode : uint8 {
	AfterResponded = 0,
	AfterApex = 1,
	AfterDone = 2,
	EJumpTaskFinishMode_MAX = 3
};

// Enum Solarland.EBotShootTargetType
enum class EBotShootTargetType : uint8 {
	Player = 0,
	Bot = 1,
	Vehicle = 2,
	Monster = 3,
	EBotShootTargetType_MAX = 4
};

// Enum Solarland.ECameraShakeDurationType
enum class ECameraShakeDurationType : uint8 {
	Fixed = 0,
	Infinite = 1,
	Custom = 2,
	ECameraShakeDurationType_MAX = 3
};

// Enum Solarland.ECameraShakeUpdateResultFlags
enum class ECameraShakeUpdateResultFlags : uint8 {
	ApplyAsAbsolute = 1,
	SkipAutoScale = 2,
	SkipAutoPlaySpace = 4,
	Default = 0,
	ECameraShakeUpdateResultFlags_MAX = 5
};

// Enum Solarland.ECameraShakePlaySpace
enum class ECameraShakePlaySpace : uint8 {
	CameraLocal = 0,
	World = 1,
	UserDefined = 2,
	ECameraShakePlaySpace_MAX = 3
};

// Enum Solarland.ECruiseStatePrivate
enum class ECruiseStatePrivate : uint8 {
	None = 0,
	Start = 1,
	CanParachute = 2,
	ForceParachute = 3,
	End = 4,
	ECruiseStatePrivate_MAX = 5
};

// Enum Solarland.EAntiCheatType
enum class EAntiCheatType : uint8 {
	CheckLastShotWeapon = 0,
	ShootWhileNoAmmo = 1,
	ShootIntervalInvalid = 2,
	InvalidLaser = 3,
	ShootWhileOverload = 4,
	CheckRealShot = 5,
	VerifyHitInValid = 6,
	ReloadTooFast = 7,
	CanisterShotAbnormal = 8,
	EAntiCheatType_MAX = 9
};

// Enum Solarland.ERoleAbilityCancelPhase
enum class ERoleAbilityCancelPhase : uint8 {
	None = 0,
	Pressing = 1,
	Continuous = 2,
	All = 3,
	ERoleAbilityCancelPhase_MAX = 4
};

// Enum Solarland.CharacterRoleAbilityEnum
enum class CharacterRoleAbilityEnum : uint8 {
	Super = 0,
	Tactical = 1,
	Count = 2,
	CharacterRoleAbilityEnum_MAX = 3
};

// Enum Solarland.EMovementComponentEnableType
enum class EMovementComponentEnableType : uint8 {
	Default = 0,
	Dying = 1,
	OnLevelStreaming = 2,
	EMovementComponentEnableType_MAX = 3
};

// Enum Solarland.EHitTraceType
enum class EHitTraceType : uint8 {
	None = 0,
	Sniper = 1,
	Default = 2,
	Bump = 3,
	Vehicle = 4,
	EHitTraceType_MAX = 5
};

// Enum Solarland.EAntiCheatGameEvents
enum class EAntiCheatGameEvents : uint8 {
	ServerFire = 0,
	ServerHit = 1,
	ServerKill = 2,
	ServerKilled = 3,
	ClientFire = 4,
	ClientHit = 5,
	ClientKill = 6,
	ClientKilled = 7,
	ClientHitDown = 8,
	ClientBeHitDown = 9,
	ClientTick = 10,
	ServerTick = 11,
	ClientBeginPlay = 12,
	ServerBeginPlay = 13,
	ClientEndPlay = 14,
	ServerEndPlay = 15,
	EventMax = 16,
	EAntiCheatGameEvents_MAX = 17
};

// Enum Solarland.EClipAttachType
enum class EClipAttachType : uint8 {
	Weapon = 0,
	CharacterLeftHand = 1,
	CharacterRightHand = 2,
	EClipAttachType_MAX = 3
};

// Enum Solarland.EAnimReloadNotifyType
enum class EAnimReloadNotifyType : uint8 {
	InHand = 0,
	InHandAndDrop = 1,
	GetOld = 2,
	InPocket = 3,
	Restore = 4,
	SpawnFakeOldClip = 5,
	PhysicsDropOldClip = 6,
	SpawnFakeNewClip = 7,
	RestoreClip = 8,
	EAnimReloadNotifyType_MAX = 9
};

// Enum Solarland.EWeaponSystemState
enum class EWeaponSystemState : uint8 {
	None = 0,
	PreReload = 1,
	PreOpenScope = 2,
	PreCloseScope = 3,
	PreFire = 4,
	PreSwitchWeapon = 5,
	PreDropCurrentWeapon = 6,
	PreFireOverload = 7,
	PreNeedBolt = 8,
	PreCharging = 9,
	PreReplaceWeapon = 10,
	PrePickupWeapon = 11,
	PreSwapWeapon = 12,
	Max = 13
};

// Enum Solarland.ECamShakeType
enum class ECamShakeType : uint8 {
	Default = 0,
	JumpBegin = 1,
	JumpEndLight = 2,
	JumpEndHeavy = 3,
	FullBodyMeleeWithTarget = 4,
	FullBodyMeleeWithoutTarget = 5,
	TacticalDodgeForward = 6,
	TacticalDodgeBackward = 7,
	TacticalDodgeLeft = 8,
	TacticalDodgeRight = 9,
	ECamShakeType_MAX = 10
};

// Enum Solarland.EGunsightCameraSwitchMode
enum class EGunsightCameraSwitchMode : uint8 {
	CloseScope = 0,
	CloseShoulderShot = 1,
	OpenShoulderShot = 2,
	OpenScope = 3,
	EGunsightCameraSwitchMode_MAX = 4
};

// Enum Solarland.ESolarCameraSmoothType
enum class ESolarCameraSmoothType : uint8 {
	Default = 0,
	Instant = 1,
	Constant = 2,
	EaseOut = 3,
	EaseInEaseOut = 4,
	FloatCurve = 5,
	ESolarCameraSmoothType_MAX = 6
};

// Enum Solarland.EReconnectionStatus
enum class EReconnectionStatus : uint8 {
	None = 0,
	Reconnecting = 1,
	Reconnected = 2,
	EReconnectionStatus_MAX = 3
};

// Enum Solarland.EAnimDirection
enum class EAnimDirection : uint8 {
	AnimNone = 0,
	AnimForward = 1,
	AnimBackward = 2,
	AnimLeft = 3,
	AnimRight = 4,
	EAnimDirection_MAX = 5
};

// Enum Solarland.ESkydiveEffectLifetime
enum class ESkydiveEffectLifetime : uint8 {
	DuringFlying = 0,
	DuringLanding = 1,
	DuringWholeSkydiving = 2,
	ESkydiveEffectLifetime_MAX = 3
};

// Enum Solarland.RoleAbilityCommitPhase
enum class RoleAbilityCommitPhase : uint8 {
	OnActive = 0,
	Custom = 1,
	RoleAbilityCommitPhase_MAX = 2
};

// Enum Solarland.EUpdateWarmServiceEventType
enum class EUpdateWarmServiceEventType : uint8 {
	None = 0,
	CharacterUpgrade = 1,
	WeaponUpgrade = 2,
	ShieldUpgrade = 3,
	SuperAbilityReady = 4,
	TacticalAbilityReady = 5,
	BattleStation = 6,
	EUpdateWarmServiceEventType_MAX = 7
};

// Enum Solarland.EMassInVisibilityWarningType
enum class EMassInVisibilityWarningType : uint8 {
	None = 0,
	Character = 1,
	Vehicle = 2,
	EMassInVisibilityWarningType_MAX = 3
};

// Enum Solarland.EHitRecoverType
enum class EHitRecoverType : uint8 {
	EHRT_Normal = 0,
	EHRT_DeathVerge = 1,
	EHRT_MAX = 2
};

// Enum Solarland.EBResurrectionState
enum class EBResurrectionState : uint8 {
	NoneState = 0,
	WaitForApply = 1,
	NotApply = 2,
	Resurrected = 3,
	WaitForResurrect = 4,
	GiveUp = 5,
	Timeout = 6,
	AllTeammatesDied = 7,
	EBResurrectionState_MAX = 8
};

// Enum Solarland.EDroppedItemType
enum class EDroppedItemType : uint8 {
	Weapons = 0,
	WeaponParts = 1,
	Consumables = 2,
	Equipments = 3,
	EDroppedItemType_MAX = 4
};

// Enum Solarland.EBagScopeSlotType
enum class EBagScopeSlotType : uint8 {
	None = 0,
	Primary = 10,
	Second = 11,
	Bag = 12,
	EBagScopeSlotType_MAX = 13
};

// Enum Solarland.EBagGridType
enum class EBagGridType : uint8 {
	None = 0,
	Pick = 1,
	Normal = 2,
	Lock = 3,
	Fix = 4,
	EBagGridType_MAX = 5
};

// Enum Solarland.ETreatmentSoundType
enum class ETreatmentSoundType : uint8 {
	Healing = 0,
	Cancel = 1,
	StopHealing = 2,
	Completed = 3,
	ETreatmentSoundType_MAX = 4
};

// Enum Solarland.EShieldAutoRechargeStopReason
enum class EShieldAutoRechargeStopReason : uint8 {
	SwitchShield = 0,
	OnWeaponFire = 1,
	OnHit = 2,
	Die = 3,
	ShieldFull = 4,
	ManualRecharge = 5,
	EShieldAutoRechargeStopReason_MAX = 6
};

// Enum Solarland.ECharacterStateForWeapon
enum class ECharacterStateForWeapon : uint8 {
	Unknown = 0,
	Standing = 1,
	Crouching = 2,
	Running = 3,
	Sprinting = 4,
	Jumping = 5,
	Flying = 6,
	ECharacterStateForWeapon_MAX = 7
};

// Enum Solarland.EPoseMode
enum class EPoseMode : uint8 {
	Stand = 0,
	Crouch = 1,
	Crawl = 2,
	Skydive = 3,
	EPoseMode_MAX = 4
};

// Enum Solarland.EPickUpTargetType
enum class EPickUpTargetType : uint8 {
	Invalid = 0,
	Item = 1,
	Weapon = 2,
	TreasureItem = 3,
	HomeItem = 4,
	BoxHomeItem = 5,
	EPickUpTargetType_MAX = 6
};

// Enum Solarland.ESolarExpBehaviorType
enum class ESolarExpBehaviorType : uint8 {
	SurvivalTime = 1,
	Kills = 2,
	Assists = 3,
	Selfhealing = 4,
	TeammateHealing = 5,
	Unpacking = 6,
	CollectElectricity = 7,
	PickExpPack = 8,
	EveryDamageDealt = 9,
	ESolarExpBehaviorType_MAX = 10
};

// Enum Solarland.ESolarCheckButtonSelectType
enum class ESolarCheckButtonSelectType : uint8 {
	None = 0,
	Next = 1,
	Prev = 2,
	ESolarCheckButtonSelectType_MAX = 3
};

// Enum Solarland.EClassLevelUpRewardType
enum class EClassLevelUpRewardType : uint8 {
	BattleUpgradeEffect = 0,
	UpgradeSkill1 = 1,
	UpgradeSkill2 = 2,
	ClassCommonPassiveSkill = 3,
	ClassSpecificPassiveSkill = 4,
	Max = 5
};

// Enum Solarland.EClassType
enum class EClassType : uint8 {
	None = 0,
	Assault = 1,
	Defence = 2,
	Support = 3,
	Scout = 4,
	EClassType_MAX = 5
};

// Enum Solarland.ESolarCrosshairType
enum class ESolarCrosshairType : uint8 {
	Weapon = 0,
	Feedback = 1,
	BulletContainer = 2,
	ESolarCrosshairType_MAX = 3
};

// Enum Solarland.ESolarDamageTextType
enum class ESolarDamageTextType : uint8 {
	DamageTextType_None = 0,
	DamageTextType_Common = 1,
	DamageTextType_Headshot = 2,
	DamageTextType_HitShield = 3,
	DamageTextType_HeadshotWithShield = 4,
	DamageTextType_HitVehicle = 5,
	DamageTextType_HitVehicleWeak = 6,
	DamageTextType_BrokenShiled = 7,
	DamageTextType_BrokenShieldWithHeadShot = 8,
	DamageTextType_HitSummonItem = 9,
	DamageTextType_MAX = 10
};

// Enum Solarland.EUIDragSourceType
enum class EUIDragSourceType : uint8 {
	Default = 0,
	Weapon1 = 1,
	Weapon2 = 2,
	Weapon3 = 3,
	PickupList = 4,
	BackpackConsumable = 5,
	BackpackEquip = 6,
	BackpackPickupList = 7,
	EUIDragSourceType_MAX = 8
};

// Enum Solarland.EShopStatisticType
enum class EShopStatisticType : uint8 {
	OnActivated = 0,
	OnUpgradeWeapon = 1,
	OnPurchaseItem = 2,
	OnItemRefresh = 3,
	OnUpgradeShield = 4,
	EShopStatisticType_MAX = 5
};

// Enum Solarland.EShopModelAnimType
enum class EShopModelAnimType : uint8 {
	Idle = 0,
	Upgrade = 1,
	Purchase = 2,
	EShopModelAnimType_MAX = 3
};

// Enum Solarland.AIVehicleState
enum class AIVehicleState : uint8 {
	AIVehicleState_Forward = 0,
	AIVehicleState_ReverseSolveBlock = 1,
	AIVehicleState_SolveBlockFoward = 2,
	AIVehicleState_ReverseToTarget = 3,
	AIVehicleState_MAX = 4
};

// Enum Solarland.EAntiCheatReportType
enum class EAntiCheatReportType : uint8 {
	Player = 0,
	Weapon = 1,
	Vehicle = 2,
	EAntiCheatReportType_MAX = 3
};

// Enum Solarland.EActiveEffectDurationChangeProxy
enum class EActiveEffectDurationChangeProxy : uint8 {
	MaintainCurrent = 0,
	MaintainRemain = 1,
	ScalingCurrent = 2,
	EActiveEffectDurationChangeProxy_MAX = 3
};

// Enum Solarland.ESolarGAInputID
enum class ESolarGAInputID : uint8 {
	None = 0,
	Jump = 1,
	Crouch = 2,
	Sprint = 3,
	JetVertical = 4,
	JetHorizontal = 5,
	Parachute = 6,
	SkydiveAccelerate = 7,
	Fire = 8,
	OutVehicle = 9,
	SkillTest = 10,
	RoleSkillOne = 11,
	RoleSkillTwo = 12,
	ESolarGAInputID_MAX = 13
};

// Enum Solarland.ELogChannel
enum class ELogChannel : uint8 {
	General = 0,
	Mode = 1,
	Hunt = 2,
	BattleRoyal = 3,
	Weapon = 4,
	Character = 5,
	Vehicle = 6,
	Camera = 7,
	Animation = 8,
	Physics = 9,
	Inventory = 10,
	World = 11,
	ELogChannel_MAX = 12
};

// Enum Solarland.ESolarGameUserSettingPart
enum class ESolarGameUserSettingPart : uint8 {
	PickupSettings = 0,
	GraphicsSettings = 1,
	WeaponSettings = 2,
	LanguageSettings = 3,
	SoundSettings = 4,
	BasicSettings = 5,
	PersonalitySettings = 6,
	SensitivitySettings = 7,
	ShakeSettings = 8,
	DriverSettings = 9,
	ChatOperatorSettings = 10,
	SensitivitySettingsKeyboard = 11,
	SensitivitySettingsGamepad = 12,
	KeyboardControlSettings = 13,
	GamepadSettings = 14,
	GamepadAdvancedSettings = 15,
	All = 16,
	ESolarGameUserSettingPart_MAX = 17
};

// Enum Solarland.EGraphicQualitySelect
enum class EGraphicQualitySelect : uint8 {
	Default = 0,
	Lobby = 1,
	InGame = 2,
	EGraphicQualitySelect_MAX = 3
};

// Enum Solarland.ESolarAimModeType
enum class ESolarAimModeType : uint8 {
	Default = 0,
	Change = 1,
	Press = 2,
	ESolarAimModeType_MAX = 3
};

// Enum Solarland.ESolarDeviceType
enum class ESolarDeviceType : uint8 {
	ESDT_Invalid = 0,
	ESDT_Windows = 1,
	ESDT_Android = 2,
	ESDT_IOS = 3,
	ESDT_Switch = 4,
	ESDT_Other = 5,
	ESDT_MAX = 6
};

// Enum Solarland.ESolarDeviceLevel
enum class ESolarDeviceLevel : uint8 {
	ESDL_Invalid = 0,
	ESDL_Level1 = 1,
	ESDL_Level2 = 2,
	ESDL_Level3 = 3,
	ESDL_Level4 = 4,
	ESDL_Level5 = 5,
	ESDL_Level6 = 6,
	ESDL_Level7 = 7,
	ESDL_VALUE_MIN = 1,
	ESDL_VALUE_MAX = 7,
	ESDL_MAX = 8
};

// Enum Solarland.EHomeCameraMode
enum class EHomeCameraMode : uint8 {
	Normal = 0,
	Ceiling = 1,
	Panoramic = 2,
	Orthographic = 3,
	EHomeCameraMode_MAX = 4
};

// Enum Solarland.EHomeLoadingChangeType
enum class EHomeLoadingChangeType : uint8 {
	NONE = 0,
	OPEN = 1,
	CLOSE = 2,
	EHomeLoadingChangeType_MAX = 3
};

// Enum Solarland.EHomeOperationType
enum class EHomeOperationType : uint8 {
	NONE = 0,
	CREATE = 1,
	UPDATE = 2,
	REMOVE = 3,
	EHomeOperationType_MAX = 4
};

// Enum Solarland.EHomeDragUIType
enum class EHomeDragUIType : uint8 {
	NONE = 0,
	ARROW = 1,
	ROUND = 2,
	EHomeDragUIType_MAX = 3
};

// Enum Solarland.EHomeActorOwner
enum class EHomeActorOwner : uint8 {
	NOBODY = 0,
	SELF = 1,
	OTHERS = 2,
	EHomeActorOwner_MAX = 3
};

// Enum Solarland.EHomeActorSurfaceDir
enum class EHomeActorSurfaceDir : uint8 {
	NONE = 0,
	FORWARD = 1,
	BACKWARD = 2,
	LEFT = 3,
	RIGHT = 4,
	UP = 5,
	DOWN = 6,
	EHomeActorSurfaceDir_MAX = 7
};

// Enum Solarland.EHomeActor_SecondType
enum class EHomeActor_SecondType : uint8 {
	NONE = 0,
	CONSTRUCT_BASE = 1,
	CONSTRUCT_FLOOR = 2,
	CONSTRUCT_WALL = 3,
	DEVICE_ON_FLOOR = 4,
	DEVICE_ON_WALL = 5,
	DEVICE_ON_CEILING = 6,
	EHomeActor_MAX = 7
};

// Enum Solarland.EHomeActor_FirstType
enum class EHomeActor_FirstType : uint8 {
	NONE = 0,
	CONSTRUCT = 1,
	DEVICE = 2,
	EHomeActor_MAX = 3
};

// Enum Solarland.EHoverCraftHitType
enum class EHoverCraftHitType : uint8 {
	Default = 0,
	HoverCraftVehicle = 1,
	HoverVehicle = 2,
	LeggedVehicle = 3,
	WheeledVehicle = 4,
	EHoverCraftHitType_MAX = 5
};

// Enum Solarland.EInputKeyMappingType
enum class EInputKeyMappingType : uint8 {
	KeyAndMouse1 = 0,
	KeyAndMouse2 = 1,
	Gamepad = 2,
	Count = 3,
	EInputKeyMappingType_MAX = 4
};

// Enum Solarland.EInputActionContextType
enum class EInputActionContextType : uint8 {
	Pawn = 0,
	Controller = 1,
	LevelScriptActor = 2,
	UserWidget = 3,
	Count = 4,
	EInputActionContextType_MAX = 5
};

// Enum Solarland.EGamepadDPad
enum class EGamepadDPad : uint8 {
	None = 0,
	Reset = 1,
	Up = 2,
	Down = 3,
	Right = 4,
	Left = 5,
	EGamepadDPad_MAX = 6
};

// Enum Solarland.EInputActionFlags
enum class EInputActionFlags : uint8 {
	None = 0,
	FlagBigMap = 1,
	FlagBackpack = 2,
	FlagChatWheel = 3,
	FlagParachute = 4,
	FlagSpectate = 5,
	FlagTeamDeath = 6,
	FlagRelive = 7,
	FlagBlockAll = 31,
	FlagMax = 32,
	EInputActionFlags_MAX = 33
};

// Enum Solarland.ESolarInteractionType
enum class ESolarInteractionType : uint8 {
	Invalid = 0,
	RescueTeammate = 1,
	ReviveTeammate = 2,
	OpenAirdrop = 3,
	ESolarInteractionType_MAX = 4
};

// Enum Solarland.ESolarItemPrivilegeType
enum class ESolarItemPrivilegeType : uint8 {
	NONE = 0,
	NETBAR = 1,
	ESolarItemPrivilegeType_MAX = 2
};

// Enum Solarland.ESolarItemShowType
enum class ESolarItemShowType : uint8 {
	NOTSHOW = 0,
	SHOW = 1,
	ESolarItemShowType_MAX = 2
};

// Enum Solarland.ESolarRedHintType
enum class ESolarRedHintType : uint8 {
	ZERO = 0,
	SHOW = 1,
	HIDE = 2,
	ESolarRedHintType_MAX = 3
};

// Enum Solarland.ESolarItemOwnType
enum class ESolarItemOwnType : uint8 {
	ZERO = 0,
	NOOWN = 1,
	OWN = 2,
	ESolarItemOwnType_MAX = 3
};

// Enum Solarland.ESolarItemBuyType
enum class ESolarItemBuyType : uint8 {
	ZERO = 0,
	NOBUY = 1,
	BUY = 2,
	CANTBUY = 3,
	ESolarItemBuyType_MAX = 4
};

// Enum Solarland.ESolarItemUseType
enum class ESolarItemUseType : uint8 {
	ZERO = 0,
	NOUSE = 1,
	USING = 2,
	ESolarItemUseType_MAX = 3
};

// Enum Solarland.ESolarItemLimitType
enum class ESolarItemLimitType : uint8 {
	ZERO = 0,
	NOLIMIT = 1,
	LIMITING = 2,
	ESolarItemLimitType_MAX = 3
};

// Enum Solarland.ESolarItemMarkType
enum class ESolarItemMarkType : uint8 {
	ZERO = 0,
	NOMARK = 1,
	MARKED = 2,
	ESolarItemMarkType_MAX = 3
};

// Enum Solarland.ESolarItemDownloadType
enum class ESolarItemDownloadType : uint8 {
	ZERO = 0,
	NOTDOWNLOAD = 1,
	DOWNLOADING = 2,
	DOWNLOADED = 3,
	PAUSING = 4,
	ESolarItemDownloadType_MAX = 5
};

// Enum Solarland.ESolarItemLockType
enum class ESolarItemLockType : uint8 {
	ZERO = 0,
	NOLOCK = 1,
	LOCKED = 2,
	TEMPUNLOCK = 3,
	ESolarItemLockType_MAX = 4
};

// Enum Solarland.ESolarItemSelectType
enum class ESolarItemSelectType : uint8 {
	ZERO = 0,
	NOTSELECT = 1,
	SELECTED = 2,
	ESolarItemSelectType_MAX = 3
};

// Enum Solarland.ESolarItemQualityType
enum class ESolarItemQualityType : uint8 {
	ZERO = 0,
	N = 1,
	R = 2,
	SR = 3,
	SSR = 4,
	SSRPLUS = 5,
	ESolarItemQualityType_MAX = 6
};

// Enum Solarland.EBurstMethod
enum class EBurstMethod : uint8 {
	ParabCurveFitting = 0,
	GoldenSpiral = 1,
	EBurstMethod_MAX = 2
};

// Enum Solarland.EItemConfirmID
enum class EItemConfirmID : int32 {
	DropExtraEnergyConfirmID = 110003,
	ReplaceExtraEnergyConfirmID = 110004,
	DropEnergyModuleConfirmID = 110007,
	ReplaceEnergyModuleConfirmID = 110008,
	EItemConfirmID_MAX = 110009
};

// Enum Solarland.EItemLocalTextID
enum class EItemLocalTextID : uint8 {
	LevelNumTextID = 40,
	EItemLocalTextID_MAX = 41
};

// Enum Solarland.EItemNoticeID
enum class EItemNoticeID : int32 {
	BoxBeUsing = 900016,
	CantEquipThisScope = 900080,
	CantEquipThisPart = 900081,
	WillEquipLowLevelScope = 900082,
	WillEquipLowLevelPart = 900083,
	HasBetterPart = 900084,
	HasBetterScope = 900085,
	GetItem = 900003,
	GetHomeItem = 900005,
	EquipReplace = 900091,
	DropItemNotAutoPickup = 900094,
	ItemMaxPile = 900095,
	ReviveItemMaxPile = 900104,
	CantPickupReviveItem = 900105,
	EItemNoticeID_MAX = 900106
};

// Enum Solarland.ESpawnStage
enum class ESpawnStage : uint8 {
	STAGE_NONE = 0,
	STAGE_READY = 1,
	STAGE_BATTLE = 2,
	STAGE_ALL = 3,
	STAGE_MAX = 4
};

// Enum Solarland.EOutcomeType
enum class EOutcomeType : uint8 {
	None = 0,
	Single = 1,
	Pool = 2,
	DynamicPool = 3,
	EOutcomeType_MAX = 4
};

// Enum Solarland.EItemSourceType
enum class EItemSourceType : uint8 {
	None = 0,
	DeathTreasureBox = 1,
	TreasureBox = 2,
	AirDropTreasureBox = 3,
	Max = 4
};

// Enum Solarland.EItemDiscardState
enum class EItemDiscardState : uint8 {
	EItemDiscardState_DEFAULT = 0,
	EItemDiscardState_DEATHBOX = 1,
	EItemDiscardState_MAX = 2
};

// Enum Solarland.EItemState
enum class EItemState : uint8 {
	EItemState_NONE = 0,
	EItemState_POSSESS = 1,
	EItemState_DISCARD = 2,
	EItemState_MAX = 3
};

// Enum Solarland.EItemQualityType
enum class EItemQualityType : uint8 {
	None = 0,
	White = 1,
	Green = 2,
	Blue = 3,
	Purple = 4,
	Orange = 5,
	Red = 6,
	EItemQualityType_MAX = 7
};

// Enum Solarland.ESpawnerLevel
enum class ESpawnerLevel : uint8 {
	LEVEL_1 = 0,
	LEVEL_2 = 1,
	LEVEL_3 = 2,
	LEVEL_4 = 3,
	LEVEL_MAX = 4
};

// Enum Solarland.ESpawnerType
enum class ESpawnerType : uint8 {
	NONE = 0,
	NORMAL = 1,
	TREASUREBOX = 2,
	AIRDROP = 3,
	VEHICLE = 4,
	ESpawnerType_MAX = 5
};

// Enum Solarland.OnLSDestroyStrategy
enum class OnLSDestroyStrategy : uint8 {
	Custom = 0,
	SelfDestroy = 1,
	FreeFall = 2,
	OnLSDestroyStrategy_MAX = 3
};

// Enum Solarland.OnLSModifiedStrategy
enum class OnLSModifiedStrategy : uint8 {
	Custom = 0,
	UpdateHeight = 1,
	OnLSModifiedStrategy_MAX = 2
};

// Enum Solarland.ELayoutDataType
enum class ELayoutDataType : uint8 {
	Invalid = 0,
	Mobile = 1,
	Desktop = 2,
	ELayoutDataType_MAX = 3
};

// Enum Solarland.EWalkingDirection
enum class EWalkingDirection : uint8 {
	None = 0,
	Forward = 1,
	Backward = 2,
	Left = 4,
	Right = 8,
	EWalkingDirection_MAX = 9
};

// Enum Solarland.EVehicleShrinkCapsuleExtent
enum class EVehicleShrinkCapsuleExtent : uint8 {
	SHRINK_None = 0,
	SHRINK_RadiusCustom = 1,
	SHRINK_HeightCustom = 2,
	SHRINK_AllCustom = 3,
	SHRINK_MAX = 4
};

// Enum Solarland.EVehicleLocomotionState
enum class EVehicleLocomotionState : uint8 {
	Walk = 0,
	Run = 1,
	Sprint = 2,
	Max = 3
};

// Enum Solarland.ESolarBuildConfiguration
enum class ESolarBuildConfiguration : uint8 {
	Unknown = 0,
	Debug = 1,
	Development = 2,
	Shipping = 3,
	Test = 4,
	ESolarBuildConfiguration_MAX = 5
};

// Enum Solarland.EElementVisibilityType
enum class EElementVisibilityType : uint8 {
	Visible = 0,
	Hidden = 1,
	EElementVisibilityType_MAX = 2
};

// Enum Solarland.EElementStateType
enum class EElementStateType : uint8 {
	Normal = 0,
	Suspend = 1,
	EElementStateType_MAX = 2
};

// Enum Solarland.ESolarMapElementPropertyType
enum class ESolarMapElementPropertyType : uint8 {
	String = 0,
	Float = 1,
	Int = 2,
	Bool = 3,
	ESolarMapElementPropertyType_MAX = 4
};

// Enum Solarland.ESGameMode_ElementType
enum class ESGameMode_ElementType : uint8 {
	PlayerStart = 0,
	ItemSpawner = 1,
	AirDrop = 2,
	ChargingPile = 3,
	JumpPad = 4,
	CarPad = 5,
	Vehicle = 6,
	Poison = 7,
	Custom = 8,
	ESGameMode_MAX = 9
};

// Enum Solarland.EMapDarkDataType
enum class EMapDarkDataType : uint8 {
	POISONCIRCLE = 0,
	EMapDarkDataType_MAX = 1
};

// Enum Solarland.EMapAirlineType
enum class EMapAirlineType : uint8 {
	Default = 0,
	Capsule = 1,
	Airdrop = 2,
	EMapAirlineType_MAX = 3
};

// Enum Solarland.EDirection
enum class EDirection : uint8 {
	TOP = 0,
	BOTTOM = 1,
	LEFT = 2,
	RIGHT = 3,
	EDirection_MAX = 4
};

// Enum Solarland.EBattlePromptType
enum class EBattlePromptType : uint8 {
	None = 0,
	Player = 1,
	Vehicle = 4,
	Move = 8,
	Fire = 16,
	HeavyWeapon = 32,
	Crouch = 64,
	Skydive = 128,
	PlayerStep = 9,
	VehicleMove = 12,
	PlayerCrouchMove = 73,
	PlayerSkydive = 137,
	PlayerFire = 17,
	VehicleFire = 20,
	PlayerHeavyFire = 49,
	VehicleHeavyFire = 52,
	EBattlePromptType_MAX = 138
};

// Enum Solarland.EMarkerType
enum class EMarkerType : uint8 {
	NONE = 0,
	ENEMYSTEP = 101,
	ENEMYFIGHT = 102,
	AIRDROPBOX = 103,
	REDZONE = 104,
	VEHICLEVOICE = 105,
	VEHICLEMARK = 106,
	ENEMYLAUNCH = 107,
	VEHICLELAUNCH = 108,
	SKILLBUFFMARK = 109,
	RADARCharacter = 110,
	RADARCharacterWithAngle = 111,
	RADARVehicle = 112,
	RADARTreasureBox = 113,
	RADARChargingPile = 114,
	RADAR = 115,
	ELECTRICSHOP = 116,
	PARACHUTE = 117,
	RESPAWN = 118,
	SHIELDUPGRADEITEMSHOP = 119,
	ReviveTeammate = 120,
	BLUECIRCLE = 121,
	EMarkerType_MAX = 122
};

// Enum Solarland.EMovablePadLimitationFlag
enum class EMovablePadLimitationFlag : uint8 {
	None = 0,
	NoPress = 1,
	NoRelease = 2,
	NoMove = 4,
	NoPressAndRelease = 3,
	NoPressAndMove = 5,
	NoReleaseAndMove = 6,
	EMovablePadLimitationFlag_MAX = 7
};

// Enum Solarland.ENavLinkType
enum class ENavLinkType : uint8 {
	Jet = 0,
	Vault = 1,
	None = 2,
	ENavLinkType_MAX = 3
};

// Enum Solarland.EOwnerType
enum class EOwnerType : uint8 {
	None = 0,
	Vehicle = 1,
	TreasureBox = 2,
	EOwnerType_MAX = 3
};

// Enum Solarland.ERestState
enum class ERestState : uint8 {
	AT_REST = 0,
	JUST_STARTED_MOVING = 1,
	MOVING = 2,
	ERestState_MAX = 3
};

// Enum Solarland.EExtrapolationMode
enum class EExtrapolationMode : uint8 {
	UNLIMITED = 0,
	LIMITED = 1,
	NONE = 2,
	EExtrapolationMode_MAX = 3
};

// Enum Solarland.ESyncMode
enum class ESyncMode : uint8 {
	NONE = 0,
	X = 1,
	Y = 2,
	Z = 4,
	XY = 3,
	XZ = 5,
	YZ = 6,
	XYZ = 7,
	ESyncMode_MAX = 8
};

// Enum Solarland.ENightComesState
enum class ENightComesState : uint8 {
	None = 0,
	Begin = 1,
	Ongoing = 2,
	End = 3,
	ENightComesState_MAX = 4
};

// Enum Solarland.EPerceivableEffectAreaTendency
enum class EPerceivableEffectAreaTendency : uint8 {
	Hostile = 0,
	Neutral = 1,
	Friendly = 2,
	EPerceivableEffectAreaTendency_MAX = 3
};

// Enum Solarland.EPerceivableEffectAreaType
enum class EPerceivableEffectAreaType : uint8 {
	Unknow = 0,
	SmokeGrenade = 1,
	NightCome = 2,
	AutomaticTurret = 3,
	BlackHole = 4,
	Incendiary = 5,
	EnergyBubble = 6,
	SummonWall = 7,
	UAVShield = 8,
	UAVRescue = 9,
	HealPile = 10,
	EPerceivableEffectAreaType_MAX = 11
};

// Enum Solarland.EPickupListItemType
enum class EPickupListItemType : uint8 {
	None = 0,
	Single = 1,
	Merge = 2,
	Customize = 3,
	EPickupListItemType_MAX = 4
};

// Enum Solarland.EPickupListChangeReason
enum class EPickupListChangeReason : uint8 {
	Default = 0,
	Backpack = 1,
	Skill = 2,
	Weapon = 3,
	EPickupListChangeReason_MAX = 4
};

// Enum Solarland.ESolarPileType
enum class ESolarPileType : uint8 {
	ChargingPile = 0,
	HealPile = 1,
	ESolarPileType_MAX = 2
};

// Enum Solarland.EChargingChannel
enum class EChargingChannel : uint8 {
	MAIN = 0,
	EXTRA = 1,
	EChargingChannel_MAX = 2
};

// Enum Solarland.EPileHealingType
enum class EPileHealingType : uint8 {
	None = 0,
	Health = 1,
	Armor = 2,
	EPileHealingType_MAX = 3
};

// Enum Solarland.ELevelTickType
enum class ELevelTickType : uint8 {
	LEVELTICK_TimeOnly = 0,
	LEVELTICK_ViewportsOnly = 1,
	LEVELTICK_All = 2,
	LEVELTICK_PauseTick = 3,
	LEVELTICK_MAX = 4
};

// Enum Solarland.EInteractiveFlag
enum class EInteractiveFlag : uint8 {
	None = 0,
	DanceLearder = 1,
	EInteractiveFlag_MAX = 2
};

// Enum Solarland.ESolarPlayerSensitivitysType
enum class ESolarPlayerSensitivitysType : uint8 {
	None = 0,
	HoldWeaponSensitivity = 1,
	WeaponShootSensitivity = 2,
	WeaponShoulderNoShotSensitivity = 3,
	WeaponShoulderShotSensitivity = 4,
	WeaponSkillSensitivity = 5,
	SightSensitivity = 6,
	ScopeSensitivity = 7,
	ScopeShootSensitivity = 8,
	VehicleDriverSensitivity = 9,
	VehicleFireSensitivity = 10,
	SuperSkillSensitivity = 11,
	TacticalSkillSensitivity = 12,
	ESolarPlayerSensitivitysType_MAX = 13
};

// Enum Solarland.ECharacterOwnerType
enum class ECharacterOwnerType : uint8 {
	CSITNone = 0,
	CSITOwn = 1,
	CSITExperience = 2,
	CSITLimit = 4,
	CSITPrivilege = 8,
	ECharacterOwnerType_MAX = 9
};

// Enum Solarland.EWeaponAttachState
enum class EWeaponAttachState : uint8 {
	NONE = 0,
	AttachOnHand = 1,
	AttachOnBackpack = 2,
	EWeaponAttachState_MAX = 3
};

// Enum Solarland.EWeaponRVCmd
enum class EWeaponRVCmd : uint8 {
	Cmd_None = 0,
	LocalHold = 1,
	OtherHold = 2,
	Dropped = 4,
	ReplacePart = 8,
	SkinRefresh = 16,
	EWeaponRVCmd_MAX = 17
};

// Enum Solarland.EPreservedBotType
enum class EPreservedBotType : uint8 {
	PendingInit = 0,
	OnCall = 1,
	WaitingForSend = 2,
	Killer = 3,
	WaitingToDie = 4,
	EPreservedBotType_MAX = 5
};

// Enum Solarland.ESolarProjBulletCollisionType
enum class ESolarProjBulletCollisionType : uint8 {
	Shape = 0,
	Box = 1,
	ESolarProjBulletCollisionType_MAX = 2
};

// Enum Solarland.ERadarType
enum class ERadarType : uint8 {
	ERT_WholeMap = 0,
	ERT_FollowSpawner = 1,
	ERT_FixedRound = 2,
	ERT_UAV = 3,
	ERT_OneTimeScan = 4,
	ERT_MAX = 5
};

// Enum Solarland.ERedHintPath
enum class ERedHintPath : uint8 {
	None = 0,
	Root = 1,
	Social = 2,
	Arsenal = 3,
	Arsenal_Weapon = 4,
	Arsenal_Skin = 5,
	Arsenal_Part = 6,
	Shop = 7,
	Mail = 8,
	Capsulers = 9,
	Capsulers_Detail = 10,
	Capsulers_Story = 11,
	Capsulers_Skin = 12,
	Capsulers_LevelUp = 13,
	Capsulers_Pose = 14,
	Capsulers_PoseTab = 15,
	Capsulers_BG = 16,
	Capsulers_BGTab = 17,
	Capsulers_BGFrame = 18,
	Capsulers_BGFrameTab = 19,
	Capsulers_DeathBox = 20,
	Capsulers_DeathBoxTab = 21,
	Capsulers_Voice = 22,
	Capsulers_VoiceKillVoice = 23,
	Capsulers_VoiceTeamDie = 24,
	Capsulers_VoiceTopKill = 25,
	Capsulers_VoiceParachute = 26,
	Capsulers_VoiceBattleTab = 27,
	Capsulers_VoicePersonalityTab = 28,
	Capsulers_VoiceTab = 29,
	WareHouse = 30,
	Task = 31,
	Activity = 32,
	RankFight = 33,
	Achievement = 34,
	EditBusinessCard = 35,
	PlayerInfo = 36,
	GameMode = 37,
	Raffle = 38,
	Vehicle = 39,
	Vehicle_Skin = 40,
	Clan = 41,
	ClanPermission = 42,
	Collection = 43,
	Tournament = 44,
	VipCard = 45,
	ClanMember = 46,
	Max = 47
};

// Enum Solarland.ERedHintValueType
enum class ERedHintValueType : uint8 {
	Single = 0,
	MultiValue = 1,
	ERedHintValueType_MAX = 2
};

// Enum Solarland.ECharacterSkydivingState
enum class ECharacterSkydivingState : uint8 {
	EveryBattle = 0,
	Flying = 1,
	Skydiving = 2,
	Landing = 3,
	Num = 4,
	ECharacterSkydivingState_MAX = 5
};

// Enum Solarland.EReplayDamageSourceType
enum class EReplayDamageSourceType : uint8 {
	None = 0,
	Weapon = 1,
	Vehicle = 2,
	Skill = 3,
	EReplayDamageSourceType_MAX = 4
};

// Enum Solarland.ENarrateActivityType
enum class ENarrateActivityType : uint8 {
	None = 0,
	OnEngage = 1,
	OnScramble = 2,
	WeaponKnockdown = 3,
	VehicleKnockdown = 4,
	AbilityKnockdown = 5,
	OnKilled = 6,
	OnPickUpItem = 7,
	OnDriveVehicle = 8,
	OnGameStart = 9,
	OnChangeScene = 10,
	OnTeamEliminate = 11,
	OnReaperKilled = 12,
	OnVictory = 13,
	OnMultiKill = 14,
	OnChatInformative = 15,
	OnGameEnd = 16,
	OnInterrupt = 17,
	OnCheatKickOut = 18,
	ENarrateActivityType_MAX = 19
};

// Enum Solarland.EAutoDirectorActivityType
enum class EAutoDirectorActivityType : uint8 {
	None = 0,
	PlayerWeaponHit = 1,
	PlayerWeaponDown = 2,
	PlayerWeaponKill = 3,
	PickupItem = 4,
	DriveVehicle = 5,
	VehicleWeaponHit = 6,
	VehicleWeaponDown = 7,
	VehicleWeaponKill = 8,
	BandagePlayer = 9,
	RevivePlayer = 10,
	UseTacticalAbility = 11,
	UseUltimateAbility = 12,
	AbilityDown = 13,
	AbilityKill = 14,
	StartSkydive = 15,
	EAutoDirectorActivityType_MAX = 16
};

// Enum Solarland.EAutoDirectorCameraMode
enum class EAutoDirectorCameraMode : uint8 {
	Free = 0,
	Follow = 1,
	EAutoDirectorCameraMode_MAX = 2
};

// Enum Solarland.EReplayFindSpectateTargetApproach
enum class EReplayFindSpectateTargetApproach : uint8 {
	None = 0,
	SuggestTarget = 1,
	LastTarget = 2,
	ClosestToCamera = 3,
	FirstInPlayerList = 4,
	EReplayFindSpectateTargetApproach_MAX = 5
};

// Enum Solarland.EPlayerHighlightMarkType
enum class EPlayerHighlightMarkType : uint8 {
	B = 0,
	A = 1,
	S = 2,
	Ex = 3,
	Max = 4
};

// Enum Solarland.EClassRepNodeMapping
enum class EClassRepNodeMapping : uint8 {
	Missing = 0,
	NotRouted = 1,
	CustomRelevancy = 2,
	RelevantAllConnections = 3,
	Spatialize_Static = 4,
	Spatialize_Dynamic = 5,
	Spatialize_Dormancy = 6,
	EClassRepNodeMapping_MAX = 7
};

// Enum Solarland.EIncreaseAndDecreaseTransitionMode
enum class EIncreaseAndDecreaseTransitionMode : uint8 {
	Continuously = 0,
	BreakAndKeepLast = 1,
	EIncreaseAndDecreaseTransitionMode_MAX = 2
};

// Enum Solarland.EActorInSafeAreaStatus
enum class EActorInSafeAreaStatus : uint8 {
	InSafeArea = 0,
	NotInSafeArea = 1,
	InTargetSafeArea = 2,
	EActorInSafeAreaStatus_MAX = 3
};

// Enum Solarland.ESafeAreaStatus
enum class ESafeAreaStatus : uint8 {
	None = 0,
	WaitingForStart = 1,
	WaitingForShrink = 2,
	Shrink = 4,
	ShrinkEnd = 8,
	Pause = 16,
	End = 32,
	NoEffect = 33,
	ESafeAreaStatus_MAX = 34
};

// Enum Solarland.ENeverShowDuration
enum class ENeverShowDuration : uint8 {
	Day = 0,
	Week = 1,
	Month = 2,
	Year = 3,
	Never = 4,
	None = 5,
	ENeverShowDuration_MAX = 6
};

// Enum Solarland.EShieldUpgradeItemShopState
enum class EShieldUpgradeItemShopState : uint8 {
	None = 0,
	Upgrading = 1,
	Done = 2,
	EShieldUpgradeItemShopState_MAX = 3
};

// Enum Solarland.EParticleOptimization
enum class EParticleOptimization : uint8 {
	Origin = 0,
	LowPriorityOptimization = 1,
	MidPriorityOptimization = 2,
	HighPriorityOptimization = 3,
	UltraHighPriorityOptimization = 4,
	EParticleOptimization_MAX = 5
};

// Enum Solarland.ESolarEMPParticleType
enum class ESolarEMPParticleType : uint8 {
	FadeIn = 0,
	FadeOut = 1,
	Loop = 2,
	ESolarEMPParticleType_MAX = 3
};

// Enum Solarland.ESolarEMPForceFieldState
enum class ESolarEMPForceFieldState : uint8 {
	None = 0,
	Ready = 1,
	Active = 2,
	End = 3,
	ESolarEMPForceFieldState_MAX = 4
};

// Enum Solarland.ESolarDamageShapeType
enum class ESolarDamageShapeType : uint8 {
	Capsule = 0,
	Sphere = 1,
	Box = 2,
	ESolarDamageShapeType_MAX = 3
};

// Enum Solarland.ESolarSurroundLightningApplyType
enum class ESolarSurroundLightningApplyType : uint8 {
	SurroundLightningApplyType_Character = 0,
	SurroundLightningApplyType_Vehicle = 1,
	SurroundLightningApplyType_Other = 2,
	SurroundLightningApplyType_MAX = 3
};

// Enum Solarland.ESpectatorMode
enum class ESpectatorMode : uint8 {
	DeathWatch = 0,
	Replay = 1,
	ESpectatorMode_MAX = 2
};

// Enum Solarland.ESolarSummonItemType
enum class ESolarSummonItemType : uint8 {
	Default = 0,
	Skill_Tower = 1,
	ESolarSummonItemType_MAX = 2
};

// Enum Solarland.ETabControlListStyle
enum class ETabControlListStyle : uint8 {
	None = 0,
	Text = 1,
	Icon = 2,
	ETabControlListStyle_MAX = 3
};

// Enum Solarland.ETabControlListSlotType
enum class ETabControlListSlotType : uint8 {
	Leaf = 0,
	Compound = 1,
	ETabControlListSlotType_MAX = 2
};

// Enum Solarland.ESolarTablesEnum_CalculatingSign
enum class ESolarTablesEnum_CalculatingSign : uint8 {
	Plus = 0,
	Multiplication = 1,
	Equal = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Enum Solarland.ESolarTablesEnum_PartsType
enum class ESolarTablesEnum_PartsType : uint8 {
	Muzzle = 0,
	Scope = 1,
	Clip = 2,
	Runes = 3,
	Grip = 4,
	GunStock = 5,
	Scope2x = 6,
	Scope4x = 7,
	Scope8x = 8,
	_Count = 9,
	ESolarTablesEnum_MAX = 10
};

// Enum Solarland.ESolarTablesEnum_AccessoryType
enum class ESolarTablesEnum_AccessoryType : uint8 {
	WeaponParts = 0,
	WeaponAmmo = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Enum Solarland.ESolarTablesEnum_FireCostType
enum class ESolarTablesEnum_FireCostType : uint8 {
	Descrete = 0,
	Continuous = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Enum Solarland.ESolarTablesEnum_TriggerType
enum class ESolarTablesEnum_TriggerType : uint8 {
	KeyDown = 0,
	KeyUp = 1,
	KeyHold = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Enum Solarland.ESolarTablesEnum_TrajectoryType
enum class ESolarTablesEnum_TrajectoryType : uint8 {
	Line = 0,
	LineGravity = 1,
	Curve = 2,
	Canister = 3,
	Beam = 4,
	Rocket = 5,
	VirtualBullet = 6,
	_Count = 7,
	ESolarTablesEnum_MAX = 8
};

// Enum Solarland.ESolarTablesEnum_FireMethodType
enum class ESolarTablesEnum_FireMethodType : uint8 {
	Bullet = 0,
	Skill = 1,
	SummonBullet = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Enum Solarland.ESolarTablesEnum_WeaponType
enum class ESolarTablesEnum_WeaponType : uint8 {
	AssualtRifle = 0,
	Submachinegun = 1,
	Shotgun = 2,
	Sniper = 3,
	Vehicle = 4,
	ItemWeapon = 5,
	SummonWeapon = 6,
	AntiVehicle = 7,
	_Count = 8,
	ESolarTablesEnum_MAX = 9
};

// Enum Solarland.ESolarTablesEnum_TrigerType
enum class ESolarTablesEnum_TrigerType : uint8 {
	GameTime = 0,
	AliveCount = 1,
	RealTime = 2,
	MatchRoundTime = 3,
	GameWorldTime = 4,
	_Count = 5,
	ESolarTablesEnum_MAX = 6
};

// Enum Solarland.ESolarTablesEnum_CategoryType
enum class ESolarTablesEnum_CategoryType : uint8 {
	CategoryType_None = 0,
	CategoryType_Reco = 1,
	CategoryType_Character = 2,
	CategoryType_CharacterSkin = 3,
	CategoryType_WeaponSkin = 4,
	CategoryType_Capsule = 5,
	CategoryType_Bag = 6,
	CategoryType_Tail = 7,
	CategoryType_Home = 8,
	CategoryType_Others = 9,
	_Count = 10,
	ESolarTablesEnum_MAX = 11
};

// Enum Solarland.ESolarTablesEnum_ShareType
enum class ESolarTablesEnum_ShareType : uint8 {
	ActionType_None = 0,
	ShareType_RankShare = 1,
	ShareType_BattlePassShare = 2,
	ShareType_AchieveItemShare = 3,
	ShareType_ScoreShare = 4,
	ShareType_LoginActivityShare = 5,
	ShareType_MedalShare = 6,
	ShareType_UserGrowthShare = 7,
	ShareType_FollowCommunity = 8,
	ShareType_PersonalHistory = 9,
	ShareType_IdolShare = 10,
	_Count = 11,
	ESolarTablesEnum_MAX = 12
};

// Enum Solarland.ESolarTablesEnum_LobbyMatchEnterType
enum class ESolarTablesEnum_LobbyMatchEnterType : uint8 {
	CanClick = 0,
	PartialClick = 1,
	ForbidClick = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Enum Solarland.ESolarTablesEnum_StackType
enum class ESolarTablesEnum_StackType : uint8 {
	StackByQTY = 0,
	StackByTime = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Enum Solarland.ESolarTablesEnum_InputRelatedType
enum class ESolarTablesEnum_InputRelatedType : uint8 {
	InputRelatedNone = 0,
	Input_F = 1,
	InputRelated2 = 2,
	InputRelated3 = 3,
	InputRelated4 = 4,
	InputRelated5 = 5,
	InputRelated6 = 6,
	InputRelated7 = 7,
	InputRelated8 = 8,
	InputRelated9 = 9,
	InputRelated10 = 10,
	Input_J = 11,
	_Count = 12,
	ESolarTablesEnum_MAX = 13
};

// Enum Solarland.ESolarTablesEnum_InputContextType
enum class ESolarTablesEnum_InputContextType : uint8 {
	InputCommon = 0,
	InputPlayer = 1,
	InputVehicle = 2,
	InputOB = 3,
	InputPlayerSkill = 4,
	InputActionWheel = 5,
	_Count = 6,
	ESolarTablesEnum_MAX = 7
};

// Enum Solarland.ESolarTablesEnum_InputTabType
enum class ESolarTablesEnum_InputTabType : uint8 {
	InputTabPlayer = 0,
	InputTabVehicle = 1,
	InputTabOB = 2,
	InputTabMisc = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Enum Solarland.ESolarTablesEnum_InputCtrlType
enum class ESolarTablesEnum_InputCtrlType : uint8 {
	InputCtrlHide = 0,
	InputCtrlShow = 1,
	InputCtrlCustom = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Enum Solarland.ESolarTablesEnum_InputGroupType
enum class ESolarTablesEnum_InputGroupType : uint8 {
	InputNone = 0,
	InputKeyF = 1,
	InputKeyG = 2,
	InputKeyP = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Enum Solarland.ESolarTablesEnum_GamepadCtrlType
enum class ESolarTablesEnum_GamepadCtrlType : uint8 {
	GamepadCtrlHide = 0,
	GamepadCtrlShowOnly = 1,
	GamepadCtrlCustom = 2,
	GamepadCtrlCustomAndCom = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Enum Solarland.ESolarTablesEnum_InputGamepadType
enum class ESolarTablesEnum_InputGamepadType : uint8 {
	InputGamepadOneKey = 0,
	InputGamepadComKey = 1,
	InputGamepadFreeComKey = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Enum Solarland.ESolarTablesEnum_ClassModeType
enum class ESolarTablesEnum_ClassModeType : uint8 {
	CLASS_MODE_NONE = 0,
	CLASS_MODE_V13_4 = 1,
	CLASS_MODE_UniqueSkill = 2,
	CLASS_MODE_RoleGrow = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Enum Solarland.ESolarTablesEnum_ExcuterType
enum class ESolarTablesEnum_ExcuterType : uint8 {
	AirDrop = 0,
	GasCircle = 1,
	Bomb = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Enum Solarland.ESolarTablesEnum_DisplayType
enum class ESolarTablesEnum_DisplayType : uint8 {
	None = 0,
	Tips = 1,
	Window = 2,
	_Count = 3,
	ESolarTablesEnum_MAX = 4
};

// Enum Solarland.ESolarTablesEnum_ChestType
enum class ESolarTablesEnum_ChestType : uint8 {
	AirDrop = 0,
	ElecChest = 1,
	_Count = 2,
	ESolarTablesEnum_MAX = 3
};

// Enum Solarland.ESolarTablesEnum_Duration
enum class ESolarTablesEnum_Duration : uint8 {
	Day = 0,
	Week = 1,
	Month = 2,
	Year = 3,
	Never = 4,
	None = 5,
	_Count = 6,
	ESolarTablesEnum_MAX = 7
};

// Enum Solarland.ESolarTablesEnum_CharacterLevelUpType
enum class ESolarTablesEnum_CharacterLevelUpType : uint8 {
	Health = 0,
	Damage = 1,
	Movement = 2,
	FlyCooldown = 3,
	_Count = 4,
	ESolarTablesEnum_MAX = 5
};

// Enum Solarland.ESolarTablesEnum_CharacterType
enum class ESolarTablesEnum_CharacterType : uint8 {
	None = 0,
	Assault = 1,
	Defence = 2,
	Support = 3,
	Scout = 4,
	_Count = 5,
	ESolarTablesEnum_MAX = 6
};

// Enum Solarland.ESolarTablesEnum_BehaviorType
enum class ESolarTablesEnum_BehaviorType : uint8 {
	SurvivalTime = 0,
	Kills = 1,
	Assists = 2,
	Selfhealing = 3,
	TeammateHealing = 4,
	Unpacking = 5,
	CollectElectricity = 6,
	PickExpPack = 7,
	EveryDamageDealt = 8,
	NpcKills = 9,
	NpcAssists = 10,
	_Count = 11,
	ESolarTablesEnum_MAX = 12
};

// Enum Solarland.ESolarTablesEnum_Enum_Behavior
enum class ESolarTablesEnum_Enum_Behavior : uint8 {
	Behavior1 = 0,
	Behavior2 = 1,
	Behavior3 = 2,
	Behavior4 = 3,
	Behavior5 = 4,
	Behavior6 = 5,
	Behavior7 = 6,
	Behavior8 = 7,
	Behavior9 = 8,
	Behavior10 = 9,
	Behavior11 = 10,
	_Count = 11,
	ESolarTablesEnum_Enum_MAX = 12
};

// Enum Solarland.ESolarTablesEnum_ActionType
enum class ESolarTablesEnum_ActionType : uint8 {
	ActionType_None = 0,
	ActionType_OpenGift = 1,
	ActionType_Charge = 2,
	ActionType_Battle = 3,
	ActionType_Mail = 4,
	ActionType_ShopBuy = 5,
	ActionType_DailyTask = 6,
	ActionType_Activity = 7,
	ActionType_Guid = 8,
	ActionType_GM = 9,
	ActionType_BattleBag = 10,
	ActionType_ItemUse = 11,
	ActionType_Refund = 12,
	ActionType_BattleDouble = 13,
	ActionType_UnitProf = 14,
	ActionType_SanctuaryBuild = 15,
	ActionType_SanctuaryFacility = 16,
	ActionType_Weapon_Upgrade = 17,
	ActionType_Activereward = 18,
	ActionType_ComposeItem = 19,
	ActionType_LoginReward = 20,
	ActionType_NewUserLogin = 21,
	ActionType_HomeDailyTask = 22,
	ActionType_BattlePass = 23,
	ActionType_LevelReward = 24,
	ActionType_HomeUpgrade = 25,
	ActionType_BattlePassRepeat = 26,
	ActionType_TopUP = 27,
	ActionType_Achievement = 28,
	ActionType_LuckDraw = 29,
	ActionType_BattlePassShare = 30,
	ActionType_CDKey = 31,
	ActionType_HalfMonthLogin = 32,
	ActionType_MonthlyEvent = 33,
	ActionType_FriendEvent = 34,
	ActionType_WeekChanllenge = 35,
	ActionType_RoomCard = 36,
	ActionType_BindAccount = 37,
	ActionType_UserGrowthEvent = 38,
	ActionType_SendGift = 39,
	ActionType_SellItem = 40,
	ActionType_CollectRedeem = 41,
	ActionType_RandomPack = 42,
	ActionType_Clan = 43,
	ActionType_Bet = 44,
	ActionType_BetBonus = 45,
	ActionType_BetReturn = 46,
	ActionType_CarouselDraw = 47,
	ActionType_WeekFree = 48,
	ActionType_TutorialLevelReward = 49,
	ActionType_TournamentMiss = 50,
	ActionType_TournamentReward = 51,
	ActionType_RankingCard = 52,
	ActionType_BattleSupplyBox = 53,
	ActionType_BattlePassMission = 54,
	ActionType_SupplyBox = 55,
	ActionType_VipcardReceive = 56,
	ActionType_VipcardSign = 57,
	ActionType_Vipcard = 58,
	ActionType_Signcard = 59,
	ActionType_ChangeName = 60,
	ActionType_ServerCard = 61,
	ActionType_ExResourceDownload = 62,
	ActionType_CustomServer_Renewal = 63,
	ActionType_NewLuckDraw = 64,
	_Count = 65,
	ESolarTablesEnum_MAX = 66
};

// Enum Solarland.ETaskStatus
enum class ETaskStatus : uint8 {
	Runing = 0,
	Completed = 1,
	ReceiveAward = 2,
	ETaskStatus_MAX = 3
};

// Enum Solarland.ECostType
enum class ECostType : uint8 {
	NONE = 0,
	ELECTRONIC = 1,
	ECostType_MAX = 2
};

// Enum Solarland.ETreasureBoxSpawnType
enum class ETreasureBoxSpawnType : uint8 {
	SingleRandom = 0,
	Group = 1,
	ETreasureBoxSpawnType_MAX = 2
};

// Enum Solarland.ETutorialUIType
enum class ETutorialUIType : uint8 {
	None = 0,
	Common = 1,
	Special = 2,
	ETutorialUIType_MAX = 3
};

// Enum Solarland.ELevelRewardStatus
enum class ELevelRewardStatus : uint8 {
	NotClaimed = 0,
	Claimed = 1,
	Disable = 2,
	ELevelRewardStatus_MAX = 3
};

// Enum Solarland.EWidgetPlayAnimationFlag
enum class EWidgetPlayAnimationFlag : uint8 {
	None = 0,
	Finish = 1,
	EWidgetPlayAnimationFlag_MAX = 2
};

// Enum Solarland.EWidgetInteractionFlag
enum class EWidgetInteractionFlag : uint8 {
	None = 0,
	Pressed = 1,
	Released = 2,
	Clicked = 3,
	EWidgetInteractionFlag_MAX = 4
};

// Enum Solarland.ETutorialStage
enum class ETutorialStage : uint8 {
	None = 0,
	Lobby = 1,
	BattleField = 2,
	Home = 3,
	TutorialLevel = 4,
	ETutorialStage_MAX = 5
};

// Enum Solarland.ETutorialUIParent
enum class ETutorialUIParent : uint8 {
	Parent = 0,
	UnderBattleRoot = 1,
	BattleRoot = 2,
	BattleRootGuide = 3,
	MiddleRoot = 4,
	CommonRoot = 5,
	Map = 6,
	BattleNoticeRoot = 7,
	Guide = 8,
	PopRoot = 9,
	TipsRoot = 10,
	NoticeRoot = 11,
	Loading = 12,
	Reconnecting = 13,
	ExternalToolsRoot = 255,
	ETutorialUIParent_MAX = 256
};

// Enum Solarland.ETutorialConditionType
enum class ETutorialConditionType : uint8 {
	None = 0,
	Trigger = 1,
	Interrupt = 2,
	Finish = 3,
	ForeverClose = 4,
	ETutorialConditionType_MAX = 5
};

// Enum Solarland.ETutorialType
enum class ETutorialType : uint8 {
	TEvent = 0,
	TTick = 1,
	ETutorialType_MAX = 2
};

// Enum Solarland.ETutorialTriggerType
enum class ETutorialTriggerType : uint8 {
	TickActivateTutorials = 0,
	AlreadyTriggeredMaxCount = 1,
	HasSpecifiedItem = 2,
	HasTakenDamage = 3,
	PlayerAcountLevel = 4,
	SprintingContinuously = 5,
	JumpBegin = 8,
	ShieldNotFull = 17,
	WidgetClicked = 19,
	CanUseSpecifiedVehicleAbility = 20,
	CanUseSpecifiedVehicleWeapon = 21,
	AirDropBoxLanded = 22,
	NearAirDropBox = 23,
	OpenBigMapUMG = 24,
	CanUseSpecifiedWeaponAbility = 25,
	CanOpenTreasureBox = 29,
	PlayerInTargetStage = 30,
	EquipSpecifiedWeapon = 34,
	FeatureUnlock = 35,
	ApproachTreasureBox = 36,
	BotAIDying = 38,
	RunningStep = 39,
	HasSpecifiedEquipmentByType = 40,
	TutorialLevelDone = 42,
	WeaponSlotHasSpecifiedItem = 45,
	HasUIPanelOpened = 48,
	SpecifiedPlayerProficiency = 53,
	PlayerUpgradeBattleLevel = 54,
	ETutorialTriggerType_MAX = 55
};

// Enum Solarland.EPlayerProficiency
enum class EPlayerProficiency : uint8 {
	None = 0,
	Rookie = 1,
	FPS = 2,
	Veteran = 3,
	EPlayerProficiency_MAX = 4
};

// Enum Solarland.EUAVRescueState
enum class EUAVRescueState : uint8 {
	None = 0,
	Idle = 1,
	Heal = 2,
	Navigate = 3,
	Rescue = 4,
	EUAVRescueState_MAX = 5
};

// Enum Solarland.EWidgetPassiveMode
enum class EWidgetPassiveMode : uint8 {
	Normal = 0,
	Passive_Buff = 1,
	Passive_Debuff = 2,
	EWidgetPassiveMode_MAX = 3
};

// Enum Solarland.EVehicleRotateAnimationType
enum class EVehicleRotateAnimationType : uint8 {
	None = 0,
	Right_91 = 1,
	Right_181 = 2,
	Left_91 = 3,
	Left_181 = 4,
	Right = 5,
	Left = 6,
	EVehicleRotateAnimationType_MAX = 7
};

// Enum Solarland.EIronManHandPart
enum class EIronManHandPart : uint8 {
	LeftHand = 0,
	RightHand = 1,
	EIronManHandPart_MAX = 2
};

// Enum Solarland.EIronManSoundEvent
enum class EIronManSoundEvent : uint8 {
	LaserHit = 0,
	EIronManSoundEvent_MAX = 1
};

// Enum Solarland.EPlayerInputMask
enum class EPlayerInputMask : uint8 {
	Invalidated = 0,
	VehicleBraking = 1,
	VehicleTrumpet = 2,
	VehicleAutoMove = 4,
	All = 7,
	EPlayerInputMask_MAX = 8
};

// Enum Solarland.EAssistLockState
enum class EAssistLockState : uint8 {
	None = 0,
	PreEnterAssistLock = 1,
	EnterAssistLock = 2,
	HoldAssistLock = 3,
	LeaveAssistLock = 4,
	EAssistLockState_MAX = 5
};

// Enum Solarland.EHoverVehicleVFXType
enum class EHoverVehicleVFXType : uint8 {
	Forward = 0,
	Backward = 1,
	Right = 2,
	Left = 3,
	Max = 4
};

// Enum Solarland.EEnterWaterVFX
enum class EEnterWaterVFX : uint8 {
	HorizontalLightEffect = 0,
	HorizontalHeavyEffect = 1,
	VerticalLightEffect = 2,
	VerticalHeavyEffect = 3,
	MAX = 4
};

// Enum Solarland.EVehicleSpawnSourceType
enum class EVehicleSpawnSourceType : uint8 {
	CommonSpawn = 0,
	VehicleSummonWeapon = 1,
	EVehicleSpawnSourceType_MAX = 2
};

// Enum Solarland.EVehicleControlUIType
enum class EVehicleControlUIType : uint8 {
	Vehicle = 0,
	Character = 1,
	EVehicleControlUIType_MAX = 2
};

// Enum Solarland.EVehicleRotateCondition
enum class EVehicleRotateCondition : uint8 {
	None = 0,
	Forward = 1,
	Backward = 2,
	Right = 4,
	Left = 8,
	All = 15,
	EVehicleRotateCondition_MAX = 16
};

// Enum Solarland.EVehicleOpenTips
enum class EVehicleOpenTips : uint8 {
	FloorCanNotOpen = 0,
	SpeedCanNotOpen = 1,
	EVehicleOpenTips_MAX = 2
};

// Enum Solarland.ESiegeVehicleAnimation
enum class ESiegeVehicleAnimation : uint8 {
	CloseIdle = 0,
	OpenIdle = 1,
	Fire = 2,
	ESiegeVehicleAnimation_MAX = 3
};

// Enum Solarland.EVehicleDamageStatus
enum class EVehicleDamageStatus : uint8 {
	Normal = 0,
	Damaged = 1,
	SeriouslyDamaged = 2,
	BrokenDanger = 3,
	Broken = 4,
	MAX = 5
};

// Enum Solarland.EVehicleAnimationState
enum class EVehicleAnimationState : uint8 {
	None = 0,
	Jump = 1,
	Dash = 2,
	TakingOff = 3,
	Cruising = 4,
	EVehicleAnimationState_MAX = 5
};

// Enum Solarland.ERocketFireMode
enum class ERocketFireMode : uint8 {
	NomalFire = 0,
	PrecisionFire = 1,
	Max = 2
};

// Enum Solarland.EVehiclePageType
enum class EVehiclePageType : uint8 {
	Lobby = 0,
	VehicleBag = 1,
	BattlePass = 2,
	LuckDraw = 3,
	GetReward = 4,
	GrowTask = 5,
	Shop = 6,
	CarouselDraw = 7,
	SupplyBoxDetail = 8,
	SupplyBoxRaffle = 9,
	Max = 10
};

// Enum Solarland.EVehicleSpawnType
enum class EVehicleSpawnType : uint8 {
	SingleRandom = 0,
	Group = 1,
	EVehicleSpawnType_MAX = 2
};

// Enum Solarland.EVehicleState
enum class EVehicleState : uint8 {
	None = 0,
	Ground = 1,
	Air = 2,
	Sliding = 3,
	EVehicleState_MAX = 4
};

// Enum Solarland.ESolarWeaponSpreadState
enum class ESolarWeaponSpreadState : uint8 {
	Standby = 0,
	Approach = 1,
	Recover = 2,
	ESolarWeaponSpreadState_MAX = 3
};

// Enum Solarland.ESolarBlackHoleParticle
enum class ESolarBlackHoleParticle : uint8 {
	ForceField = 0,
	CoreFadeIn = 1,
	CoreFadeOut = 2,
	CoreLoop = 3,
	CoreHit = 4,
	Explode = 5,
	CharacterDebuff = 6,
	ESolarBlackHoleParticle_MAX = 7
};

// Enum Solarland.ESolarBlackHoleState
enum class ESolarBlackHoleState : uint8 {
	None = 0,
	Startup = 1,
	Ready = 2,
	Active = 3,
	End = 4,
	ESolarBlackHoleState_MAX = 5
};

// Enum Solarland.EWeaponOverloadState
enum class EWeaponOverloadState : uint8 {
	NormalDecrease = 0,
	FireSuspend = 1,
	ForceOverload = 2,
	EWeaponOverloadState_MAX = 3
};

// Enum Solarland.EWeaponFireModeType
enum class EWeaponFireModeType : int32 {
	EWeaponFireModeType_UnArm = -1,
	EWeaponFireModeType_Primary = 0,
	EWeaponFireModeType_Secondary = 1,
	EWeaponFireModeType_Tertiary = 2,
	EWeaponFireModeType_MAX = 3
};

// Enum Solarland.EWeaponScopeType
enum class EWeaponScopeType : uint8 {
	None = 0,
	ScopeX0 = 1,
	ScopeX1 = 2,
	ScopeX2 = 3,
	ScopeX3 = 4,
	ScopeX4 = 5,
	ScopeX6 = 6,
	ScopeX8 = 7,
	Count = 8,
	EWeaponScopeType_MAX = 9
};

// Enum Solarland.EGearState
enum class EGearState : uint8 {
	Reverse = 0,
	Neutral = 1,
	Forward = 2,
	EGearState_MAX = 3
};

// Enum Solarland.EUIRoot
enum class EUIRoot : uint8 {
	None = 0,
	UnderBattleRoot = 1,
	BattleRoot = 2,
	BattleRootGuide = 3,
	MiddleRoot = 4,
	CommonRoot = 5,
	Map = 6,
	BattleNoticeRoot = 7,
	Guide = 8,
	PopRoot = 9,
	TipsRoot = 10,
	NoticeRoot = 11,
	Loading = 12,
	Reconnecting = 13,
	ExternalToolsRoot = 255,
	EUIRoot_MAX = 256
};

// Enum Solarland.EInputEventHandleType
enum class EInputEventHandleType : uint8 {
	Unhandle = 0,
	SimulateKey = 1,
	BroadcastEvent = 2,
	SimulateTouch = 4,
	NoKeyOnly = 6,
	NoEventOnly = 5,
	NoTouchOnly = 3,
	HandleAll = 7,
	EInputEventHandleType_MAX = 8
};

// Enum Solarland.ETouchMovePriority
enum class ETouchMovePriority : uint8 {
	Highest = 0,
	Higher = 1,
	Normal = 2,
	Lower = 3,
	Lowest = 4,
	ETouchMovePriority_MAX = 5
};

// Enum Solarland.EZiplineSide
enum class EZiplineSide : uint8 {
	None = 0,
	Cable = 1,
	A = 2,
	B = 3,
	EZiplineSide_MAX = 4
};

// Enum Solarland.EZiplineType
enum class EZiplineType : uint8 {
	Horizontal = 0,
	Vertical = 1,
	EZiplineType_MAX = 2
};

// Enum Solarland.ESoundPoolSimpleRule
enum class ESoundPoolSimpleRule : uint8 {
	Random = 0,
	RandomNoRepeat = 1,
	Sequential = 2,
	ESoundPoolSimpleRule_MAX = 3
};

// Enum Solarland.ESoundGroupPlayContextEnum
enum class ESoundGroupPlayContextEnum : uint8 {
	None = 0,
	IsSelf = 1,
	IsTeammate = 2,
	IsAttackingOther = 3,
	IsAttachedByOther = 4,
	ESoundGroupPlayContextEnum_MAX = 5
};

// Enum Solarland.ESolarImageProgressHalfCirclePrivotType
enum class ESolarImageProgressHalfCirclePrivotType : uint8 {
	MidLeft = 0,
	MidRight = 1,
	MidBottom = 2,
	MidTop = 4,
	ESolarImageProgressHalfCirclePrivotType_MAX = 5
};

// Enum Solarland.ESolarImageProgressQuaterCirclePrivotType
enum class ESolarImageProgressQuaterCirclePrivotType : uint8 {
	LeftBottom = 0,
	RightBottom = 1,
	LeftTop = 16,
	RightTop = 17,
	ESolarImageProgressQuaterCirclePrivotType_MAX = 18
};

// Enum Solarland.ESolarImageProgressLineDirType
enum class ESolarImageProgressLineDirType : uint8 {
	Horizantal = 0,
	Vertical = 1,
	ESolarImageProgressLineDirType_MAX = 2
};

// Enum Solarland.ESolarImageProgressType
enum class ESolarImageProgressType : uint8 {
	None = 0,
	Line = 1,
	QuarterCircle = 2,
	HalfCircle = 3,
	Circle = 4,
	ESolarImageProgressType_MAX = 5
};

// Enum Solarland.ESolarImageFillType
enum class ESolarImageFillType : uint8 {
	Normal = 0,
	Mirror = 1,
	Quarter = 2,
	ESolarImageFillType_MAX = 3
};

// Enum Solarland.ESummonItemType
enum class ESummonItemType : uint8 {
	SolidSummonItem = 0,
	VirtualSummonItem = 1,
	ESummonItemType_MAX = 2
};

// Enum Solarland.ESolarSummonSoundType
enum class ESolarSummonSoundType : uint8 {
	SummonSoundType_1P = 0,
	SummonSoundType_3P = 1,
	SummonSoundType_3P_Enemy = 2,
	SummonSoundType_MAX = 3
};

// Enum Solarland.ERefreshCause
enum class ERefreshCause : uint8 {
	ECause_None = 0,
	ECause_OutOrIntoScreen = 1,
	ECause_RescueStateChange = 2,
	ECause_MAX = 3
};

// Enum Solarland.ESplineMeshType
enum class ESplineMeshType : uint8 {
	DEFAULT = 0,
	START = 1,
	END = 2,
	ESplineMeshType_MAX = 3
};

// Enum Solarland.EBackpackInfoPageType
enum class EBackpackInfoPageType : uint8 {
	Level = 0,
	Skill = 1,
	Max = 2
};

// Enum Solarland.ETweenInterpolationType
enum class ETweenInterpolationType : uint8 {
	Easing = 0,
	Curve = 1,
	ETweenInterpolationType_MAX = 2
};

// Enum Solarland.EDefenderTeamType
enum class EDefenderTeamType : uint8 {
	MyTeam = 0,
	DefenderTeam = 1,
	EDefenderTeamType_MAX = 2
};

// Enum Solarland.EPlayerWidgetState
enum class EPlayerWidgetState : uint8 {
	NORMAL = 0,
	DRIVER = 1,
	PASSGNER = 2,
	EQUIPVEHICLEWEAPON = 3,
	CRUISING = 4,
	PATACHUTING = 5,
	SWIMMING = 6,
	MAX = 7
};

// Enum Solarland.ELocalNoticeType
enum class ELocalNoticeType : uint8 {
	Revenge = 0,
	KillDown = 1,
	ClearTeam = 2,
	ShutDown = 3,
	KillDefender = 4,
	ELocalNoticeType_MAX = 5
};

// Enum Solarland.EUIWeaponPartState
enum class EUIWeaponPartState : uint8 {
	NotEquip = 0,
	Equipped = 1,
	CantEquip = 2,
	EUIWeaponPartState_MAX = 3
};

// Enum Solarland.EWidgetVisibilityFlags
enum class EWidgetVisibilityFlags : uint8 {
	None = 0,
	ChatSwitch = 1,
	ChatMsgSending = 2,
	ConnectionState = 3,
	TalentState = 4,
	TalentValidation = 5,
	EWidgetVisibilityFlags_MAX = 6
};

// Enum Solarland.EStealthParamType
enum class EStealthParamType : uint8 {
	None = 0,
	Type_1P = 1,
	Type_3P = 2,
	Type_3P_Enemy = 3,
	EStealthParamType_MAX = 4
};

// Enum Solarland.EWholeShieldState
enum class EWholeShieldState : uint8 {
	Begin = 0,
	InProgress = 1,
	End = 2,
	EWholeShieldState_MAX = 3
};

// Enum Solarland.EVisualSoundDetectionRule
enum class EVisualSoundDetectionRule : uint8 {
	XYZ = 0,
	XY = 1,
	XY_FiniteZ = 2,
	EVisualSoundDetectionRule_MAX = 3
};

// Enum Solarland.EWeaponAnimState
enum class EWeaponAnimState : uint8 {
	Idle = 0,
	Fire = 1,
	AltFire = 2,
	Reload = 3,
	Overload = 4,
	OpenScope = 5,
	CloseScope = 6,
	Bolt = 7,
	Preview = 8,
	Summon = 9,
	EWeaponAnimState_MAX = 10
};

// Enum Solarland.ESolarWeaponLODState
enum class ESolarWeaponLODState : uint8 {
	Hold = 0,
	OpenScope = 1,
	Discard = 2,
	AttachedOnBackpack = 3,
	ESolarWeaponLODState_MAX = 4
};

// Enum Solarland.EWeaponSkinType
enum class EWeaponSkinType : uint8 {
	Material = 0,
	Mesh = 1,
	EWeaponSkinType_MAX = 2
};

// Enum Solarland.EWeaponMechanicalSideFlag
enum class EWeaponMechanicalSideFlag : int32 {
	None = 0,
	OnGround = 2,
	Unequip = 4,
	OpenScope = 8,
	ForceFiring = 16,
	ChargedFire = 32,
	NeedBolt = 64,
	GatlingRolling = 128,
	DetectedWall = 256,
	NeedRechamber = 512,
	NoAmmoReserved = 1024,
	EWeaponMechanicalSideFlag_MAX = 1025
};

// Enum Solarland.EWeaponMechanicalUniqueState
enum class EWeaponMechanicalUniqueState : uint8 {
	None = 0,
	Idle = 1,
	PreFire = 2,
	RealFire = 3,
	Rechamber = 4,
	Reloading = 5,
	Bolting = 6,
	Charging = 7,
	Overloading = 8,
	KeyUPHolding = 9,
	EWeaponMechanicalUniqueState_MAX = 10
};

// Enum Solarland.EWeaponUpgradeType
enum class EWeaponUpgradeType : uint8 {
	EWeaponUpgradeType_Part = 0,
	EWeaponUpgradeType_SecondaryAmmo = 1,
	EWeaponUpgradeType_MAX = 2
};

// Enum Solarland.EWeaponNetToClientProto
enum class EWeaponNetToClientProto : uint8 {
	CSkin_RefreshSkin = 0,
	CUpgrade_UpLevel = 1,
	CUpgrade_ExpRefresh = 2,
	CUpgrade_ReplaceUpgradeRoute = 3,
	CParts_ReplacePart = 4,
	CParts_ReplaceAmmo = 5,
	CParts_InitFinish = 6,
	CAnimation_RefreshState = 7,
	EWeaponNetToClientProto_MAX = 8
};

// Enum Solarland.EWeaponNetToServerProto
enum class EWeaponNetToServerProto : uint8 {
	SUpgrade_AddExp = 0,
	SParts_Hold = 1,
	SAnimation_RefreshState = 2,
	EWeaponNetToServerProto_MAX = 3
};

// Enum Solarland.EWeaponPartVisibilityChangeFlag
enum class EWeaponPartVisibilityChangeFlag : uint8 {
	Default = 0,
	BySignificance = 1,
	ByHold = 2,
	EWeaponPartVisibilityChangeFlag_MAX = 3
};

// Enum Solarland.EFixedValueMode
enum class EFixedValueMode : uint8 {
	Raw = 0,
	Increment = 1,
	EFixedValueMode_MAX = 2
};

// Enum Solarland.EWeaponSkewAdjustmentType
enum class EWeaponSkewAdjustmentType : uint8 {
	Pitch = 0,
	Yaw = 1,
	Roll = 2,
	XOffset = 3,
	YOffset = 4,
	ZOffset = 5,
	EWeaponSkewAdjustmentType_MAX = 6
};

// Enum Solarland.EWeaponSkewInputType
enum class EWeaponSkewInputType : uint8 {
	PitchSpeed = 0,
	YawSpeed = 1,
	HorizontalSpeed = 2,
	VerticalSpeed = 3,
	EWeaponSkewInputType_MAX = 4
};

// Enum Solarland.ESprayingRecoveryMode
enum class ESprayingRecoveryMode : uint8 {
	SyncWithRecoil = 0,
	RecoverByCurve = 1,
	ESprayingRecoveryMode_MAX = 2
};

// Enum Solarland.EWeaponAttributeParamType
enum class EWeaponAttributeParamType : uint8 {
	ParamA = 0,
	ParamB = 1,
	ParamC = 2,
	ParamD = 3,
	EWeaponAttributeParamType_MAX = 4
};

// Enum Solarland.ESpreadScaleDecreaseMode
enum class ESpreadScaleDecreaseMode : uint8 {
	DecreaseByFixedSpeed = 0,
	DecreaseByFixedTime = 1,
	ESpreadScaleDecreaseMode_MAX = 2
};

// Enum Solarland.ESolarWeaponFireInputButtonState
enum class ESolarWeaponFireInputButtonState : uint8 {
	FireWaiting = 0,
	FirePressed = 1,
	CancelWaiting = 2,
	CancelPressed = 3,
	Invalid = 4,
	ESolarWeaponFireInputButtonState_MAX = 5
};

// Enum Solarland.EWSCurWeaponUpdateType
enum class EWSCurWeaponUpdateType : uint8 {
	Switch = 0,
	PartUpdate = 1,
	EWSCurWeaponUpdateType_MAX = 2
};

// Enum Solarland.ECheckFireResultType
enum class ECheckFireResultType : uint8 {
	None = 0,
	Fire = 1,
	Reload = 2,
	OpenScope = 3,
	CloseScope = 4,
	Charge = 5,
	EndCharge = 6,
	ECheckFireResultType_MAX = 7
};

// Enum Solarland.EOperateScopeStateReason
enum class EOperateScopeStateReason : uint8 {
	None = 0,
	OpenScopeButton = 1,
	OpenQuickAds = 2,
	Open = 3,
	CloseReload = 16,
	CloseBolt = 32,
	Close = 48,
	AllFlag = 51,
	EOperateScopeStateReason_MAX = 52
};

// Enum Solarland.EBehaviorExpID
enum class EBehaviorExpID : uint8 {
	Default = 0,
	KillPlayer = 2,
	AssistPlayer = 3,
	DamageExp = 9,
	KillNpc = 11,
	AssistNpc = 12,
	EBehaviorExpID_MAX = 13
};

// Enum Solarland.EClientRecieveProto
enum class EClientRecieveProto : uint8 {
	PickUpWeapon = 0,
	DropWeapon = 1,
	SwitchWeaponFinish = 2,
	ReplaceWeapon = 3,
	WeaponDataUpdate = 4,
	AddExpMsg = 5,
	ClearWeapons = 6,
	ReloadCompleted = 7,
	EClientRecieveProto_MAX = 8
};

// Enum Solarland.EServerRecieveProto
enum class EServerRecieveProto : uint8 {
	SwitchWeapon = 0,
	Reload = 1,
	ShowOrHideCurrent = 2,
	GameStaticsWeaponSkill = 3,
	DropItemWeapon = 4,
	ReplaceUpgradeRoute = 5,
	SwapWeapon = 6,
	EServerRecieveProto_MAX = 7
};

// Enum Solarland.EAIPlayerServerRecieveProto
enum class EAIPlayerServerRecieveProto : uint8 {
	PickUpWeapon = 0,
	EAIPlayerServerRecieveProto_MAX = 1
};

// Enum Solarland.EAIPlayerClientRecieveProto
enum class EAIPlayerClientRecieveProto : uint8 {
	PickUpWeapon = 0,
	SwitchWeapon = 1,
	EAIPlayerClientRecieveProto_MAX = 2
};

// Enum Solarland.EVehicleWeaponServerRecieveProto
enum class EVehicleWeaponServerRecieveProto : uint8 {
	Reload = 0,
	StartReload = 1,
	EVehicleWeaponServerRecieveProto_MAX = 2
};

// Enum Solarland.EWeaponSystemVehicleState
enum class EWeaponSystemVehicleState : uint8 {
	PreCharging = 0,
	PreFire = 1,
	PreReload = 2,
	PreOpenScope = 3,
	PreCloseScope = 4,
	PreFireOverload = 5,
	EWeaponSystemVehicleState_MAX = 6
};

// Enum Solarland.EWeaponSystemVehicleProto
enum class EWeaponSystemVehicleProto : uint8 {
	EWeaponSystemVehicleProto_Equip = 0,
	EWeaponSystemVehicleProto_UnEquip = 1,
	EWeaponSystemVehicleProto_StartReload = 2,
	EWeaponSystemVehicleProto_MAX = 3
};

// Enum Solarland.EMarkButtonState
enum class EMarkButtonState : uint8 {
	Normal = 0,
	Pressed = 1,
	Selecting = 2,
	Canceled = 3,
	Respond = 4,
	EMarkButtonState_MAX = 5
};

// ScriptStruct Solarland.ScreenshotConfig
// Size: 0x50 (Inherited: 0x00)
struct FScreenshotConfig {
	bool EnableOnCurrentReportGameCheating; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t MaxCountInRound; // 0x04(0x04)
	struct FString ScreenshotMoment; // 0x08(0x10)
	int32_t ScreenshotInterval; // 0x18(0x04)
	int32_t ScreenshotWidth; // 0x1c(0x04)
	int32_t ScreenshotQuality; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FString ImageSaveType; // 0x28(0x10)
	struct FString ScreenshotMode; // 0x38(0x10)
	int32_t ImageMaxSize; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// ScriptStruct Solarland.AntiCheatSetting
// Size: 0x40 (Inherited: 0x00)
struct FAntiCheatSetting {
	int64_t ID; // 0x00(0x08)
	int64_t ValueType; // 0x08(0x08)
	double ValueStart; // 0x10(0x08)
	double ValueEnd; // 0x18(0x08)
	int64_t Tolerance; // 0x20(0x08)
	int64_t ProbeInterval; // 0x28(0x08)
	struct FString VariableName; // 0x30(0x10)
};

// ScriptStruct Solarland.RegistedActorContainer
// Size: 0x50 (Inherited: 0x00)
struct FRegistedActorContainer {
	char pad_0[0x50]; // 0x00(0x50)
};

// ScriptStruct Solarland.LiveWatchOnlyMsg
// Size: 0x40 (Inherited: 0x00)
struct FLiveWatchOnlyMsg {
	struct FString BattleID; // 0x00(0x10)
	struct FString FromPlayerID; // 0x10(0x10)
	struct FString ToPlayerID; // 0x20(0x10)
	struct FString Content; // 0x30(0x10)
};

// ScriptStruct Solarland.GameStartConditionList
// Size: 0x58 (Inherited: 0x00)
struct FGameStartConditionList {
	char pad_0[0x8]; // 0x00(0x08)
	struct FGameplayTagContainer ServerStartConditionList; // 0x08(0x20)
	struct FGameplayTagContainer ClientStartConditionList; // 0x28(0x20)
	struct AGameStateBase* Owner; // 0x48(0x08)
	char pad_50[0x8]; // 0x50(0x08)
};

// ScriptStruct Solarland.PrePooledBundle
// Size: 0x10 (Inherited: 0x00)
struct FPrePooledBundle {
	struct FName ClassPath; // 0x00(0x08)
	int32_t Number; // 0x08(0x04)
	bool bNeedOnClient; // 0x0c(0x01)
	bool bNeedOnServer; // 0x0d(0x01)
	char pad_E[0x2]; // 0x0e(0x02)
};

// ScriptStruct Solarland.CustomRoomData
// Size: 0xd8 (Inherited: 0x00)
struct FCustomRoomData {
	struct FString Name; // 0x00(0x10)
	int64_t MinPlayerLimit; // 0x10(0x08)
	int64_t MaxPlayerLimit; // 0x18(0x08)
	struct FString OwnerID; // 0x20(0x10)
	struct FString Passwd; // 0x30(0x10)
	int32_t LevelLimit; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	int64_t ShowID; // 0x48(0x08)
	int64_t MaxOBPlayerLimit; // 0x50(0x08)
	bool bIsEnabledSwapPos; // 0x58(0x01)
	bool bIsEnabledInvite; // 0x59(0x01)
	bool bIsEnableTeamJoin; // 0x5a(0x01)
	enum class ESCRoomType RoomType; // 0x5b(0x01)
	struct FTournamentData TournamentData; // 0x5c(0x10)
	int32_t RewardPoolID; // 0x6c(0x04)
	int32_t RewardPoolPrizeType; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct FCustomServerData CustomServerData; // 0x78(0x58)
	int32_t KeepMatchTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
};

// ScriptStruct Solarland.CustomServerData
// Size: 0x58 (Inherited: 0x00)
struct FCustomServerData {
	struct FString ID; // 0x00(0x10)
	int32_t ConfigID; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<int32_t> WeaponBlacklist; // 0x18(0x10)
	struct TArray<int32_t> WeaponTypeBlacklist; // 0x28(0x10)
	struct TArray<int32_t> VehicleTypeBlacklist; // 0x38(0x10)
	struct TArray<int32_t> VehicleClassBlacklist; // 0x48(0x10)
};

// ScriptStruct Solarland.TournamentData
// Size: 0x10 (Inherited: 0x00)
struct FTournamentData {
	int32_t StartTime; // 0x00(0x04)
	int32_t DelayTime; // 0x04(0x04)
	int32_t Turn; // 0x08(0x04)
	enum class ESCTournamentType TournamentType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct Solarland.KnockoutParams
// Size: 0x28 (Inherited: 0x00)
struct FKnockoutParams {
	float KnockoutKillPoint; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<float> KnockoutRankPoints; // 0x08(0x10)
	float KnockoutDamagePoint; // 0x18(0x04)
	float KnockoutDamageTakenPoint; // 0x1c(0x04)
	float ScalarParam; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct Solarland.SCMRankData
// Size: 0x18 (Inherited: 0x00)
struct FSCMRankData {
	struct FString HostID; // 0x00(0x10)
	int32_t Rank; // 0x10(0x04)
	float Value; // 0x14(0x04)
};

// ScriptStruct Solarland.SCMRankInfo
// Size: 0x18 (Inherited: 0x00)
struct FSCMRankInfo {
	struct FString RankName; // 0x00(0x10)
	enum class ESCMDataRankType RankType; // 0x10(0x01)
	enum class ESCMHostType HostType; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
};

// ScriptStruct Solarland.StartRecordingParams
// Size: 0x10 (Inherited: 0x00)
struct FStartRecordingParams {
	bool bWithLevelStreamingFixes; // 0x00(0x01)
	bool bEnableCheckpoint; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	uint32_t RecordHz; // 0x04(0x04)
	float CheckpointInterval; // 0x08(0x04)
	float ChunkInterval; // 0x0c(0x04)
};

// ScriptStruct Solarland.HighlightReportData
// Size: 0x50 (Inherited: 0x00)
struct FHighlightReportData {
	int32_t Source; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString BattleID; // 0x08(0x10)
	struct FString MapID; // 0x18(0x10)
	int32_t MatchRanking; // 0x28(0x04)
	int32_t Rank; // 0x2c(0x04)
	int32_t KillNum; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct FString HighestRating; // 0x38(0x10)
	bool bIsInterrupt; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)
};

// ScriptStruct Solarland.AddMultiplePassMaterialChangeParams
// Size: 0x40 (Inherited: 0x00)
struct FAddMultiplePassMaterialChangeParams {
	struct FGameplayTag PriorityTag; // 0x00(0x08)
	enum class EMaterialChangeConflictResolveStrategy ResolveStrategy; // 0x08(0x01)
	enum class EMultiplePassMaterialChangeCompatibilityMode CompatibilityMode; // 0x09(0x01)
	char pad_A[0x6]; // 0x0a(0x06)
	struct FGameplayTagContainer SpecifiedPriorityTags; // 0x10(0x20)
	char bNeedMultiplePass : 1; // 0x30(0x01)
	char bForceFrontFaceCull : 1; // 0x30(0x01)
	char bIgnoreTranslucentSection : 1; // 0x30(0x01)
	char bIgnoreMaskedSection : 1; // 0x30(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x30(0x01)
	char bUseAsOccluder : 1; // 0x30(0x01)
	char bIgnoreOcclusionCull : 1; // 0x30(0x01)
	char bRenderMainPassStencil : 1; // 0x30(0x01)
	char bSetTranslucencySortPriorityOnly : 1; // 0x31(0x01)
	char bRenderCustomDepth : 1; // 0x31(0x01)
	char pad_31_2 : 6; // 0x31(0x01)
	char pad_32[0x2]; // 0x32(0x02)
	int32_t MainPassDepthStencilValue; // 0x34(0x04)
	int32_t TranslucencySortPriority; // 0x38(0x04)
	int32_t CustomDepthStencilValue; // 0x3c(0x04)
};

// ScriptStruct Solarland.SolarClientAdjustPositionInfo
// Size: 0x38 (Inherited: 0x00)
struct FSolarClientAdjustPositionInfo {
	char pad_0[0x20]; // 0x00(0x20)
	struct UPrimitiveComponent* NewBase; // 0x20(0x08)
	char pad_28[0x10]; // 0x28(0x10)
};

// ScriptStruct Solarland.CustomJumpParams
// Size: 0x98 (Inherited: 0x00)
struct FCustomJumpParams {
	float JumpHeight; // 0x00(0x04)
	float JumpTime; // 0x04(0x04)
	float JumpDelay; // 0x08(0x04)
	bool bEnableLateralSpeedAdjust; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FRuntimeFloatCurve LateralSpeedAdjustCurve; // 0x10(0x88)
};

// ScriptStruct Solarland.SolarItemData
// Size: 0xb8 (Inherited: 0x0c)
struct FSolarItemData : FFastArraySerializerItem {
	int32_t ItemID; // 0x0c(0x04)
	int64_t ThisID; // 0x10(0x08)
	struct FString Name; // 0x18(0x10)
	struct FString Icon; // 0x28(0x10)
	struct FString Info; // 0x38(0x10)
	int32_t count; // 0x48(0x04)
	enum class EItemType ItemType; // 0x4c(0x04)
	int32_t Quality; // 0x50(0x04)
	int32_t MaxPile; // 0x54(0x04)
	bool IfReplace; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct FString AbilityBP; // 0x60(0x10)
	struct FString ItemBP; // 0x70(0x10)
	int32_t DropTime; // 0x80(0x04)
	int32_t UnPickupTime; // 0x84(0x04)
	bool IsRecommend; // 0x88(0x01)
	bool bDirty; // 0x89(0x01)
	bool IsPickupLock; // 0x8a(0x01)
	char pad_8B[0x5]; // 0x8b(0x05)
	int64_t UserId; // 0x90(0x08)
	int32_t Level; // 0x98(0x04)
	int32_t Prize; // 0x9c(0x04)
	float CurValue; // 0xa0(0x04)
	bool UseOnPickup; // 0xa4(0x01)
	enum class EItemAppearanceType AppearanceType; // 0xa5(0x01)
	bool bUpdateOverlap; // 0xa6(0x01)
	char pad_A7[0x1]; // 0xa7(0x01)
	int32_t SourceType; // 0xa8(0x04)
	char pad_AC[0xc]; // 0xac(0x0c)
};

// ScriptStruct Solarland.VehicleSpectateInfo
// Size: 0x30 (Inherited: 0x00)
struct FVehicleSpectateInfo {
	struct TWeakObjectPtr<struct ASolarVehiclePawn> SpectateVehicle; // 0x00(0x08)
	struct TWeakObjectPtr<struct ASolarVehicleWeapon> SpectateVehicleWeapon; // 0x08(0x08)
	enum class EVehicleWeaponScopeType VehicleWeaponScopeType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	struct TWeakObjectPtr<struct ASolarPlayerWeapon> SpectatePlayerWeapon; // 0x14(0x08)
	int32_t ScopeId; // 0x1c(0x04)
	struct TArray<int32_t> WeaponIDs; // 0x20(0x10)
};

// ScriptStruct Solarland.InteractiveTaskConfig
// Size: 0x88 (Inherited: 0x08)
struct FInteractiveTaskConfig : FTableRowBase {
	int32_t TaskID; // 0x08(0x04)
	int32_t GiftID; // 0x0c(0x04)
	int32_t TaskName; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString Describe; // 0x18(0x10)
	int32_t TaskUpgradeDescribe; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FSoftObjectPath TaskIcon; // 0x30(0x18)
	enum class ESocialCurrencyType CurrencyType; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	int32_t MaxTaskLevel; // 0x4c(0x04)
	struct TArray<int32_t> TaskTarget; // 0x50(0x10)
	struct TArray<int32_t> UpgradePrice; // 0x60(0x10)
	struct TArray<int32_t> TaskReward; // 0x70(0x10)
	enum class EInteractiveTaskType TaskType; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	int32_t Param; // 0x84(0x04)
};

// ScriptStruct Solarland.SpectateConditions
// Size: 0x20 (Inherited: 0x00)
struct FSpectateConditions {
	bool bCanBeSpectate; // 0x00(0x01)
	bool bCanBeSpectateByHostilePlayer; // 0x01(0x01)
	bool bCanBeSpectateByFriendlyPlayer; // 0x02(0x01)
	bool bCanISpectateBot; // 0x03(0x01)
	bool bCanISpectateHostilePlayers; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float LookAtSelfDeathBoxCountDown; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<enum class EFindSpectateTargetType> FindSpectateTargetPolicy; // 0x10(0x10)
};

// ScriptStruct Solarland.SpectateReportInfo
// Size: 0x28 (Inherited: 0x00)
struct FSpectateReportInfo {
	uint32_t RankLevelID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString TargetUserID; // 0x08(0x10)
	char TargetType; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	uint32_t SpectateElapsedTime; // 0x1c(0x04)
	char Type; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
};

// ScriptStruct Solarland.BattleUpgradeEffectParamData
// Size: 0x08 (Inherited: 0x00)
struct FBattleUpgradeEffectParamData {
	enum class ESolarTablesEnum_BattleUpgradeEffectType EffectType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t ParameterSum; // 0x04(0x04)
};

// ScriptStruct Solarland.RepCountdownData
// Size: 0x2c (Inherited: 0x00)
struct FRepCountdownData {
	int32_t RepTimes; // 0x00(0x04)
	int32_t RepTextID; // 0x04(0x04)
	int32_t RepPassiveTextID; // 0x08(0x04)
	int32_t RepPassiveCharacterID; // 0x0c(0x04)
	float RepDuration; // 0x10(0x04)
	float RepRemaining; // 0x14(0x04)
	float RepAmount; // 0x18(0x04)
	float RepStartTime; // 0x1c(0x04)
	float RepEndTime; // 0x20(0x04)
	int32_t RepCancel; // 0x24(0x04)
	float RemainingTime; // 0x28(0x04)
};

// ScriptStruct Solarland.CharacterRoleAbilityInfo
// Size: 0x18 (Inherited: 0x00)
struct FCharacterRoleAbilityInfo {
	bool bHasAbility; // 0x00(0x01)
	char pad_1[0x1]; // 0x01(0x01)
	bool bIsCountingDown; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	float StartCDTime; // 0x04(0x04)
	float TotalCDTime; // 0x08(0x04)
	int32_t State; // 0x0c(0x04)
	char pad_10[0x4]; // 0x10(0x04)
	bool bOngoing; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
};

// ScriptStruct Solarland.ReplicateMaxPileData
// Size: 0x08 (Inherited: 0x00)
struct FReplicateMaxPileData {
	int32_t ItemID; // 0x00(0x04)
	int32_t MaxPile; // 0x04(0x04)
};

// ScriptStruct Solarland.ReplicateItemData
// Size: 0x0c (Inherited: 0x00)
struct FReplicateItemData {
	int32_t ItemID; // 0x00(0x04)
	int32_t count; // 0x04(0x04)
	int32_t Slot; // 0x08(0x04)
};

// ScriptStruct Solarland.InteractiveTaskStatus
// Size: 0x78 (Inherited: 0x00)
struct FInteractiveTaskStatus {
	int32_t TaskID; // 0x00(0x04)
	int32_t CurLevel; // 0x04(0x04)
	int32_t ProgressValue; // 0x08(0x04)
	int32_t TargetValue; // 0x0c(0x04)
	int32_t Param; // 0x10(0x04)
	bool bAvailableToNxtLevel; // 0x14(0x01)
	char pad_15[0x53]; // 0x15(0x53)
	struct TArray<struct FGiftSenderInfo> TaskGiftPlayerInfo; // 0x68(0x10)
};

// ScriptStruct Solarland.GiftSenderInfo
// Size: 0x28 (Inherited: 0x00)
struct FGiftSenderInfo {
	int32_t Gold; // 0x00(0x04)
	int32_t Diamond; // 0x04(0x04)
	struct FString playerName; // 0x08(0x10)
	struct FString PlayerId; // 0x18(0x10)
};

// ScriptStruct Solarland.MedalInfo
// Size: 0x10 (Inherited: 0x00)
struct FMedalInfo {
	int32_t MedalID; // 0x00(0x04)
	int32_t MedalType; // 0x04(0x04)
	int32_t MedalPos; // 0x08(0x04)
	int32_t MedalLv; // 0x0c(0x04)
};

// ScriptStruct Solarland.CharacterSkin
// Size: 0x08 (Inherited: 0x00)
struct FCharacterSkin {
	int32_t SkinId; // 0x00(0x04)
	int32_t SkinOwnerType; // 0x04(0x04)
};

// ScriptStruct Solarland.ShieldInfo
// Size: 0x08 (Inherited: 0x00)
struct FShieldInfo {
	int32_t ShieldID; // 0x00(0x04)
	float CurValue; // 0x04(0x04)
};

// ScriptStruct Solarland.WorldMarkData
// Size: 0x78 (Inherited: 0x0c)
struct FWorldMarkData : FFastArraySerializerItem {
	int32_t WorldMarkGUID; // 0x0c(0x04)
	struct FVector_NetQuantize WorldPos; // 0x10(0x0c)
	char PosInTeam; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	struct FVector2D ScreenCoordinate; // 0x20(0x08)
	enum class EWorldMarkType Type; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	int32_t ItemID; // 0x2c(0x04)
	int64_t ItemInstanceId; // 0x30(0x08)
	int32_t NameLocID; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FString IconImg; // 0x40(0x10)
	int32_t WeaponLevel; // 0x50(0x04)
	enum class EInteractableType InteractableType; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	int32_t MarkVoiceEventName; // 0x58(0x04)
	int32_t OuterBoxThisID; // 0x5c(0x04)
	float MarkTimeStamp; // 0x60(0x04)
	float LifeTime; // 0x64(0x04)
	float ExtraLiveTime; // 0x68(0x04)
	struct TWeakObjectPtr<struct AActor> AttachedActor; // 0x6c(0x08)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct Solarland.BattleCharacterData
// Size: 0x60 (Inherited: 0x00)
struct FBattleCharacterData {
	int32_t CharacterId; // 0x00(0x04)
	int32_t SkinId; // 0x04(0x04)
	int32_t CharacterLevel; // 0x08(0x04)
	int32_t TalentID; // 0x0c(0x04)
	int32_t UseTimes; // 0x10(0x04)
	int32_t CardPose; // 0x14(0x04)
	int32_t Cardbackground; // 0x18(0x04)
	int32_t CharacterExp; // 0x1c(0x04)
	int32_t Title; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	int64_t Expired; // 0x28(0x08)
	int32_t CombatScore; // 0x30(0x04)
	int32_t BagId; // 0x34(0x04)
	int32_t TailFlameId; // 0x38(0x04)
	int32_t CapsuleActorId; // 0x3c(0x04)
	int32_t DeathBoxId; // 0x40(0x04)
	int32_t CharacterOwnerType; // 0x44(0x04)
	struct TArray<struct FEquipVoiceData> Voice; // 0x48(0x10)
	int32_t KillReport; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// ScriptStruct Solarland.EquipVoiceData
// Size: 0x18 (Inherited: 0x00)
struct FEquipVoiceData {
	int32_t Type; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<int32_t> Ids; // 0x08(0x10)
};

// ScriptStruct Solarland.SolarBattleWeaponData
// Size: 0x08 (Inherited: 0x00)
struct FSolarBattleWeaponData {
	int32_t weaponid; // 0x00(0x04)
	int32_t SkinId; // 0x04(0x04)
};

// ScriptStruct Solarland.ExposeLocationMap
// Size: 0x58 (Inherited: 0x00)
struct FExposeLocationMap {
	struct TMap<struct ASolarPlayerState*, int32_t> InnerMap; // 0x00(0x50)
	struct ASolarPlayerState* Owner; // 0x50(0x08)
};

// ScriptStruct Solarland.SettlementTempData
// Size: 0xd8 (Inherited: 0x00)
struct FSettlementTempData {
	int32_t TotalAccountExp; // 0x00(0x04)
	int32_t AccountLevel; // 0x04(0x04)
	char pad_8[0x50]; // 0x08(0x50)
	int32_t CurCharacterLevel; // 0x58(0x04)
	int32_t TotalCharacterExp; // 0x5c(0x04)
	bool bCharExpFull; // 0x60(0x01)
	bool bHaveRankData; // 0x61(0x01)
	char pad_62[0x2]; // 0x62(0x02)
	int32_t RankBeforeScore; // 0x64(0x04)
	int32_t RankAfterScore; // 0x68(0x04)
	int32_t RankSurviveScore; // 0x6c(0x04)
	int32_t RankBeforeSurviveScore; // 0x70(0x04)
	int32_t RankDefeatScore; // 0x74(0x04)
	int32_t RankBeforeDefeatScore; // 0x78(0x04)
	float RankDefeatRatio; // 0x7c(0x04)
	int32_t RankLegend; // 0x80(0x04)
	char RankProtectType; // 0x84(0x01)
	bool IsRankFight; // 0x85(0x01)
	char pad_86[0x2]; // 0x86(0x02)
	int32_t WinninScoreID; // 0x88(0x04)
	int32_t BattlePassID; // 0x8c(0x04)
	int32_t BattlePassAddExp; // 0x90(0x04)
	int32_t BattlePassExp; // 0x94(0x04)
	struct TArray<int32_t> BattlePassTaskID; // 0x98(0x10)
	struct TArray<int32_t> BattlePassTaskWeek; // 0xa8(0x10)
	struct TArray<int32_t> BattlePassTaskAdd; // 0xb8(0x10)
	struct TArray<int32_t> BattlePassTaskVal; // 0xc8(0x10)
};

// ScriptStruct Solarland.KillEnemySnapshot
// Size: 0x18 (Inherited: 0x00)
struct FKillEnemySnapshot {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct Solarland.EquippedEmotesData
// Size: 0x10 (Inherited: 0x00)
struct FEquippedEmotesData {
	struct TArray<int32_t> EmoteData; // 0x00(0x10)
};

// ScriptStruct Solarland.SettlementCrateReward
// Size: 0x18 (Inherited: 0x00)
struct FSettlementCrateReward {
	int64_t crateID; // 0x00(0x08)
	struct TArray<struct FSettlementReward> Items; // 0x08(0x10)
};

// ScriptStruct Solarland.SettlementReward
// Size: 0x08 (Inherited: 0x00)
struct FSettlementReward {
	int32_t ItemID; // 0x00(0x04)
	int32_t Amount; // 0x04(0x04)
};

// ScriptStruct Solarland.SettlementParam_ExtraRewardInfo
// Size: 0x40 (Inherited: 0x00)
struct FSettlementParam_ExtraRewardInfo {
	int32_t TextID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString LocVariable; // 0x08(0x10)
	struct FString Content; // 0x18(0x10)
	struct FString ItemList; // 0x28(0x10)
	int32_t Order; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct Solarland.LastBattleInfo
// Size: 0x1c (Inherited: 0x00)
struct FLastBattleInfo {
	float MvpScore; // 0x00(0x04)
	int32_t KillNum; // 0x04(0x04)
	int32_t HitDown; // 0x08(0x04)
	int32_t AssistNum; // 0x0c(0x04)
	int32_t RescueNum; // 0x10(0x04)
	int32_t AliveTime; // 0x14(0x04)
	int32_t CauseDamage; // 0x18(0x04)
};

// ScriptStruct Solarland.ExpRankMedalData
// Size: 0x38 (Inherited: 0x00)
struct FExpRankMedalData {
	struct FString Area; // 0x00(0x10)
	struct FString Country; // 0x10(0x10)
	int32_t Rank; // 0x20(0x04)
	int32_t CharacterId; // 0x24(0x04)
	int32_t CharacterType; // 0x28(0x04)
	int32_t RankScore; // 0x2c(0x04)
	int32_t RankType; // 0x30(0x04)
	int32_t AutoID; // 0x34(0x04)
};

// ScriptStruct Solarland.InWaterActorInfo
// Size: 0x08 (Inherited: 0x00)
struct FInWaterActorInfo {
	bool bIsInWater; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float WaterLineHeight; // 0x04(0x04)
};

// ScriptStruct Solarland.SpawnedActorHandle
// Size: 0x04 (Inherited: 0x00)
struct FSpawnedActorHandle {
	uint32_t Handle; // 0x00(0x04)
};

// ScriptStruct Solarland.SolarPointDamageEvent
// Size: 0x110 (Inherited: 0xa8)
struct FSolarPointDamageEvent : FPointDamageEvent {
	bool bBreakShield; // 0xa8(0x01)
	bool bIgnoreShield; // 0xa9(0x01)
	char pad_AA[0x2]; // 0xaa(0x02)
	float ActualShieldDamage; // 0xac(0x04)
	bool bBreakArmor; // 0xb0(0x01)
	bool bIgnoreArmor; // 0xb1(0x01)
	char pad_B2[0x2]; // 0xb2(0x02)
	float ActualArmorDamage; // 0xb4(0x04)
	enum class ESolarAttributeType SolarAttributeType; // 0xb8(0x01)
	bool bPreFakeInvincible; // 0xb9(0x01)
	enum class EHealthChangeType HealthChangeType; // 0xba(0x01)
	char pad_BB[0x5]; // 0xbb(0x05)
	struct ASolarAbility* DamageAbility; // 0xc0(0x08)
	struct USolarAbilityEffect* DamageAbilityEffect; // 0xc8(0x08)
	enum class EDamageResultType ResultType; // 0xd0(0x01)
	bool bJustForShield; // 0xd1(0x01)
	bool bCanDamageTeamate; // 0xd2(0x01)
	char pad_D3[0x1]; // 0xd3(0x01)
	int32_t UseWeaponID; // 0xd4(0x04)
	enum class ESCMDamageType DamageType; // 0xd8(0x01)
	char pad_D9[0x3]; // 0xd9(0x03)
	struct TWeakObjectPtr<struct AActor> DamageCauser; // 0xdc(0x08)
	char pad_E4[0xc]; // 0xe4(0x0c)
	struct FString HitBoneName; // 0xf0(0x10)
	char bHitVehicleWeakPoint : 1; // 0x100(0x01)
	char bHitHumanoidTargetHead : 1; // 0x100(0x01)
	char pad_100_2 : 6; // 0x100(0x01)
	char pad_101[0xf]; // 0x101(0x0f)
};

// ScriptStruct Solarland.ReconnectionParams
// Size: 0x01 (Inherited: 0x00)
struct FReconnectionParams {
	bool bIsCrouched; // 0x00(0x01)
};

// ScriptStruct Solarland.PlayerWeaponMsg
// Size: 0x18 (Inherited: 0x00)
struct FPlayerWeaponMsg {
	enum class EPlayerWeaponMsgType MsgType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString MsgDetail; // 0x08(0x10)
};

// ScriptStruct Solarland.ScannedInfo_NetQuantize
// Size: 0x18 (Inherited: 0x00)
struct FScannedInfo_NetQuantize {
	uint32_t UniqueId; // 0x00(0x04)
	char TargetType; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	uint32_t VehicleID; // 0x08(0x04)
	struct FVector_NetQuantize TargetLocation; // 0x0c(0x0c)
};

// ScriptStruct Solarland.RestoreAbilityInfo
// Size: 0x20 (Inherited: 0x00)
struct FRestoreAbilityInfo {
	struct FGameplayAbilitySpecHandle Handle; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FPredictionKey ActivationPredictionKey; // 0x08(0x18)
};

// ScriptStruct Solarland.BackpackStatisticsInfo
// Size: 0x1c (Inherited: 0x00)
struct FBackpackStatisticsInfo {
	bool IsVertical; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector PlayerStartLocation; // 0x04(0x0c)
	struct FVector PlayerEndLocation; // 0x10(0x0c)
};

// ScriptStruct Solarland.SoundGroupPlayContext
// Size: 0x08 (Inherited: 0x00)
struct FSoundGroupPlayContext {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct Solarland.SoundGroupPlayContextByCharacter
// Size: 0x20 (Inherited: 0x08)
struct FSoundGroupPlayContextByCharacter : FSoundGroupPlayContext {
	struct TWeakObjectPtr<struct ASolarCharacter> Self; // 0x08(0x08)
	struct TWeakObjectPtr<struct ASolarCharacter> Instigator; // 0x10(0x08)
	struct TWeakObjectPtr<struct ASolarCharacter> LocalCharacter; // 0x18(0x08)
};

// ScriptStruct Solarland.HitTraceInfo
// Size: 0x28 (Inherited: 0x00)
struct FHitTraceInfo {
	struct TWeakObjectPtr<struct AActor> CausingActor; // 0x00(0x08)
	struct FVector_NetQuantizeNormal TraceDirection; // 0x08(0x0c)
	struct FVector DamageCauserLocation; // 0x14(0x0c)
	float Damage; // 0x20(0x04)
	enum class EWeaponType WeaponType; // 0x24(0x01)
	bool bIsVehicleHitTrace; // 0x25(0x01)
	bool IsBump; // 0x26(0x01)
	char pad_27[0x1]; // 0x27(0x01)
};

// ScriptStruct Solarland.HitSoundReplicationData
// Size: 0x80 (Inherited: 0x00)
struct FHitSoundReplicationData {
	uint16_t HitCount; // 0x00(0x02)
	char DirtyDataMask; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	struct FHitSoundData HitData_Default; // 0x04(0x1c)
	struct FHitSoundData HitData_Weapon; // 0x20(0x1c)
	struct FHitSoundData HitData_Melee; // 0x3c(0x1c)
	struct FHitSoundData HitData_Skill; // 0x58(0x1c)
	char pad_74[0xc]; // 0x74(0x0c)
};

// ScriptStruct Solarland.HitSoundData
// Size: 0x1c (Inherited: 0x00)
struct FHitSoundData {
	struct TWeakObjectPtr<struct AActor> Instigator; // 0x00(0x08)
	enum class EHitSoundSourceType SourceType; // 0x08(0x01)
	enum class EHitSoundTargetType TargetType; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	struct FName SubTableKey; // 0x0c(0x08)
	struct FName SubTableKey2; // 0x14(0x08)
};

// ScriptStruct Solarland.OrnamentMontageInfo
// Size: 0x18 (Inherited: 0x00)
struct FOrnamentMontageInfo {
	struct UAnimMontage* ActiveMontage; // 0x00(0x08)
	struct FGameplayTag OrnamentTag; // 0x08(0x08)
	char bForcePlayBit : 1; // 0x10(0x01)
	char pad_10_1 : 7; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Solarland.ShieldSoundData
// Size: 0x50 (Inherited: 0x00)
struct FShieldSoundData {
	struct TMap<enum class EShieldSoundEventType, enum class ECharacterSoundOpt> SoundData; // 0x00(0x50)
};

// ScriptStruct Solarland.SingleCruiseBaseParam
// Size: 0x20 (Inherited: 0x00)
struct FSingleCruiseBaseParam {
	char pad_0[0x20]; // 0x00(0x20)
};

// ScriptStruct Solarland.VehicleEjectParams
// Size: 0x10 (Inherited: 0x00)
struct FVehicleEjectParams {
	float EjectTime; // 0x00(0x04)
	float EjectDistance; // 0x04(0x04)
	float EjectBreakableTime; // 0x08(0x04)
	float EjectCameraFadeOutTime; // 0x0c(0x04)
};

// ScriptStruct Solarland.BattleUpgradeEffectContainer
// Size: 0x120 (Inherited: 0x108)
struct FBattleUpgradeEffectContainer : FFastArraySerializer {
	struct TArray<struct FBattleUpgradeEffect> DataArray; // 0x108(0x10)
	struct ASolarCharacter* Owner; // 0x118(0x08)
};

// ScriptStruct Solarland.BattleUpgradeEffect
// Size: 0x28 (Inherited: 0x0c)
struct FBattleUpgradeEffect : FFastArraySerializerItem {
	int32_t Level; // 0x0c(0x04)
	int32_t EffectID; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<int32_t> EffectCandidate; // 0x18(0x10)
};

// ScriptStruct Solarland.BoardedVehicleInfo
// Size: 0x10 (Inherited: 0x00)
struct FBoardedVehicleInfo {
	struct ASolarVehiclePawn* BoardedVehicle; // 0x00(0x08)
	int32_t BoardedSeatIndex; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Solarland.CriticalHitInfo
// Size: 0x68 (Inherited: 0x00)
struct FCriticalHitInfo {
	struct ASolarPlayerState* Instigator; // 0x00(0x08)
	float Damage; // 0x08(0x04)
	float DamageTime; // 0x0c(0x04)
	int32_t LastDamageWeaponID; // 0x10(0x04)
	char pad_14[0x54]; // 0x14(0x54)
};

// ScriptStruct Solarland.RadarDataSpecContainer
// Size: 0x120 (Inherited: 0x108)
struct FRadarDataSpecContainer : FFastArraySerializer {
	struct TArray<struct FRadarDataSpec> Radars; // 0x108(0x10)
	struct USolarRadarComponent* Owner; // 0x118(0x08)
};

// ScriptStruct Solarland.RadarDataSpec
// Size: 0x28 (Inherited: 0x0c)
struct FRadarDataSpec : FFastArraySerializerItem {
	struct FGameplayAbilitySpecHandle RadarHandle; // 0x0c(0x04)
	char RadarType; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	struct FVector2D RadarRange; // 0x14(0x08)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct APawn* RadarSpawner; // 0x20(0x08)
};

// ScriptStruct Solarland.CharacterOperationEvent
// Size: 0x10 (Inherited: 0x00)
struct FCharacterOperationEvent {
	enum class ECharacterOperation Name; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UObject* Target; // 0x08(0x08)
};

// ScriptStruct Solarland.BackpackJetPrepelInfo
// Size: 0x0c (Inherited: 0x00)
struct FBackpackJetPrepelInfo {
	bool IsPropelling; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t PropellingCounter; // 0x04(0x04)
	enum class EFXJetType JetType; // 0x08(0x01)
	bool bCheckGround; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
};

// ScriptStruct Solarland.WeaponIgnoreScopeLists
// Size: 0x20 (Inherited: 0x00)
struct FWeaponIgnoreScopeLists {
	struct TArray<enum class EWeaponPartType> Weapon1IgnoreList; // 0x00(0x10)
	struct TArray<enum class EWeaponPartType> Weapon2IgnoreList; // 0x10(0x10)
};

// ScriptStruct Solarland.CharacterTagListenerForOrnamentComp
// Size: 0x58 (Inherited: 0x00)
struct FCharacterTagListenerForOrnamentComp {
	struct TSet<struct FOrnamentCompAndVisibilityConfigPair> OrnamentCompPairs; // 0x00(0x50)
	char pad_50[0x8]; // 0x50(0x08)
};

// ScriptStruct Solarland.OrnamentCompAndVisibilityConfigPair
// Size: 0x10 (Inherited: 0x00)
struct FOrnamentCompAndVisibilityConfigPair {
	struct TWeakObjectPtr<struct USceneComponent> OrnamentComp; // 0x00(0x08)
	struct UOrnamentComponentVisibilityConfig* VisibilityConfig; // 0x08(0x08)
};

// ScriptStruct Solarland.CustomParamConfig
// Size: 0x20 (Inherited: 0x00)
struct FCustomParamConfig {
	int32_t DisplayName; // 0x00(0x04)
	int32_t Desc; // 0x04(0x04)
	enum class ECustomParamType ParamType; // 0x08(0x01)
	enum class ECustomParamValueType ValueType; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	int32_t DefaultIndex; // 0x0c(0x04)
	struct TArray<float> ValueRange; // 0x10(0x10)
};

// ScriptStruct Solarland.UserSetting
// Size: 0x20 (Inherited: 0x00)
struct FUserSetting {
	int32_t Name; // 0x00(0x04)
	int32_t Category; // 0x04(0x04)
	enum class ECustomParamType ParamType; // 0x08(0x01)
	enum class ECustomParamValueType ValueType; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	int32_t Index; // 0x0c(0x04)
	struct TArray<float> ValueRange; // 0x10(0x10)
};

// ScriptStruct Solarland.CategoryConfig
// Size: 0x40 (Inherited: 0x00)
struct FCategoryConfig {
	int32_t Category; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FCustomParamConfig> Configs; // 0x08(0x10)
	struct TSoftClassPtr<UObject> StyleClass; // 0x18(0x28)
};

// ScriptStruct Solarland.FixedAntiCheatData
// Size: 0x1c (Inherited: 0x00)
struct FFixedAntiCheatData {
	int32_t FOV; // 0x00(0x04)
	enum class EAspectRatioAxisConstraint AxisConstraint; // 0x04(0x01)
	bool bAssistAim; // 0x05(0x01)
	char pad_6[0x2]; // 0x06(0x02)
	struct FVector HeadBoneScale; // 0x08(0x0c)
	bool CurrWeaponRecoil; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	float LatestTimeDiscrepancyError; // 0x18(0x04)
};

// ScriptStruct Solarland.ReplayActivityHeatFragment
// Size: 0x30 (Inherited: 0x00)
struct FReplayActivityHeatFragment {
	int32_t FragmentId; // 0x00(0x04)
	enum class EPlayerActivityHeatType ActivityHeatType; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float TotalScore; // 0x08(0x04)
	float BeginTime; // 0x0c(0x04)
	float EndTime; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<struct FReplayActivityKillDetail> ActivityKillDetails; // 0x18(0x10)
	int32_t KillNum; // 0x28(0x04)
	float ActivityHotTime; // 0x2c(0x04)
};

// ScriptStruct Solarland.ReplayActivityKillDetail
// Size: 0x0c (Inherited: 0x00)
struct FReplayActivityKillDetail {
	float KillTime; // 0x00(0x04)
	enum class EReplayActivityHeatKillUseType KillUseType; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	int32_t KillToolID; // 0x08(0x04)
};

// ScriptStruct Solarland.SolarGameModeInfo
// Size: 0x28 (Inherited: 0x00)
struct FSolarGameModeInfo {
	int32_t GameModeId; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString MapName; // 0x08(0x10)
	int32_t NumMode; // 0x18(0x04)
	int32_t PlayerCount; // 0x1c(0x04)
	int32_t TeamCount; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct Solarland.SolarPlayerReport
// Size: 0x498 (Inherited: 0x00)
struct FSolarPlayerReport {
	struct FString PlayerId; // 0x00(0x10)
	uint64_t UserId; // 0x10(0x08)
	struct FString NickName; // 0x18(0x10)
	int32_t CharacterId; // 0x28(0x04)
	int32_t SkinId; // 0x2c(0x04)
	int32_t PlayerRank; // 0x30(0x04)
	int32_t Gender; // 0x34(0x04)
	int32_t AvatarID; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FString AvatarUrl; // 0x40(0x10)
	int32_t AccountFlag; // 0x50(0x04)
	int32_t TeamRank; // 0x54(0x04)
	int32_t TeamID; // 0x58(0x04)
	int32_t PosInTeam; // 0x5c(0x04)
	bool bHasHangUpBehavior; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	int32_t KillNum; // 0x64(0x04)
	int32_t KillNumToRealPlayer; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct TArray<int32_t> VehicleKillNum_ID; // 0x70(0x10)
	struct TArray<int32_t> VehicleKillNum_Value; // 0x80(0x10)
	int32_t KillTeammate; // 0x90(0x04)
	int32_t KillInAirNum; // 0x94(0x04)
	int32_t KillDownInAirNum; // 0x98(0x04)
	int32_t WeaponSkillKillNum; // 0x9c(0x04)
	int32_t P_KillStreak; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct TArray<int32_t> KillStreakHistory; // 0xa8(0x10)
	int32_t RevengeNum; // 0xb8(0x04)
	int32_t DeathNum; // 0xbc(0x04)
	int32_t KillDownNum; // 0xc0(0x04)
	int32_t KillDownTeammate; // 0xc4(0x04)
	float AccurateDamage; // 0xc8(0x04)
	int32_t AccurateDameageTimes; // 0xcc(0x04)
	int32_t AccurateKillTimes; // 0xd0(0x04)
	int32_t AccurateKillDownTimes; // 0xd4(0x04)
	float CauseDamage; // 0xd8(0x04)
	float CauseDamageToRealPlayer; // 0xdc(0x04)
	float ReceivedDamage; // 0xe0(0x04)
	int32_t AssistNum; // 0xe4(0x04)
	float CollectEnergy; // 0xe8(0x04)
	int32_t BuyESElectricNum; // 0xec(0x04)
	int32_t ResurrectionCapsule; // 0xf0(0x04)
	int32_t TeamFriendRevive; // 0xf4(0x04)
	float ReceivedHeal; // 0xf8(0x04)
	float HealSelf; // 0xfc(0x04)
	float TeammateHeal; // 0x100(0x04)
	int32_t OpenAirBoxNum; // 0x104(0x04)
	float LifeTime; // 0x108(0x04)
	int32_t SaveCount; // 0x10c(0x04)
	int32_t FlyCount; // 0x110(0x04)
	int32_t VehicleTime; // 0x114(0x04)
	int32_t CurCharacterLevel; // 0x118(0x04)
	int32_t TotalCharacterExp; // 0x11c(0x04)
	bool bCharExpFull; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct TArray<int32_t> CharacterExpReason; // 0x128(0x10)
	int32_t CharacterExp; // 0x138(0x04)
	int32_t AccountExp; // 0x13c(0x04)
	int32_t TotalAccountExp; // 0x140(0x04)
	int32_t AccountLevel; // 0x144(0x04)
	bool bHaveRankData; // 0x148(0x01)
	char pad_149[0x3]; // 0x149(0x03)
	int32_t RankID; // 0x14c(0x04)
	int32_t RankBeforeScore; // 0x150(0x04)
	int32_t RankSurviveScore; // 0x154(0x04)
	int32_t RankBeforeSurviveScore; // 0x158(0x04)
	int32_t RankDefeatScore; // 0x15c(0x04)
	int32_t RankBeforeDefeatScore; // 0x160(0x04)
	float RankDefeatRatio; // 0x164(0x04)
	int32_t RankAfterScore; // 0x168(0x04)
	int32_t RankLegend; // 0x16c(0x04)
	char RankProtectType; // 0x170(0x01)
	bool IsRankFight; // 0x171(0x01)
	char pad_172[0x2]; // 0x172(0x02)
	int32_t WinninScoreID; // 0x174(0x04)
	int32_t Zomborg; // 0x178(0x04)
	float MvpScore; // 0x17c(0x04)
	float KDA; // 0x180(0x04)
	bool IsAce; // 0x184(0x01)
	bool IsVictory; // 0x185(0x01)
	bool IsValid; // 0x186(0x01)
	char pad_187[0x1]; // 0x187(0x01)
	struct TArray<int32_t> SettlementItems; // 0x188(0x10)
	struct TArray<struct FString> StringExtraRewards; // 0x198(0x10)
	struct TArray<int32_t> SendGiftGold; // 0x1a8(0x10)
	struct TArray<int32_t> SendGiftDiamond; // 0x1b8(0x10)
	struct TArray<struct FString> SendGiftPlayerName; // 0x1c8(0x10)
	struct TArray<struct FString> SendGiftPlayerID; // 0x1d8(0x10)
	struct TArray<int32_t> WeaponExpIds; // 0x1e8(0x10)
	struct TArray<int32_t> WeaponLevel; // 0x1f8(0x10)
	struct TArray<int32_t> CurWeaponExp; // 0x208(0x10)
	struct TArray<int32_t> WeaponExps; // 0x218(0x10)
	struct TArray<int32_t> WeaponKillNum_ID; // 0x228(0x10)
	struct TArray<float> WeaponKillNum_Value; // 0x238(0x10)
	struct TArray<int32_t> WeaponDamage_ID; // 0x248(0x10)
	struct TArray<float> WeaponDamage_Value; // 0x258(0x10)
	struct TArray<int32_t> VehicleDamage_ID; // 0x268(0x10)
	struct TArray<float> VehicleDamage_Value; // 0x278(0x10)
	struct TArray<int32_t> VehicleDistance_ID; // 0x288(0x10)
	struct TArray<int32_t> VehicleDistance_Value; // 0x298(0x10)
	int32_t GainCombatScore; // 0x2a8(0x04)
	int32_t GameModeSubID; // 0x2ac(0x04)
	struct FString KillerPlayerId; // 0x2b0(0x10)
	uint64_t KillerUserId; // 0x2c0(0x08)
	struct FString KillerNickName; // 0x2c8(0x10)
	struct FString KillerOS; // 0x2d8(0x10)
	struct FString OS; // 0x2e8(0x10)
	struct TArray<int32_t> CharacterKillNumIDs; // 0x2f8(0x10)
	struct TArray<int32_t> CharacterKillNumValues; // 0x308(0x10)
	int32_t WarmType; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct TArray<int32_t> AchievementIDs; // 0x320(0x10)
	struct TArray<int32_t> AchievementValues; // 0x330(0x10)
	int32_t LikeValue; // 0x340(0x04)
	char pad_344[0x4]; // 0x344(0x04)
	struct TArray<int32_t> StrategyConditionIDs; // 0x348(0x10)
	int32_t SettlementDisplayStrategyID; // 0x358(0x04)
	int32_t LastUseVehicleID; // 0x35c(0x04)
	struct TArray<struct FString> SavedTeammateIDArr; // 0x360(0x10)
	struct TArray<int32_t> SavedTeammateBonusArr; // 0x370(0x10)
	struct TArray<char> SettlementRewards; // 0x380(0x10)
	struct TArray<char> CrateRewardData; // 0x390(0x10)
	struct TArray<char> CollectionItems; // 0x3a0(0x10)
	struct FString ClanId; // 0x3b0(0x10)
	int32_t KnockoutPoints; // 0x3c0(0x04)
	bool bIsKnockoutPointsValid; // 0x3c4(0x01)
	char pad_3C5[0x3]; // 0x3c5(0x03)
	int32_t BattlePassAddExp; // 0x3c8(0x04)
	int32_t BattlePassExp; // 0x3cc(0x04)
	int32_t BattlePassID; // 0x3d0(0x04)
	char pad_3D4[0x4]; // 0x3d4(0x04)
	struct TArray<int32_t> BattlePassTaskWeek; // 0x3d8(0x10)
	struct TArray<int32_t> BattlePassTaskID; // 0x3e8(0x10)
	struct TArray<int32_t> BattlePassTaskAdd; // 0x3f8(0x10)
	struct TArray<int32_t> BattlePassTaskVal; // 0x408(0x10)
	struct TArray<int32_t> UsedCharacterIDs; // 0x418(0x10)
	int32_t CardPose; // 0x428(0x04)
	int32_t Cardbackground; // 0x42c(0x04)
	int32_t SameClanCnt; // 0x430(0x04)
	int32_t CombatScore; // 0x434(0x04)
	bool IsCheater; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct TArray<char> SettlePunishTypes; // 0x440(0x10)
	int32_t MedicineUseCount; // 0x450(0x04)
	int32_t DriveHoverCarInWaterDistance; // 0x454(0x04)
	int32_t SwimDistance; // 0x458(0x04)
	int32_t DanceCount; // 0x45c(0x04)
	int32_t PosionWalkDistance; // 0x460(0x04)
	int32_t ShieldExpGainCount; // 0x464(0x04)
	int32_t UpgradeShieldCount; // 0x468(0x04)
	int32_t UpgradeRedShieldCount; // 0x46c(0x04)
	int32_t JumpBoardUseCount; // 0x470(0x04)
	int32_t TerminaterCount; // 0x474(0x04)
	int32_t CarSkillCount; // 0x478(0x04)
	int32_t UltimateSkillUseCount; // 0x47c(0x04)
	int32_t TacticalSkillUseCount; // 0x480(0x04)
	char pad_484[0x4]; // 0x484(0x04)
	struct TArray<struct FString> ReCombatLimitPlayer; // 0x488(0x10)
};

// ScriptStruct Solarland.SolarDamageText
// Size: 0x28 (Inherited: 0x00)
struct FSolarDamageText {
	bool bHitHead; // 0x00(0x01)
	bool bHitShield; // 0x01(0x01)
	bool bBrokenShield; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	int32_t Damage; // 0x04(0x04)
	struct TWeakObjectPtr<struct AActor> Target; // 0x08(0x08)
	struct TWeakObjectPtr<struct AActor> Source; // 0x10(0x08)
	struct FVector HitLocation; // 0x18(0x0c)
	uint32_t TargetUniqueID; // 0x24(0x04)
};

// ScriptStruct Solarland.ScreenshotSetting
// Size: 0x40 (Inherited: 0x00)
struct FScreenshotSetting {
	bool EnableOnCurrentReportGameCheating; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t MaxCountInRound; // 0x04(0x04)
	struct TArray<bool> ScreenshotMoment; // 0x08(0x10)
	int32_t ScreenshotInterval; // 0x18(0x04)
	int32_t ScreenshotWidth; // 0x1c(0x04)
	int32_t ScreenshotQuality; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FString ImageSaveType; // 0x28(0x10)
	enum class EShotModeFlag ScreenshotMode; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	int32_t ImageMaxSize; // 0x3c(0x04)
};

// ScriptStruct Solarland.SolarInputModeDataBase
// Size: 0x10 (Inherited: 0x00)
struct FSolarInputModeDataBase {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct Solarland.LocTextParam
// Size: 0x18 (Inherited: 0x00)
struct FLocTextParam {
	struct FString ParamName; // 0x00(0x10)
	int32_t LocTextID; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Solarland.SShotImageInfo
// Size: 0x78 (Inherited: 0x00)
struct FSShotImageInfo {
	struct FString UserId; // 0x00(0x10)
	struct FString PlayerId; // 0x10(0x10)
	struct FString BattleID; // 0x20(0x10)
	int64_t ScreenshotTime; // 0x30(0x08)
	int32_t ImageSize; // 0x38(0x04)
	int32_t ImageWidth; // 0x3c(0x04)
	int32_t ImageHeight; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FString ImageType; // 0x48(0x10)
	struct FString ImageBuffer; // 0x58(0x10)
	char pad_68[0x10]; // 0x68(0x10)
};

// ScriptStruct Solarland.GameplayHitInfo
// Size: 0x20 (Inherited: 0x00)
struct FGameplayHitInfo {
	char pad_0[0x20]; // 0x00(0x20)
};

// ScriptStruct Solarland.AbilityCooldownTimer
// Size: 0x0c (Inherited: 0x00)
struct FAbilityCooldownTimer {
	struct FGameplayTag AbilityCooldownTag; // 0x00(0x08)
	float AbilityAppliedTime; // 0x08(0x04)
};

// ScriptStruct Solarland.SolarIgnoreCollisionTypeData
// Size: 0x10 (Inherited: 0x00)
struct FSolarIgnoreCollisionTypeData {
	struct TArray<struct AActor*> Actors; // 0x00(0x10)
};

// ScriptStruct Solarland.NoticeData
// Size: 0xa0 (Inherited: 0x00)
struct FNoticeData {
	int32_t NoticeId; // 0x00(0x04)
	enum class ECustomNoticeType NoticeType; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float ConfigShowTime; // 0x08(0x04)
	float Duration; // 0x0c(0x04)
	struct FString NoticeText; // 0x10(0x10)
	enum class ECustomNoticeColor NoticeColor; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FString NoticeClassPath; // 0x28(0x10)
	struct FString NoticeIconPath; // 0x38(0x10)
	struct TWeakObjectPtr<struct UUINoticeBase> NoticeWidget; // 0x48(0x08)
	struct TMap<struct FString, struct FString> Param; // 0x50(0x50)
};

// ScriptStruct Solarland.SCMReplicateHostData
// Size: 0x48 (Inherited: 0x00)
struct FSCMReplicateHostData {
	enum class ESCMHostType HostType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString HostID; // 0x08(0x10)
	struct TArray<struct FSCMRepData> RepDataArray; // 0x18(0x10)
	struct TArray<struct FSCMRepDataArray> RepArrDataArray; // 0x28(0x10)
	struct TArray<struct FSCMRepDataMap> RepMapDataArray; // 0x38(0x10)
};

// ScriptStruct Solarland.SCMRepDataMap
// Size: 0x78 (Inherited: 0x00)
struct FSCMRepDataMap {
	struct FString Name; // 0x00(0x10)
	enum class ESCMDataType Type; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<enum class ESCMDataChangeType> ChangeTypeArray; // 0x18(0x10)
	struct TArray<struct FString> KeyArray; // 0x28(0x10)
	struct TArray<int32_t> VInt; // 0x38(0x10)
	struct TArray<float> VFloat; // 0x48(0x10)
	struct TArray<struct FVector_NetQuantize100> VVector; // 0x58(0x10)
	struct TArray<struct FString> VString; // 0x68(0x10)
};

// ScriptStruct Solarland.SCMRepDataArray
// Size: 0x78 (Inherited: 0x00)
struct FSCMRepDataArray {
	struct FString Name; // 0x00(0x10)
	enum class ESCMDataType Type; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<enum class ESCMDataChangeType> ChangeTypeArray; // 0x18(0x10)
	struct TArray<uint32_t> ChangeIndexArray; // 0x28(0x10)
	struct TArray<int32_t> VInt; // 0x38(0x10)
	struct TArray<float> VFloat; // 0x48(0x10)
	struct TArray<struct FVector_NetQuantize100> VVector; // 0x58(0x10)
	struct TArray<struct FString> VString; // 0x68(0x10)
};

// ScriptStruct Solarland.SCMRepData
// Size: 0x38 (Inherited: 0x00)
struct FSCMRepData {
	struct FString Name; // 0x00(0x10)
	enum class ESCMDataType Type; // 0x10(0x01)
	enum class ESCMDataChangeType DataChangeType; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	int32_t VInt; // 0x14(0x04)
	float VFloat; // 0x18(0x04)
	struct FVector_NetQuantize100 VVector; // 0x1c(0x0c)
	struct FString VString; // 0x28(0x10)
};

// ScriptStruct Solarland.BattlePassInfo
// Size: 0x28 (Inherited: 0x00)
struct FBattlePassInfo {
	struct TArray<struct FTaskBriefData> tasks; // 0x00(0x10)
	int64_t BattlePassID; // 0x10(0x08)
	int64_t currWeek; // 0x18(0x08)
	int64_t maxWeek; // 0x20(0x08)
};

// ScriptStruct Solarland.TaskBriefData
// Size: 0x40 (Inherited: 0x00)
struct FTaskBriefData {
	int64_t TaskID; // 0x00(0x08)
	int64_t BaseValue; // 0x08(0x08)
	int64_t CurValue; // 0x10(0x08)
	char pad_18[0x8]; // 0x18(0x08)
	int64_t status; // 0x20(0x08)
	enum class ETaskPage page; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	int64_t week; // 0x30(0x08)
	bool IsMarked; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// ScriptStruct Solarland.TaskUpdateInfo
// Size: 0x50 (Inherited: 0x00)
struct FTaskUpdateInfo {
	bool delAllTask; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<int64_t> delIDs; // 0x08(0x10)
	struct FBattlePassInfo Task; // 0x18(0x28)
	struct FString PlayerId; // 0x40(0x10)
};

// ScriptStruct Solarland.WeaponPartsData
// Size: 0x14 (Inherited: 0x00)
struct FWeaponPartsData {
	int32_t ScopeId; // 0x00(0x04)
	int32_t GripID; // 0x04(0x04)
	int32_t GunStockID; // 0x08(0x04)
	int32_t MuzzleID; // 0x0c(0x04)
	int32_t ClipID; // 0x10(0x04)
};

// ScriptStruct Solarland.BattlegroundGlobalData
// Size: 0x40 (Inherited: 0x00)
struct FBattlegroundGlobalData {
	int32_t MaxBattleTime; // 0x00(0x04)
	char WaitingLandCountDownTime; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float BattlePrepareTime; // 0x08(0x04)
	float RebirthWaitTime; // 0x0c(0x04)
	float RebirthInvincibleTime; // 0x10(0x04)
	float DeployConfirmTime; // 0x14(0x04)
	int32_t BatttleEndLeaveTime; // 0x18(0x04)
	float VictoryScore; // 0x1c(0x04)
	float BonusScorePerSec; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct TArray<struct FPersonalScoreData> PersonalScoreArray; // 0x28(0x10)
	int32_t AiLevel; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// ScriptStruct Solarland.PersonalScoreData
// Size: 0x08 (Inherited: 0x00)
struct FPersonalScoreData {
	enum class EPersonalScoreType ScoreType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t Score; // 0x04(0x04)
};

// ScriptStruct Solarland.BattlegroundScoreData
// Size: 0x0c (Inherited: 0x00)
struct FBattlegroundScoreData {
	enum class EFactionType Faction; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float Score; // 0x04(0x04)
	enum class EMatchResult MatchResult; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
};

// ScriptStruct Solarland.BattlegroundSubModeData
// Size: 0x1c (Inherited: 0x00)
struct FBattlegroundSubModeData {
	int32_t SubModeID; // 0x00(0x04)
	int32_t MapID; // 0x04(0x04)
	struct FVector2D MapCenter; // 0x08(0x08)
	float MapFOV; // 0x10(0x04)
	struct FVector2D SafeAreaCenter; // 0x14(0x08)
};

// ScriptStruct Solarland.BasicUserSettings
// Size: 0x11 (Inherited: 0x00)
struct FBasicUserSettings {
	bool bOpenUniversalMark; // 0x00(0x01)
	enum class EBasicSettingBool OpenOffScreen; // 0x01(0x01)
	bool bOpenQuickChat; // 0x02(0x01)
	bool bAutoOverturn; // 0x03(0x01)
	bool bPowerAnim; // 0x04(0x01)
	bool bOpenRecruitRecommend; // 0x05(0x01)
	enum class ESolarGyroscopeChooseType curGyroscpeChooseLevel; // 0x06(0x01)
	bool bHorizontalGyroscopeInvert; // 0x07(0x01)
	bool bVerticalGyroscopeInvert; // 0x08(0x01)
	enum class ESolarDamageTextDisplayModeType CurrentDamageTextDisplayMode; // 0x09(0x01)
	enum class EBasicSettingBool OpenHighlightMoment; // 0x0a(0x01)
	enum class EBasicSettingBool OpenOutline; // 0x0b(0x01)
	bool bShowInputKeyTips; // 0x0c(0x01)
	bool bEnableGamepadInput; // 0x0d(0x01)
	enum class EBasicSettingBool OpenScreenDamageEffect; // 0x0e(0x01)
	bool bOpenMiniMapRotate; // 0x0f(0x01)
	bool bOpenDirectionBlood3D; // 0x10(0x01)
};

// ScriptStruct Solarland.CharacterVoiceUserSettings
// Size: 0x01 (Inherited: 0x00)
struct FCharacterVoiceUserSettings {
	enum class ESolarSupportLanguages CurVoiceLanguage; // 0x00(0x01)
};

// ScriptStruct Solarland.ChatOperatorUserSettings
// Size: 0x02 (Inherited: 0x00)
struct FChatOperatorUserSettings {
	enum class ESolarChatOperatorType Speaker; // 0x00(0x01)
	enum class ESolarChatOperatorType Mic; // 0x01(0x01)
};

// ScriptStruct Solarland.VehicleControlUserSettings
// Size: 0x05 (Inherited: 0x00)
struct FVehicleControlUserSettings {
	enum class EWheeledVehicleDriveUserType WheeledVehicleDriveType; // 0x00(0x01)
	bool bCanAdjustInAir; // 0x01(0x01)
	bool bCanAutoSteering; // 0x02(0x01)
	enum class EWheeledVehicleDriveUserType LastWheeledVehicleDriveType; // 0x03(0x01)
	bool bCanVehicleCameraShake; // 0x04(0x01)
};

// ScriptStruct Solarland.GraphicsUserSettings
// Size: 0x60 (Inherited: 0x00)
struct FGraphicsUserSettings {
	enum class ESolarFrameRateLevel FpsLevel; // 0x00(0x01)
	enum class ESolarContentScaleFactorLevel ContentScaleFactorLevel; // 0x01(0x01)
	enum class ESolarColorTheme ColorThemeType; // 0x02(0x01)
	bool MSAAIsEnabled; // 0x03(0x01)
	struct FFloatValue AdaptationUIValue; // 0x04(0x04)
	bool EnableDynamicShadow; // 0x08(0x01)
	enum class ESolarGraphicsQualityLevel SelectQualityLevel; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	struct FFloatValue CustomizedCharacterCameraFOV; // 0x0c(0x04)
	int32_t SavedVersion; // 0x10(0x04)
	char pad_14[0x4c]; // 0x14(0x4c)
};

// ScriptStruct Solarland.FloatValue
// Size: 0x04 (Inherited: 0x00)
struct FFloatValue {
	float Value; // 0x00(0x04)
};

// ScriptStruct Solarland.LanguageUserSettings
// Size: 0x03 (Inherited: 0x00)
struct FLanguageUserSettings {
	enum class ESolarSupportLanguages CurLanguage; // 0x00(0x01)
	enum class ESolarSupportLanguages CurCharacterVoiceLanguage; // 0x01(0x01)
	bool HasLoadedChinese; // 0x02(0x01)
};

// ScriptStruct Solarland.PersonalityUserSettings
// Size: 0x88 (Inherited: 0x00)
struct FPersonalityUserSettings {
	struct TArray<struct FColorPreset> TeammatePerspectiveColors; // 0x00(0x10)
	struct TArray<struct FColorPreset> OpponentPerspectiveColors; // 0x10(0x10)
	struct TArray<struct FParticlePreset> BloodMistColors; // 0x20(0x10)
	struct FColorValue TeammatePerspectiveColor; // 0x30(0x10)
	struct FColorValue OpponentPerspectiveColor; // 0x40(0x10)
	struct TSoftObjectPtr<UParticleSystem> BloodMistParticle; // 0x50(0x28)
	int32_t TeammateColor; // 0x78(0x04)
	int32_t OpponentColor; // 0x7c(0x04)
	int32_t BloodMistColor; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct Solarland.ColorValue
// Size: 0x10 (Inherited: 0x00)
struct FColorValue {
	struct FLinearColor Value; // 0x00(0x10)
};

// ScriptStruct Solarland.ParticlePreset
// Size: 0x48 (Inherited: 0x00)
struct FParticlePreset {
	int32_t ColorID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TSoftObjectPtr<UParticleSystem> Particle; // 0x08(0x28)
	struct FColorValue UIColor; // 0x30(0x10)
	int32_t ColorNameLocalText; // 0x40(0x04)
	bool bNotShowDomestic; // 0x44(0x01)
	bool bDefault; // 0x45(0x01)
	bool bDefaultDomestic; // 0x46(0x01)
	char pad_47[0x1]; // 0x47(0x01)
};

// ScriptStruct Solarland.ColorPreset
// Size: 0x2c (Inherited: 0x00)
struct FColorPreset {
	int32_t ColorID; // 0x00(0x04)
	struct FColorValue ModelColor; // 0x04(0x10)
	struct FColorValue UIColor; // 0x14(0x10)
	int32_t ColorNameLocalText; // 0x24(0x04)
	bool bNotShowDomestic; // 0x28(0x01)
	bool bDefault; // 0x29(0x01)
	bool bDefaultDomestic; // 0x2a(0x01)
	char pad_2B[0x1]; // 0x2b(0x01)
};

// ScriptStruct Solarland.PickupUserSettings
// Size: 0x18 (Inherited: 0x00)
struct FPickupUserSettings {
	bool bAutoPickup; // 0x00(0x01)
	bool bStopAutoPickupWhenClose; // 0x01(0x01)
	bool bUseTileView; // 0x02(0x01)
	char pad_3[0x5]; // 0x03(0x05)
	struct TArray<struct FPickupItemData> PickupItemList; // 0x08(0x10)
};

// ScriptStruct Solarland.PickupItemData
// Size: 0x08 (Inherited: 0x00)
struct FPickupItemData {
	int32_t ItemID; // 0x00(0x04)
	int32_t ItemNum; // 0x04(0x04)
};

// ScriptStruct Solarland.SensitivityUserSettings
// Size: 0x94 (Inherited: 0x00)
struct FSensitivityUserSettings {
	enum class ESolarTouchAccMode Sensitivity_AccMode; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FFloatValue Sensitivity_CurveScale; // 0x04(0x04)
	struct FFloatValue Sensitivity_Free; // 0x08(0x04)
	struct FFloatValue Sensitivity_SecondarySkills; // 0x0c(0x04)
	struct FFloatValue Sensitivity_SuperSkills; // 0x10(0x04)
	struct FCameraSensitivityData Sensitivity_NoShoot; // 0x14(0x20)
	struct FCameraSensitivityData Sensitivity_Shoot; // 0x34(0x20)
	struct FGyroscopeSensitivityData GyroscopeData; // 0x54(0x20)
	struct FFloatValue Sensitivity_VehicleDriver; // 0x74(0x04)
	struct FFloatValue Sensitivity_VehicleFire; // 0x78(0x04)
	struct FVehicleCameraSensitivityData Sensitivity_Vehicle_NoShoot; // 0x7c(0x0c)
	struct FVehicleCameraSensitivityData Sensitivity_Vehicle_Shoot; // 0x88(0x0c)
};

// ScriptStruct Solarland.VehicleCameraSensitivityData
// Size: 0x0c (Inherited: 0x00)
struct FVehicleCameraSensitivityData {
	struct FFloatValue Sensitivity_Lens_Two; // 0x00(0x04)
	struct FFloatValue Sensitivity_Lens_Four; // 0x04(0x04)
	struct FFloatValue Sensitivity_Lens_Eight; // 0x08(0x04)
};

// ScriptStruct Solarland.GyroscopeSensitivityData
// Size: 0x20 (Inherited: 0x00)
struct FGyroscopeSensitivityData {
	struct FFloatValue GyroscopeSensitivity_Basic; // 0x00(0x04)
	struct FFloatValue GyroscopeSensitivity_Shoulder; // 0x04(0x04)
	struct FFloatValue GyroscopeSensitivity_RedPoint; // 0x08(0x04)
	struct FFloatValue GyroscopeSensitivity_Lens_Two; // 0x0c(0x04)
	struct FFloatValue GyroscopeSensitivity_Lens_Three; // 0x10(0x04)
	struct FFloatValue GyroscopeSensitivity_Lens_Four; // 0x14(0x04)
	struct FFloatValue GyroscopeSensitivity_Lens_Six; // 0x18(0x04)
	struct FFloatValue GyroscopeSensitivity_Lens_Eight; // 0x1c(0x04)
};

// ScriptStruct Solarland.CameraSensitivityData
// Size: 0x20 (Inherited: 0x00)
struct FCameraSensitivityData {
	struct FFloatValue Sensitivity_Basic; // 0x00(0x04)
	struct FFloatValue Sensitivity_Shoulder; // 0x04(0x04)
	struct FFloatValue Sensitivity_RedPoint; // 0x08(0x04)
	struct FFloatValue Sensitivity_Lens_Two; // 0x0c(0x04)
	struct FFloatValue Sensitivity_Lens_Three; // 0x10(0x04)
	struct FFloatValue Sensitivity_Lens_Four; // 0x14(0x04)
	struct FFloatValue Sensitivity_Lens_Six; // 0x18(0x04)
	struct FFloatValue Sensitivity_Lens_Eight; // 0x1c(0x04)
};

// ScriptStruct Solarland.ShakeUserSettings
// Size: 0x01 (Inherited: 0x00)
struct FShakeUserSettings {
	enum class ESolarShakeMainType ShakeMainStatus; // 0x00(0x01)
};

// ScriptStruct Solarland.SoundUserSettings
// Size: 0x60 (Inherited: 0x00)
struct FSoundUserSettings {
	struct FConditionValue Sound_Global; // 0x00(0x08)
	struct FConditionValue Sound_Action; // 0x08(0x08)
	struct FConditionValue Sound_BackGround; // 0x10(0x08)
	struct FConditionValue Sound_Character; // 0x18(0x08)
	int32_t MicroPhoneVolume; // 0x20(0x04)
	int32_t LoudSpeakerVolume; // 0x24(0x04)
	enum class ESolarSoundQuality Sound_Quality; // 0x28(0x01)
	enum class ESolarAudioMode AudioMode; // 0x29(0x01)
	char pad_2A[0x2]; // 0x2a(0x02)
	int32_t MicLevel; // 0x2c(0x04)
	int32_t SpeakerLevel; // 0x30(0x04)
	int32_t ChooseMicIndex; // 0x34(0x04)
	int32_t ChooseSpeakerIndex; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FString MicDeviceID; // 0x40(0x10)
	struct FString SpeakerDeviceID; // 0x50(0x10)
};

// ScriptStruct Solarland.ConditionValue
// Size: 0x08 (Inherited: 0x00)
struct FConditionValue {
	bool bOpen; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t CurValue; // 0x04(0x04)
};

// ScriptStruct Solarland.WeaponUserSettings
// Size: 0x20 (Inherited: 0x00)
struct FWeaponUserSettings {
	bool bAimAssist_Global; // 0x00(0x01)
	bool bAutoFire_Global; // 0x01(0x01)
	bool bVehicleWeaponAutoFire_Global; // 0x02(0x01)
	bool bEnableRecoilRecovery_Global; // 0x03(0x01)
	bool bAutoScope_Global; // 0x04(0x01)
	bool bAutoScope_SpecialButtonGlobal; // 0x05(0x01)
	bool bAutoScopeRifle_Global; // 0x06(0x01)
	bool bAutoScopeSubmachinegun_Global; // 0x07(0x01)
	bool bAutoScopeShotgunSingle_Global; // 0x08(0x01)
	bool bAutoScopeShotgunAuto_Global; // 0x09(0x01)
	bool bAutoScopeSniperSingle_Global; // 0x0a(0x01)
	bool bAutoScopeSniperAuto_Global; // 0x0b(0x01)
	bool bAutoScopeSpecial_Global; // 0x0c(0x01)
	bool bSniperSingleShootOnPressed_Global; // 0x0d(0x01)
	bool bShotgunSingleShootOnPressed_Global; // 0x0e(0x01)
	char pad_F[0x1]; // 0x0f(0x01)
	struct UCurveFloat* HitEffectDistanceToScaleCurve; // 0x10(0x08)
	enum class ESolarWeaponDoScopeMode DoScopeMode_Global; // 0x18(0x01)
	bool bOpenVehicleWeaponCrosshair; // 0x19(0x01)
	bool bVehicleAutoScope; // 0x1a(0x01)
	bool bVehicleAutoScope_SpecialButton; // 0x1b(0x01)
	bool bCanScopeButtonRotateView; // 0x1c(0x01)
	bool bShowQuickChangeScopeButton; // 0x1d(0x01)
	char pad_1E[0x2]; // 0x1e(0x02)
};

// ScriptStruct Solarland.GraphicsUserSettingsPC
// Size: 0xa8 (Inherited: 0x00)
struct FGraphicsUserSettingsPC {
	enum class ESolarResolution Resolution; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UDataTable* ResolutionDataTable; // 0x08(0x08)
	enum class ESolarMonitor Monitor; // 0x10(0x01)
	enum class ESolarFPS Fps; // 0x11(0x01)
	enum class ESolarGraphicsMode GraphicsMode; // 0x12(0x01)
	char pad_13[0x1]; // 0x13(0x01)
	struct FFloatValue Brightness; // 0x14(0x04)
	enum class ESolarGraphicQuality ROV; // 0x18(0x01)
	enum class ESolarNvdiaReflexLevel NvdiaReflex; // 0x19(0x01)
	enum class ESolarRayTracingLevel RayTracing; // 0x1a(0x01)
	bool VSync; // 0x1b(0x01)
	enum class ESolarMotionBlurLevel MotionBlur; // 0x1c(0x01)
	enum class ESolarAntiAliasingLevel AntiAliasing; // 0x1d(0x01)
	enum class ESolarAnisotropicFilterLevel AnisotropicFiltering; // 0x1e(0x01)
	enum class ESolarGraphicQuality TextureQuality; // 0x1f(0x01)
	enum class ESolarGraphicQuality TextureModel; // 0x20(0x01)
	enum class ESolarGraphicQuality DetailQuality; // 0x21(0x01)
	enum class ESolarGraphicQuality VisualEffects; // 0x22(0x01)
	char pad_23[0x1]; // 0x23(0x01)
	struct FFloatValue SunlightShadowRange; // 0x24(0x04)
	enum class ESolarSunlightShadowDetailLevel SunlightShadowDetails; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct UDataTable* ShadowDetailLevelDataTable; // 0x30(0x08)
	enum class ESolarMaxCSMResolutionLevel MaxCSMResolutionLevel; // 0x38(0x01)
	enum class ESolarPointLightShadowDetailsLevel PointLightShadowDetails; // 0x39(0x01)
	enum class ESolarAmbientOcclusionQualityLevel AmbientOcclusionQuality; // 0x3a(0x01)
	enum class ESolarSSGIQualityLevel SSGIQuality; // 0x3b(0x01)
	enum class ESolarReflectionQualityLevel Reflection; // 0x3c(0x01)
	bool VolumetricLighting; // 0x3d(0x01)
	bool DynamicVolumetricShadows; // 0x3e(0x01)
	enum class ESolarPostProcessingEffectsLevel PostProcessingEffects; // 0x3f(0x01)
	enum class ESolarRenderingResolutionScaleLevel RenderingResolutionScale; // 0x40(0x01)
	enum class ESolarGraphicQuality GrassDensity; // 0x41(0x01)
	enum class ESolarColorBlindMode ColorBlindMode; // 0x42(0x01)
	char pad_43[0x1]; // 0x43(0x01)
	float ScreenPercentageScale; // 0x44(0x04)
	char pad_48[0x60]; // 0x48(0x60)
};

// ScriptStruct Solarland.GamepadAdvancedSettings
// Size: 0x3c (Inherited: 0x00)
struct FGamepadAdvancedSettings {
	struct FRangeData ScalerRange; // 0x00(0x08)
	struct FRangeData SpeedUpScalerRange; // 0x08(0x08)
	struct FRangeData SpeedUpDelayRange; // 0x10(0x08)
	struct FRangeData SpeedUpStartRange; // 0x18(0x08)
	struct FFloatValue ScalerX; // 0x20(0x04)
	struct FFloatValue ScalerY; // 0x24(0x04)
	struct FFloatValue SpeedUpScalerX; // 0x28(0x04)
	struct FFloatValue SpeedUpScalerY; // 0x2c(0x04)
	struct FFloatValue SpeedUpDelayTime; // 0x30(0x04)
	struct FFloatValue SpeedUpStartTime; // 0x34(0x04)
	bool bEnableAdsSpeedUp; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
};

// ScriptStruct Solarland.RangeData
// Size: 0x08 (Inherited: 0x00)
struct FRangeData {
	float MinValue; // 0x00(0x04)
	float MaxValue; // 0x04(0x04)
};

// ScriptStruct Solarland.GamepadSettings
// Size: 0xe0 (Inherited: 0x00)
struct FGamepadSettings {
	struct TArray<struct FSolarAimModeWithLocalText> AimModeMap; // 0x00(0x10)
	struct TArray<struct FSolarSprintModeWithLocalText> SprintModeMap; // 0x10(0x10)
	struct TArray<struct FFloatWithLocalText> ViewSensitivityMap; // 0x20(0x10)
	struct TArray<struct FObjectWithLocalText> ResponseCurveMap; // 0x30(0x10)
	struct TArray<struct FFloatWithLocalText> LeftStickDeadzoneMap; // 0x40(0x10)
	struct TArray<struct FFloatWithLocalText> RightStickDeadzoneMap; // 0x50(0x10)
	struct TArray<struct FFloatWithLocalText> TriggerDeadzoneMap; // 0x60(0x10)
	struct TArray<struct FFloatWithLocalText> VibrationLevelMap; // 0x70(0x10)
	struct FRangeData CursorSpeedRange; // 0x80(0x08)
	struct TArray<struct FSolarWheelModeTypeWithLocalText> WheelModeTypeMap; // 0x88(0x10)
	int32_t AimModeID; // 0x98(0x04)
	int32_t SprintModeID; // 0x9c(0x04)
	struct FConditionValue MainHorizontalSensitivity; // 0xa0(0x08)
	struct FConditionValue MainVerticalSensitivity; // 0xa8(0x08)
	int32_t RightStickSensitivityID; // 0xb0(0x04)
	int32_t RightStickResponseCurveID; // 0xb4(0x04)
	bool bInvertedLook; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32_t LeftStickDeadzoneID; // 0xbc(0x04)
	int32_t RightStickDeadzoneID; // 0xc0(0x04)
	int32_t TriggerDeadzoneID; // 0xc4(0x04)
	struct FFloatValue CursorSpeed; // 0xc8(0x04)
	int32_t VibrationLevelID; // 0xcc(0x04)
	bool bEnableAimAssist; // 0xd0(0x01)
	bool bEnableClassicWheeledVehicleControlMode; // 0xd1(0x01)
	char pad_D2[0x2]; // 0xd2(0x02)
	int32_t MedicWheelModeID; // 0xd4(0x04)
	int32_t EmojiWheelModeID; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
};

// ScriptStruct Solarland.SolarWheelModeTypeWithLocalText
// Size: 0x08 (Inherited: 0x00)
struct FSolarWheelModeTypeWithLocalText {
	int32_t LocalText; // 0x00(0x04)
	enum class ESolarWheelModeType WheelPadMode; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct Solarland.FloatWithLocalText
// Size: 0x08 (Inherited: 0x00)
struct FFloatWithLocalText {
	int32_t LocalText; // 0x00(0x04)
	float Value; // 0x04(0x04)
};

// ScriptStruct Solarland.ObjectWithLocalText
// Size: 0x20 (Inherited: 0x00)
struct FObjectWithLocalText {
	int32_t LocalText; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FSoftObjectPath ObjectPath; // 0x08(0x18)
};

// ScriptStruct Solarland.SolarSprintModeWithLocalText
// Size: 0x08 (Inherited: 0x00)
struct FSolarSprintModeWithLocalText {
	int32_t LocalText; // 0x00(0x04)
	enum class ESolarSprintModeType SprintMode; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct Solarland.SolarAimModeWithLocalText
// Size: 0x08 (Inherited: 0x00)
struct FSolarAimModeWithLocalText {
	int32_t LocalText; // 0x00(0x04)
	enum class ESolarWeaponDoScopeMode AimMode; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct Solarland.MouseAndKeyboardSettings
// Size: 0x0c (Inherited: 0x00)
struct FMouseAndKeyboardSettings {
	struct FFloatValue MainSensitivity; // 0x00(0x04)
	bool bMouseInvert; // 0x04(0x01)
	enum class ESolarWeaponDoScopeMode AimMode; // 0x05(0x01)
	enum class ESolarSprintModeType SprintMode; // 0x06(0x01)
	enum class ESolarWheelModeType MedicWheelMode; // 0x07(0x01)
	enum class ESolarWheelModeType EmojiWheelMode; // 0x08(0x01)
	enum class ESolarITemHUDStyle CurrentItemHUDStyle; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
};

// ScriptStruct Solarland.DownloadFileInfo
// Size: 0x30 (Inherited: 0x00)
struct FDownloadFileInfo {
	struct FString URL; // 0x00(0x10)
	struct FString Filename; // 0x10(0x10)
	struct FString HashStr; // 0x20(0x10)
};

// ScriptStruct Solarland.LocalFileInfo
// Size: 0x20 (Inherited: 0x00)
struct FLocalFileInfo {
	struct FString Dir; // 0x00(0x10)
	struct FString Filename; // 0x10(0x10)
};

// ScriptStruct Solarland.ScreenEffectGroup
// Size: 0x60 (Inherited: 0x00)
struct FScreenEffectGroup {
	struct TMap<int32_t, struct FScreenEffectInstance> InstantScreenEffects; // 0x00(0x50)
	struct TArray<struct FScreenEffectInstance> DurationScreenEffects; // 0x50(0x10)
};

// ScriptStruct Solarland.ScreenEffectInstance
// Size: 0x98 (Inherited: 0x00)
struct FScreenEffectInstance {
	char pad_0[0x98]; // 0x00(0x98)
};

// ScriptStruct Solarland.BuffEffectActorElemPool
// Size: 0x10 (Inherited: 0x00)
struct FBuffEffectActorElemPool {
	struct TArray<struct UBuffEffectActorElem*> PoolInstances; // 0x00(0x10)
};

// ScriptStruct Solarland.BuffParticleEffectInstance
// Size: 0x30 (Inherited: 0x00)
struct FBuffParticleEffectInstance {
	char pad_0[0x20]; // 0x00(0x20)
	struct TArray<struct UBuffEffectActorElem*> AttachElemList; // 0x20(0x10)
};

// ScriptStruct Solarland.BuffParticleEffectGroup
// Size: 0xb0 (Inherited: 0x00)
struct FBuffParticleEffectGroup {
	char pad_0[0x8]; // 0x00(0x08)
	struct TMap<struct FName, struct FBuffEffectActorElemList> InstantActorListMap; // 0x08(0x50)
	char pad_58[0x8]; // 0x58(0x08)
	struct TMap<struct FName, struct FBuffEffectActorElemList> DurationActorListMap; // 0x60(0x50)
};

// ScriptStruct Solarland.BuffEffectActorElemList
// Size: 0x10 (Inherited: 0x00)
struct FBuffEffectActorElemList {
	struct TArray<struct UBuffEffectActorElem*> ElemList; // 0x00(0x10)
};

// ScriptStruct Solarland.InputKeyMappingEntry
// Size: 0x40 (Inherited: 0x00)
struct FInputKeyMappingEntry {
	bool bValid; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString ActionID; // 0x08(0x10)
	struct FString ActionName; // 0x18(0x10)
	enum class ESolarTablesEnum_InputActionType ActionType; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float Scale; // 0x2c(0x04)
	struct TArray<struct FInputKeyMappingPair> KeyMappingPairList; // 0x30(0x10)
};

// ScriptStruct Solarland.InputKeyMappingPair
// Size: 0x28 (Inherited: 0x00)
struct FInputKeyMappingPair {
	struct FString KeyStr1; // 0x00(0x10)
	struct FString KeyStr2; // 0x10(0x10)
	enum class ESolarTablesEnum_InputTriggerType TriggerType; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
};

// ScriptStruct Solarland.InputDeviceProxy
// Size: 0x0c (Inherited: 0x00)
struct FInputDeviceProxy {
	enum class ECommonInputType InputType; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FName GamepadType; // 0x04(0x08)
};

// ScriptStruct Solarland.ItemCountsList
// Size: 0x50 (Inherited: 0x00)
struct FItemCountsList {
	struct TMap<enum class EPickupItemType, int32_t> Type2IntMap; // 0x00(0x50)
};

// ScriptStruct Solarland.InteractionTriggerInfo
// Size: 0x38 (Inherited: 0x00)
struct FInteractionTriggerInfo {
	struct FGameplayTag GameplayTag; // 0x00(0x08)
	char pad_8[0x30]; // 0x08(0x30)
};

// ScriptStruct Solarland.HUDNoticeParams
// Size: 0x50 (Inherited: 0x00)
struct FHUDNoticeParams {
	struct TMap<struct FString, struct FString> Params; // 0x00(0x50)
};

// ScriptStruct Solarland.CountDownInfo
// Size: 0x48 (Inherited: 0x00)
struct FCountDownInfo {
	int32_t TextID; // 0x00(0x04)
	float Time; // 0x04(0x04)
	float RemainingTime; // 0x08(0x04)
	bool bShowBtn; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	int32_t PassiveTextID; // 0x10(0x04)
	struct FGameplayTag GameplayTag; // 0x14(0x08)
	char pad_1C[0x24]; // 0x1c(0x24)
	int32_t ContributorCharacterId; // 0x40(0x04)
	enum class ECountDownState State; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// ScriptStruct Solarland.KillInfo
// Size: 0x98 (Inherited: 0x00)
struct FKillInfo {
	struct FString KillerPlayerId; // 0x00(0x10)
	int32_t KillerSkinID; // 0x10(0x04)
	int32_t KillerTeamID; // 0x14(0x04)
	struct FString KillerName; // 0x18(0x10)
	int32_t KillerFlag; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FString VictimPlayerID; // 0x30(0x10)
	int32_t VictimSkinID; // 0x40(0x04)
	int32_t VictimTeamID; // 0x44(0x04)
	struct FString VictimName; // 0x48(0x10)
	int32_t VictimFlag; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct FString KillIcon; // 0x60(0x10)
	struct FString KillLeaderID; // 0x70(0x10)
	enum class EKillParamsCompressInfo KillParamsCompressInfo; // 0x80(0x02)
	char pad_82[0x2]; // 0x82(0x02)
	int32_t KillNum; // 0x84(0x04)
	int32_t WeaponSkinID; // 0x88(0x04)
	char KillerVipType; // 0x8c(0x01)
	char VictimVipType; // 0x8d(0x01)
	enum class ECommonInputType KillerInputType; // 0x8e(0x01)
	enum class ECommonInputType VictimInputType; // 0x8f(0x01)
	bool bDown; // 0x90(0x01)
	bool bPlayComboKillSoundEffect; // 0x91(0x01)
	char pad_92[0x2]; // 0x92(0x02)
	int32_t KillReportID; // 0x94(0x04)
};

// ScriptStruct Solarland.PlayAnimationParams
// Size: 0x40 (Inherited: 0x00)
struct FPlayAnimationParams {
	char pad_0[0x40]; // 0x00(0x40)
};

// ScriptStruct Solarland.BattleUpgradeEffectCategoryColorSet
// Size: 0x60 (Inherited: 0x00)
struct FBattleUpgradeEffectCategoryColorSet {
	struct FLinearColor BannerCategoryTextColor; // 0x00(0x10)
	struct FLinearColor BannerIconColor; // 0x10(0x10)
	struct FLinearColor BannerBorderColor; // 0x20(0x10)
	struct FLinearColor BannerBackgroundColor; // 0x30(0x10)
	struct FLinearColor BadgeIconColor; // 0x40(0x10)
	struct FLinearColor BadgeBackgroundColor; // 0x50(0x10)
};

// ScriptStruct Solarland.ElectricShopItem
// Size: 0x18 (Inherited: 0x00)
struct FElectricShopItem {
	int32_t ItemID; // 0x00(0x04)
	float Prize; // 0x04(0x04)
	int32_t Num; // 0x08(0x04)
	int32_t ProductID; // 0x0c(0x04)
	float CoolDown; // 0x10(0x04)
	int32_t Generation; // 0x14(0x04)
};

// ScriptStruct Solarland.ActionWheelConfig
// Size: 0xe0 (Inherited: 0x08)
struct FActionWheelConfig : FTableRowBase {
	int32_t groupid; // 0x08(0x04)
	struct FWrappedLocalTextID Title; // 0x0c(0x04)
	int32_t StyleID; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct FString WheelDes; // 0x18(0x10)
	float DisplayDelay; // 0x28(0x04)
	float DisplayDelay_Gamepad; // 0x2c(0x04)
	float PointMoveSensitivity; // 0x30(0x04)
	float PointMoveSensitivity_Gamepad; // 0x34(0x04)
	struct FVector2D Offset; // 0x38(0x08)
	struct UActionWheelWidgetFunctionBase* WheelFunctionBP; // 0x40(0x08)
	struct FString InputActionName; // 0x48(0x10)
	enum class EActionWheelOperateType OperateType; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	struct FActionWheelStyle ActionWheelStyle; // 0x5c(0x70)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct TArray<struct FActionWheelCommand> ActionWheelCommands; // 0xd0(0x10)
};

// ScriptStruct Solarland.ActionWheelCommand
// Size: 0x38 (Inherited: 0x00)
struct FActionWheelCommand {
	enum class EActionWheelCommandType CommandType; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct FString ConfigKey; // 0x08(0x10)
	struct FWrappedLocalTextID DisplayName; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct FSoftObjectPath Icon; // 0x20(0x18)
};

// ScriptStruct Solarland.WrappedLocalTextID
// Size: 0x04 (Inherited: 0x00)
struct FWrappedLocalTextID {
	int32_t LocalTextId; // 0x00(0x04)
};

// ScriptStruct Solarland.ActionWheelStyle
// Size: 0x70 (Inherited: 0x00)
struct FActionWheelStyle {
	struct FLinearColor BlackgroundColor; // 0x00(0x10)
	struct FLinearColor InnerCircleColor; // 0x10(0x10)
	struct FLinearColor BlackgroundSelectedColor; // 0x20(0x10)
	struct FLinearColor InnerCircleSelectedColor; // 0x30(0x10)
	struct FLinearColor WheelGradientColor; // 0x40(0x10)
	struct FLinearColor WheelSelectedGradientColor; // 0x50(0x10)
	struct FVector2D IconSize; // 0x60(0x08)
	float IconOffset; // 0x68(0x04)
	float SelectedIconOffset; // 0x6c(0x04)
};

// ScriptStruct Solarland.ActorEffectControllerPool
// Size: 0x10 (Inherited: 0x00)
struct FActorEffectControllerPool {
	struct TArray<struct UActorEffectController*> ControllerInstances; // 0x00(0x10)
};

// ScriptStruct Solarland.ActorEffectPool
// Size: 0x10 (Inherited: 0x00)
struct FActorEffectPool {
	struct TArray<struct UActorEffect*> EffectInstances; // 0x00(0x10)
};

// ScriptStruct Solarland.MaterialFilter
// Size: 0x48 (Inherited: 0x00)
struct FMaterialFilter {
	bool bIgnoreChangeability; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<struct UMeshComponent*> IncludingMeshes; // 0x08(0x10)
	struct TArray<int32_t> IncludingMaterialIndices; // 0x18(0x10)
	struct TArray<struct UMeshComponent*> ExcludingMeshes; // 0x28(0x10)
	struct TArray<int32_t> ExcludingMaterialIndices; // 0x38(0x10)
};

// ScriptStruct Solarland.MaterialChangeHandle
// Size: 0x08 (Inherited: 0x00)
struct FMaterialChangeHandle {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct Solarland.MultiplePassMaterialChange
// Size: 0x68 (Inherited: 0x00)
struct FMultiplePassMaterialChange {
	struct TSoftObjectPtr<UMaterialInterface> SourceMaterial; // 0x00(0x28)
	struct FAddMultiplePassMaterialChangeParams Params; // 0x28(0x40)
};

// ScriptStruct Solarland.NormalMaterialChange
// Size: 0x50 (Inherited: 0x00)
struct FNormalMaterialChange {
	struct TSoftObjectPtr<UMaterialInterface> SourceMaterial; // 0x00(0x28)
	struct FAddMaterialChangeParams Params; // 0x28(0x28)
};

// ScriptStruct Solarland.AddMaterialChangeParams
// Size: 0x28 (Inherited: 0x00)
struct FAddMaterialChangeParams {
	char pad_0[0x8]; // 0x00(0x08)
	struct FGameplayTag PriorityTag; // 0x08(0x08)
	enum class EMaterialChangeConflictResolveStrategy ResolveStrategy; // 0x10(0x01)
	enum class EMaterialChangeTextureOverrideMode TextureOverrideMode; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
	struct TArray<struct FName> TextureParameterNamesToOverride; // 0x18(0x10)
};

// ScriptStruct Solarland.MaterialChangePriorityGroup
// Size: 0x10 (Inherited: 0x00)
struct FMaterialChangePriorityGroup {
	struct TArray<struct FGameplayTag> Tags; // 0x00(0x10)
};

// ScriptStruct Solarland.ForceChangeMaterialInfos
// Size: 0x70 (Inherited: 0x00)
struct FForceChangeMaterialInfos {
	struct FGameplayTagContainer MaterialPriorityTags; // 0x00(0x20)
	struct TSet<struct FSoftObjectPath> MaterialPaths; // 0x20(0x50)
};

// ScriptStruct Solarland.MaterialParameterFilter
// Size: 0x20 (Inherited: 0x00)
struct FMaterialParameterFilter {
	struct TArray<struct FName> IncludingNames; // 0x00(0x10)
	struct TArray<struct FName> ExcludingNames; // 0x10(0x10)
};

// ScriptStruct Solarland.ActorMaterialInfo
// Size: 0x170 (Inherited: 0x00)
struct FActorMaterialInfo {
	char pad_0[0x20]; // 0x00(0x20)
	struct TMap<struct FMaterialChangeHandle, struct UMaterialInterface*> SourceMaterials; // 0x20(0x50)
	struct TMap<struct FMaterialChangeHandle, struct FAddMaterialChangeParams> NormalParams; // 0x70(0x50)
	struct TMap<struct FMaterialChangeHandle, struct FAddMultiplePassMaterialChangeParams> MultiplePassParams; // 0xc0(0x50)
	struct TMap<struct FMaterialChangeHandle, struct FLimitedMeshContainer> LimitedMeshes; // 0x110(0x50)
	struct TArray<struct FMeshMaterialInfo> MeshMaterials; // 0x160(0x10)
};

// ScriptStruct Solarland.MeshMaterialInfo
// Size: 0x50 (Inherited: 0x00)
struct FMeshMaterialInfo {
	char pad_0[0x18]; // 0x00(0x18)
	struct TArray<struct FMaterialChange> NormalMaterialChanges; // 0x18(0x10)
	char pad_28[0x18]; // 0x28(0x18)
	struct TArray<struct FMaterialChange> MultiplePassMaterialChanges; // 0x40(0x10)
};

// ScriptStruct Solarland.MaterialChange
// Size: 0x38 (Inherited: 0x00)
struct FMaterialChange {
	char pad_0[0x28]; // 0x00(0x28)
	struct TArray<struct UMaterialInterface*> Materials; // 0x28(0x10)
};

// ScriptStruct Solarland.LimitedMeshContainer
// Size: 0x10 (Inherited: 0x00)
struct FLimitedMeshContainer {
	struct TArray<struct UMeshComponent*> Meshes; // 0x00(0x10)
};

// ScriptStruct Solarland.ActorParticleEffectSpawnHandle
// Size: 0x08 (Inherited: 0x00)
struct FActorParticleEffectSpawnHandle {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct Solarland.ActorParticleEffectSpawnInfo
// Size: 0x70 (Inherited: 0x00)
struct FActorParticleEffectSpawnInfo {
	struct TSoftObjectPtr<UParticleSystem> ParticleSystem; // 0x00(0x28)
	enum class EActorParticleEffectAttachOption AttachOption; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	struct FName AttachPointName; // 0x2c(0x08)
	enum class EAttachLocation LocationType; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	struct FVector Location; // 0x38(0x0c)
	struct FRotator Rotation; // 0x44(0x0c)
	struct FVector Scale; // 0x50(0x0c)
	bool bAutoActivate; // 0x5c(0x01)
	bool bAutoDestroy; // 0x5d(0x01)
	bool bEnablePooling; // 0x5e(0x01)
	bool bAbsoluteRotation; // 0x5f(0x01)
	struct TArray<struct FName> ComponentTags; // 0x60(0x10)
};

// ScriptStruct Solarland.WrappedLevelToIdMap
// Size: 0x50 (Inherited: 0x00)
struct FWrappedLevelToIdMap {
	struct TMap<int32_t, int32_t> LevelToId; // 0x00(0x50)
};

// ScriptStruct Solarland.AirDropAllOutcomeConfigArray
// Size: 0x10 (Inherited: 0x00)
struct FAirDropAllOutcomeConfigArray {
	struct TArray<struct FAirDropAllOutcomeConfig> OutcomesOverTime; // 0x00(0x10)
};

// ScriptStruct Solarland.AirDropAllOutcomeConfig
// Size: 0x68 (Inherited: 0x00)
struct FAirDropAllOutcomeConfig {
	float GameSeconds; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FAirDropShieldOutcomeConfig ShieldOutcome; // 0x08(0x18)
	struct FAirDropWeaponPartOutcomeConfig WeaponPartOutcome; // 0x20(0x20)
	struct FAirDropSupplyOutcomeConfig SupplyOutcome; // 0x40(0x18)
	struct TArray<struct FWrappedIdCount> GeneralOutcome; // 0x58(0x10)
};

// ScriptStruct Solarland.WrappedIdCount
// Size: 0x08 (Inherited: 0x00)
struct FWrappedIdCount {
	int32_t ID; // 0x00(0x04)
	int32_t count; // 0x04(0x04)
};

// ScriptStruct Solarland.AirDropSupplyOutcomeConfig
// Size: 0x18 (Inherited: 0x00)
struct FAirDropSupplyOutcomeConfig {
	int32_t count; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FWrappedIdCount> CompensationItems; // 0x08(0x10)
};

// ScriptStruct Solarland.AirDropWeaponPartOutcomeConfig
// Size: 0x20 (Inherited: 0x00)
struct FAirDropWeaponPartOutcomeConfig {
	int32_t count; // 0x00(0x04)
	int32_t MinLevel; // 0x04(0x04)
	int32_t ScopeMinLevel; // 0x08(0x04)
	int32_t MaxLevel; // 0x0c(0x04)
	struct TArray<struct FWrappedIdCount> CompensationOutcomes; // 0x10(0x10)
};

// ScriptStruct Solarland.AirDropShieldOutcomeConfig
// Size: 0x18 (Inherited: 0x00)
struct FAirDropShieldOutcomeConfig {
	int32_t MinLevel; // 0x00(0x04)
	int32_t MaxLevel; // 0x04(0x04)
	struct TArray<struct FWrappedIdCount> CompensationOutcomes; // 0x08(0x10)
};

// ScriptStruct Solarland.AirDropSkillDatas
// Size: 0x10 (Inherited: 0x00)
struct FAirDropSkillDatas {
	struct TArray<struct FAirDropSkillData> OutcomeSetting; // 0x00(0x10)
};

// ScriptStruct Solarland.AirDropSkillData
// Size: 0x08 (Inherited: 0x00)
struct FAirDropSkillData {
	float GameSeconds; // 0x00(0x04)
	int32_t OutcomeID; // 0x04(0x04)
};

// ScriptStruct Solarland.MapAirlineData
// Size: 0x20 (Inherited: 0x00)
struct FMapAirlineData {
	int32_t MapID; // 0x00(0x04)
	float Height; // 0x04(0x04)
	float Speed; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<struct FAirlineData> AirlineDataList; // 0x10(0x10)
};

// ScriptStruct Solarland.AirlineData
// Size: 0x28 (Inherited: 0x00)
struct FAirlineData {
	float AirlineHeight; // 0x00(0x04)
	float AirlineSpeed; // 0x04(0x04)
	struct FVector2D StartPoint; // 0x08(0x08)
	struct FVector2D EndPoint; // 0x10(0x08)
	struct FVector2D RealStartPoint; // 0x18(0x08)
	struct FVector2D RealEndPoint; // 0x20(0x08)
};

// ScriptStruct Solarland.FireChargeData
// Size: 0xc0 (Inherited: 0x00)
struct FFireChargeData {
	bool IfContinuousCharge; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float ChargeTime; // 0x04(0x04)
	struct UCurveFloat* ChargeDamageRadiusCurve; // 0x08(0x08)
	struct UCurveFloat* ChargeDamageMagnificationCurve; // 0x10(0x08)
	bool IfPenetrable; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct UAmmoConfig* OverrideAmmo; // 0x20(0x08)
	int32_t OverrideAmmoID; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FString ChargeSoundName; // 0x30(0x10)
	struct FString ChargeSoundEnemyName; // 0x40(0x10)
	struct FString FireSoundName; // 0x50(0x10)
	struct FString FireSoundEnemyName; // 0x60(0x10)
	bool IfBurst; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
	struct UCurveFloat* BulletBurstCountCurve; // 0x78(0x08)
	bool IfCostToChargeScale; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	int32_t FireCostFullShot; // 0x84(0x04)
	bool IfForceFullShotCost; // 0x88(0x01)
	bool bNeedPlayCameraShake; // 0x89(0x01)
	char pad_8A[0x6]; // 0x8a(0x06)
	struct UCurveFloat* AmmoSpeedScaleCurve; // 0x90(0x08)
	struct UCurveFloat* AmmoEffectXScaleCurve; // 0x98(0x08)
	struct UCurveFloat* AmmoEffectYZScaleCurve; // 0xa0(0x08)
	struct UCurveFloat* OverloadCurve; // 0xa8(0x08)
	float ChargeAnimationRate; // 0xb0(0x04)
	char pad_B4[0x4]; // 0xb4(0x04)
	struct UCurveFloat* DeflectionAngleCurve; // 0xb8(0x08)
};

// ScriptStruct Solarland.TracerBulletData
// Size: 0x40 (Inherited: 0x00)
struct FTracerBulletData {
	float DeflectionAnglePerSec; // 0x00(0x04)
	float MaximumDetectionAngle; // 0x04(0x04)
	float HomingRange; // 0x08(0x04)
	bool bTraceTargetOnly; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FString TracingTargetWarningSound; // 0x10(0x10)
	struct FString TracingTargetWarningRTPC; // 0x20(0x10)
	struct FString TracingAuthorPromptSound; // 0x30(0x10)
};

// ScriptStruct Solarland.AmmonRecoilScope
// Size: 0xb8 (Inherited: 0x00)
struct FAmmonRecoilScope {
	bool EnableScopeVibration; // 0x00(0x01)
	bool EnableCrossHairVibration; // 0x01(0x01)
	bool EnableScopeRoll; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	float ScopeVMaxDistanceOffSet; // 0x04(0x04)
	float ScopeVVibrationDuration; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UCurveFloat* ScopeVSingleOffSetCurve; // 0x10(0x08)
	struct UCurveFloat* ScopeVContinuousOffSetCurve; // 0x18(0x08)
	float ScopeVContinuousFallingDuration; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct UCurveFloat* ScopeVContinuousFallingCurve; // 0x28(0x08)
	int32_t ScopeVContinuousFallingPointIndex; // 0x30(0x04)
	float ScopeHMaxDistanceOffSet; // 0x34(0x04)
	float ScopeHVibrationDuration; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UCurveFloat* ScopeHSingleOffSetCurve; // 0x40(0x08)
	struct UCurveFloat* ScopeHContinuousOffSetCurve; // 0x48(0x08)
	struct UCurveFloat* ScopeHOffSetProbabilityCurve; // 0x50(0x08)
	struct FAmmonRecoilCrossHair CrossHairScaleSettings; // 0x58(0x24)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct FAmmonRecoilScopeRoll ScopeRollSettings; // 0x80(0x38)
};

// ScriptStruct Solarland.AmmonRecoilStruct
// Size: 0x28 (Inherited: 0x00)
struct FAmmonRecoilStruct {
	float CostTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UCurveFloat* RecoilRangeCurve; // 0x08(0x08)
	int32_t APointCurveKeyIndex; // 0x10(0x04)
	float APointMin; // 0x14(0x04)
	float APointMax; // 0x18(0x04)
	int32_t BPointCurveKeyIndex; // 0x1c(0x04)
	float BPointMin; // 0x20(0x04)
	float BPointMax; // 0x24(0x04)
};

// ScriptStruct Solarland.AmmonRecoilScopeRoll
// Size: 0x38 (Inherited: 0x28)
struct FAmmonRecoilScopeRoll : FAmmonRecoilStruct {
	struct UCurveFloat* RollProbabilityCurve; // 0x28(0x08)
	struct UCurveFloat* ContinuousFireWeightCurve; // 0x30(0x08)
};

// ScriptStruct Solarland.AmmonRecoilCrossHair
// Size: 0x24 (Inherited: 0x00)
struct FAmmonRecoilCrossHair {
	float VMaxDistanceOffSetScale; // 0x00(0x04)
	float VVibrationDurationScale; // 0x04(0x04)
	float VSingleOffSetScale; // 0x08(0x04)
	float VContinuousOffSetScale; // 0x0c(0x04)
	float HMaxDistanceOffSetScale; // 0x10(0x04)
	float HVibrationDurationScale; // 0x14(0x04)
	float HSingleOffSetScale; // 0x18(0x04)
	float HContinuousOffSetScale; // 0x1c(0x04)
	float HOffSetProbabilityScale; // 0x20(0x04)
};

// ScriptStruct Solarland.AmmonRecoilRollStruct
// Size: 0x40 (Inherited: 0x28)
struct FAmmonRecoilRollStruct : FAmmonRecoilStruct {
	struct UCurveFloat* RollProbabilityCurve; // 0x28(0x08)
	float ADSRollCOP; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
	struct UCurveFloat* ContinuousFireWeightCurve; // 0x38(0x08)
};

// ScriptStruct Solarland.AmmonVerticalRecoilStruct
// Size: 0x30 (Inherited: 0x28)
struct FAmmonVerticalRecoilStruct : FAmmonRecoilStruct {
	struct UCurveFloat* ContinuousFireWeightCurve; // 0x28(0x08)
};

// ScriptStruct Solarland.AmmonHorizontalRecoilStruct
// Size: 0x30 (Inherited: 0x28)
struct FAmmonHorizontalRecoilStruct : FAmmonRecoilStruct {
	struct UCurveVector* ContinuousFireInfoCurve; // 0x28(0x08)
};

// ScriptStruct Solarland.FootEffect
// Size: 0x40 (Inherited: 0x00)
struct FFootEffect {
	enum class EFootEffectType Type; // 0x00(0x01)
	char pad_1[0x7]; // 0x01(0x07)
	struct UParticleSystem* PSTemplate; // 0x08(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x10(0x28)
	struct FName SocketName; // 0x38(0x08)
};

// ScriptStruct Solarland.AttachedMeshInfo
// Size: 0x40 (Inherited: 0x00)
struct FAttachedMeshInfo {
	struct UStaticMesh* MeshResource; // 0x00(0x08)
	struct FName SocketName; // 0x08(0x08)
	struct FTransform TransformOffset; // 0x10(0x30)
};

// ScriptStruct Solarland.AttributeSubSetting
// Size: 0x0c (Inherited: 0x00)
struct FAttributeSubSetting {
	bool bUsingAttributeSub; // 0x00(0x01)
	enum class EAttributeSubBehavior Behavior; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	int32_t AttributeSubID; // 0x04(0x04)
	float Value; // 0x08(0x04)
};

// ScriptStruct Solarland.ControlPointData
// Size: 0x14 (Inherited: 0x00)
struct FControlPointData {
	float OccupiedAddScorePerSec; // 0x00(0x04)
	char MinProgress; // 0x04(0x01)
	char MaxProgress; // 0x05(0x01)
	char pad_6[0x2]; // 0x06(0x02)
	float OccupyingProgressPerSec; // 0x08(0x04)
	float ReOccupyingProgressPerSec; // 0x0c(0x04)
	float RegainTime; // 0x10(0x04)
};

// ScriptStruct Solarland.BattlegroundMapElementData
// Size: 0x0c (Inherited: 0x00)
struct FBattlegroundMapElementData {
	int32_t SubModeID; // 0x00(0x04)
	enum class EBattlegroundMapElementType Type; // 0x04(0x01)
	enum class EFactionType DefaultOwnerFaction; // 0x05(0x01)
	enum class EDeploymentType DeploymentType; // 0x06(0x01)
	enum class EBattlegroundPlayerStartRegion PlayerStartRegion; // 0x07(0x01)
	float EnemyCheckDistance; // 0x08(0x04)
};

// ScriptStruct Solarland.BattlegroundWeaponData
// Size: 0x18 (Inherited: 0x00)
struct FBattlegroundWeaponData {
	int32_t weaponid; // 0x00(0x04)
	struct FWeaponPartsData WeaponPartsData; // 0x04(0x14)
};

// ScriptStruct Solarland.BattlePassLevelInfo
// Size: 0x18 (Inherited: 0x00)
struct FBattlePassLevelInfo {
	char pad_0[0x18]; // 0x00(0x18)
};

// ScriptStruct Solarland.BattlePassLevelItem
// Size: 0x0c (Inherited: 0x00)
struct FBattlePassLevelItem {
	char pad_0[0xc]; // 0x00(0x0c)
};

// ScriptStruct Solarland.PromptElemInfo
// Size: 0x34 (Inherited: 0x00)
struct FPromptElemInfo {
	enum class EBattlePromptType Type; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D ArrowPosition; // 0x04(0x08)
	struct FVector2D IconPosition; // 0x0c(0x08)
	int32_t ArrowColorFactor; // 0x14(0x04)
	int32_t ArrowLengthFactor; // 0x18(0x04)
	int32_t IconFactor; // 0x1c(0x04)
	float TransparencyFactor; // 0x20(0x04)
	float Distance; // 0x24(0x04)
	int32_t Angle; // 0x28(0x04)
	bool bBlocked; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	int32_t UVIdx; // 0x30(0x04)
};

// ScriptStruct Solarland.BattleRoyalTimeLineDTRow
// Size: 0x18 (Inherited: 0x08)
struct FBattleRoyalTimeLineDTRow : FTableRowBase {
	float StartTime; // 0x08(0x04)
	enum class EBattleRoyalTimeLineEnum OperationType; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	int32_t Parameter; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Solarland.BattleUpgradeEffectCategoryConfig
// Size: 0x64 (Inherited: 0x00)
struct FBattleUpgradeEffectCategoryConfig {
	int32_t TitleLocalTextID; // 0x00(0x04)
	struct FBattleUpgradeEffectCategoryColorSet ColorSet; // 0x04(0x60)
};

// ScriptStruct Solarland.BattleUpgradeEffectConfig
// Size: 0x90 (Inherited: 0x08)
struct FBattleUpgradeEffectConfig : FTableRowBase {
	enum class ESolarTablesEnum_BattleUpgradeEffectType Type; // 0x08(0x01)
	enum class EBattleUpgradeEffectCategory Category; // 0x09(0x01)
	char pad_A[0x6]; // 0x0a(0x06)
	struct TSoftClassPtr<UObject> EffectClass; // 0x10(0x28)
	struct TArray<struct FBattleUpgradeEffectConfigParam> Parameters; // 0x38(0x10)
	struct FWrappedLocalTextID DescriptionLocalText; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct TSoftObjectPtr<UTexture2D> Icon; // 0x50(0x28)
	struct FString ShortNumberDisplayFormat; // 0x78(0x10)
	struct FWrappedLocalTextID TitleLocalText; // 0x88(0x04)
	struct FWrappedLocalTextID IntroductionLocalText; // 0x8c(0x04)
};

// ScriptStruct Solarland.BattleUpgradeEffectConfigParam
// Size: 0x0c (Inherited: 0x00)
struct FBattleUpgradeEffectConfigParam {
	struct FGameplayTag GameplayTag; // 0x00(0x08)
	float Scale; // 0x08(0x04)
};

// ScriptStruct Solarland.BlueCircleInfo
// Size: 0x14 (Inherited: 0x00)
struct FBlueCircleInfo {
	struct FVector CenterLocation; // 0x00(0x0c)
	float Radius; // 0x0c(0x04)
	bool bHiddenInLevel; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
};

// ScriptStruct Solarland.BombingZone
// Size: 0x60 (Inherited: 0x00)
struct FBombingZone {
	int32_t instanceID; // 0x00(0x04)
	int32_t ConfigID; // 0x04(0x04)
	float Radius; // 0x08(0x04)
	float Duration; // 0x0c(0x04)
	int32_t MinBomb; // 0x10(0x04)
	int32_t MaxBomb; // 0x14(0x04)
	struct FVector Location; // 0x18(0x0c)
	struct FBombingZoneBomb Bomb; // 0x24(0x1c)
	enum class EBombingZoneState State; // 0x40(0x01)
	char pad_41[0x1f]; // 0x41(0x1f)
};

// ScriptStruct Solarland.BombingZoneBomb
// Size: 0x1c (Inherited: 0x00)
struct FBombingZoneBomb {
	float Radius; // 0x00(0x04)
	float MaxDamage; // 0x04(0x04)
	float MinDamage; // 0x08(0x04)
	float VehicleMaxDamage; // 0x0c(0x04)
	float VehicleMinDamage; // 0x10(0x04)
	float InVehicleDamageScale; // 0x14(0x04)
	float LandingTime; // 0x18(0x04)
};

// ScriptStruct Solarland.ScreenEffectConfig
// Size: 0x78 (Inherited: 0x08)
struct FScreenEffectConfig : FTableRowBase {
	struct FString EffectType; // 0x08(0x10)
	struct FString EffectName; // 0x18(0x10)
	struct FString State; // 0x28(0x10)
	enum class EBuffEffectTagType TagType; // 0x38(0x01)
	bool bMatReplace; // 0x39(0x01)
	enum class EBuffEffectDurationType DurationType; // 0x3a(0x01)
	char pad_3B[0x1]; // 0x3b(0x01)
	float DurationTime; // 0x3c(0x04)
	struct TSoftClassPtr<UObject> ScreenWidgetPath; // 0x40(0x28)
	enum class ESameScreenEffectHandleType SameEffectHandleType; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float MinIntervalForSameScreenEffect; // 0x6c(0x04)
	float MinIntervalForSameScreenEffectLowLevelDevice; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// ScriptStruct Solarland.BuffEffectTableRow
// Size: 0x38 (Inherited: 0x08)
struct FBuffEffectTableRow : FTableRowBase {
	struct FName EffectType; // 0x08(0x08)
	struct FName EffectName; // 0x10(0x08)
	struct FName State; // 0x18(0x08)
	bool bMatReplace; // 0x20(0x01)
	enum class EBuffEffectDurationType DurationType; // 0x21(0x01)
	char pad_22[0x2]; // 0x22(0x02)
	float DurationTime; // 0x24(0x04)
	struct TArray<struct FBuffEffectActorParam> ActorEffectParams; // 0x28(0x10)
};

// ScriptStruct Solarland.BuffEffectActorParam
// Size: 0xd8 (Inherited: 0x00)
struct FBuffEffectActorParam {
	struct TSoftObjectPtr<UParticleSystem> ActorParticlePath; // 0x00(0x28)
	struct FSolarSkinnedParticleSystem ActorSkinnedParticlePath; // 0x28(0x70)
	struct FName SocketName; // 0x98(0x08)
	struct FVector LocationOffset; // 0xa0(0x0c)
	struct FRotator RotationOffset; // 0xac(0x0c)
	struct FVector Scale; // 0xb8(0x0c)
	enum class EAttachLocation LocationType; // 0xc4(0x01)
	bool bAutoActivate; // 0xc5(0x01)
	bool Attached; // 0xc6(0x01)
	bool bAbsoluteRotation; // 0xc7(0x01)
	struct TArray<struct FName> ComponentTags; // 0xc8(0x10)
};

// ScriptStruct Solarland.SolarSkinnedAsset
// Size: 0x08 (Inherited: 0x00)
struct FSolarSkinnedAsset {
	char pad_0[0x8]; // 0x00(0x08)
};

// ScriptStruct Solarland.SolarSkinnedParticleSystem
// Size: 0x70 (Inherited: 0x08)
struct FSolarSkinnedParticleSystem : FSolarSkinnedAsset {
	struct FSoftObjectPath DefaultSkinnedParticle; // 0x08(0x18)
	struct TMap<int32_t, struct FSoftObjectPath> SkinnedParticles; // 0x20(0x50)
};

// ScriptStruct Solarland.ScreenEffectWidgetCacheInfo
// Size: 0x18 (Inherited: 0x00)
struct FScreenEffectWidgetCacheInfo {
	struct USolarScreenEffectWidget* WidgetClass; // 0x00(0x08)
	struct TArray<struct USolarScreenEffectWidget*> WidgetInstances; // 0x08(0x10)
};

// ScriptStruct Solarland.ActiveCameraShakeWithCurve
// Size: 0x18 (Inherited: 0x00)
struct FActiveCameraShakeWithCurve {
	struct UCameraShakeWithCurve* ShakeInstance; // 0x00(0x08)
	char pad_8[0x10]; // 0x08(0x10)
};

// ScriptStruct Solarland.CameraShakeWithCurveTemplatePool
// Size: 0x18 (Inherited: 0x00)
struct FCameraShakeWithCurveTemplatePool {
	char pad_0[0x8]; // 0x00(0x08)
	struct TArray<struct UCameraShakeWithCurve*> PooledShakes; // 0x08(0x10)
};

// ScriptStruct Solarland.CameraShakeWithCurvePool
// Size: 0x10 (Inherited: 0x00)
struct FCameraShakeWithCurvePool {
	struct TArray<struct UCameraShakeWithCurve*> PooledShakes; // 0x00(0x10)
};

// ScriptStruct Solarland.CruiseFormation
// Size: 0x10 (Inherited: 0x00)
struct FCruiseFormation {
	struct TArray<struct FVector> LocationList; // 0x00(0x10)
};

// ScriptStruct Solarland.EchelonFormation
// Size: 0x10 (Inherited: 0x00)
struct FEchelonFormation {
	struct TArray<struct FVector> LocationList; // 0x00(0x10)
};

// ScriptStruct Solarland.SettlePageParam
// Size: 0x08 (Inherited: 0x00)
struct FSettlePageParam {
	int32_t WeaponExpSettlmentNum; // 0x00(0x04)
	bool IsRankFight; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct Solarland.DataManagerConfig
// Size: 0x10 (Inherited: 0x00)
struct FDataManagerConfig {
	struct UDataTable* GeneralDataTable; // 0x00(0x08)
	struct UDataTable* DataTable; // 0x08(0x08)
};

// ScriptStruct Solarland.FinalsBGMData
// Size: 0x28 (Inherited: 0x00)
struct FFinalsBGMData {
	bool bEnableFinalsBGM; // 0x00(0x01)
	char FinalsBGMSafeAreaIndex; // 0x01(0x01)
	char FinalsBGMPlayTeamCount; // 0x02(0x01)
	char FinalsBGMStopTeamCount; // 0x03(0x01)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString FinalsBGMName_Play; // 0x08(0x10)
	struct FString FinalsBGMName_Stop; // 0x18(0x10)
};

// ScriptStruct Solarland.SCMMapConfig
// Size: 0x80 (Inherited: 0x00)
struct FSCMMapConfig {
	struct FString Desc; // 0x00(0x10)
	struct FSoftObjectPath LevelMap; // 0x10(0x18)
	int32_t MiniMapId; // 0x28(0x04)
	bool IsStreaming; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	struct TMap<struct FString, struct FSCMElementMapConfig> ElementGroups; // 0x30(0x50)
};

// ScriptStruct Solarland.SCMElementMapConfig
// Size: 0x20 (Inherited: 0x00)
struct FSCMElementMapConfig {
	struct FSoftObjectPath ElementLevel; // 0x00(0x18)
	bool LoadWithLevel; // 0x18(0x01)
	enum class ELevelLoadType LoadType; // 0x19(0x01)
	char pad_1A[0x6]; // 0x1a(0x06)
};

// ScriptStruct Solarland.DoppelgangerBehaviorConfig
// Size: 0x70 (Inherited: 0x00)
struct FDoppelgangerBehaviorConfig {
	bool bNeedCopy; // 0x00(0x01)
	bool bCopyRotate; // 0x01(0x01)
	bool bCopyCrouch; // 0x02(0x01)
	bool bCopySprint; // 0x03(0x01)
	bool bCopyJump; // 0x04(0x01)
	bool bCopyJetFly; // 0x05(0x01)
	char pad_6[0x2]; // 0x06(0x02)
	float MoveDuration; // 0x08(0x04)
	struct FVector2D MoveDirection; // 0x0c(0x08)
	float FindTargetRange; // 0x14(0x04)
	bool bCanAutoShoot; // 0x18(0x01)
	char pad_19[0x7]; // 0x19(0x07)
	struct TMap<enum class EWeaponType, float> ShootRequestInterval; // 0x20(0x50)
};

// ScriptStruct Solarland.ActiveDynamicEffectTriggerVolumeInfo
// Size: 0x10 (Inherited: 0x00)
struct FActiveDynamicEffectTriggerVolumeInfo {
	struct TArray<struct FActiveGameplayEffectHandle> AppliedEffectHandles; // 0x00(0x10)
};

// ScriptStruct Solarland.DynamicGameplayEffectSpec
// Size: 0x10 (Inherited: 0x00)
struct FDynamicGameplayEffectSpec {
	struct UGameplayEffect* EffectClass; // 0x00(0x08)
	float EffectLevel; // 0x08(0x04)
	bool bRemoveOnEnd; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct Solarland.TacticalDodgeDirectionConfig
// Size: 0x78 (Inherited: 0x00)
struct FTacticalDodgeDirectionConfig {
	struct FSolarSkinnedMontage SkinnedMontage; // 0x00(0x70)
	enum class ECamShakeType CameraShake; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// ScriptStruct Solarland.SolarSkinnedMontage
// Size: 0x70 (Inherited: 0x08)
struct FSolarSkinnedMontage : FSolarSkinnedAsset {
	struct FSoftObjectPath DefaultSkinnedMontage; // 0x08(0x18)
	struct TMap<int32_t, struct FSoftObjectPath> SkinnedMontages; // 0x20(0x50)
};

// ScriptStruct Solarland.TacticalDodgeParams
// Size: 0x10 (Inherited: 0x08)
struct FTacticalDodgeParams : FGameplayAbilityTargetData {
	int32_t MontageIndex; // 0x08(0x04)
	float FaceYaw; // 0x0c(0x04)
};

// ScriptStruct Solarland.DGMatUpdateParams
// Size: 0x10 (Inherited: 0x00)
struct FDGMatUpdateParams {
	struct FName MatParam; // 0x00(0x08)
	struct UCurveBase* MatCurve; // 0x08(0x08)
};

// ScriptStruct Solarland.SolarExtraShieldEffect
// Size: 0x18 (Inherited: 0x00)
struct FSolarExtraShieldEffect {
	int32_t Level; // 0x00(0x04)
	struct FName TeammateEffectID; // 0x04(0x08)
	struct FName EnemyEffectID; // 0x0c(0x08)
	bool bOnRemoveStop; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
};

// ScriptStruct Solarland.SolarCharacterBillboardIconGroupConfig
// Size: 0x10 (Inherited: 0x00)
struct FSolarCharacterBillboardIconGroupConfig {
	struct TArray<struct FSolarCharacterBillboardIconConfig> IconConfigs; // 0x00(0x10)
};

// ScriptStruct Solarland.SolarCharacterBillboardIconConfig
// Size: 0x30 (Inherited: 0x00)
struct FSolarCharacterBillboardIconConfig {
	struct FGameplayTag IconTag; // 0x00(0x08)
	struct TSoftObjectPtr<UTexture2D> IconSoftPtr; // 0x08(0x28)
};

// ScriptStruct Solarland.CharacterAssistAimTargetConfig
// Size: 0xd8 (Inherited: 0x00)
struct FCharacterAssistAimTargetConfig {
	struct FWeaponAssistAimTargetConfig Standing; // 0x00(0x48)
	struct FWeaponAssistAimTargetConfig Crouching; // 0x48(0x48)
	struct FWeaponAssistAimTargetConfig Crawling; // 0x90(0x48)
};

// ScriptStruct Solarland.WeaponAssistAimTargetConfig
// Size: 0x48 (Inherited: 0x00)
struct FWeaponAssistAimTargetConfig {
	struct FVector2D BaseFollowTriggerExtent; // 0x00(0x08)
	struct FVector2D BaseFollowStopExtent; // 0x08(0x08)
	struct TArray<struct FBaseFollowExtentByTag> BaseFollowExtentByTags; // 0x10(0x10)
	struct FVector2D TargetVelocityFollowTriggerExtent; // 0x20(0x08)
	struct FVector2D LockAimingExtent; // 0x28(0x08)
	struct FVector2D GlobalSensitivityScaleTriggerExtent; // 0x30(0x08)
	char pad_38[0x10]; // 0x38(0x10)
};

// ScriptStruct Solarland.BaseFollowExtentByTag
// Size: 0x60 (Inherited: 0x00)
struct FBaseFollowExtentByTag {
	struct FGameplayTagRequirements TagRequirements; // 0x00(0x50)
	struct FVector2D BaseFollowTriggerExtent; // 0x50(0x08)
	struct FVector2D BaseFollowStopExtent; // 0x58(0x08)
};

// ScriptStruct Solarland.CharacterBodyScaleConfig
// Size: 0x08 (Inherited: 0x00)
struct FCharacterBodyScaleConfig {
	float CapsuleHeight; // 0x00(0x04)
	float MeshOriginHeight; // 0x04(0x04)
};

// ScriptStruct Solarland.CueContent
// Size: 0xb8 (Inherited: 0x00)
struct FCueContent {
	enum class ECueContentPlayTiming PlayTiming; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FName CustomEvent; // 0x04(0x08)
	char VisibleTargetFlag; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	struct FGameplayTagRequirements PlayTagRequirements; // 0x10(0x50)
	struct TArray<struct FActorEffectContent> ActorEffectContents; // 0x60(0x10)
	struct TArray<struct FBuffEffectContent> BuffEffectContents; // 0x70(0x10)
	struct TArray<struct FSoundContent> SoundContents; // 0x80(0x10)
	struct TArray<struct FHeadIconContent> HeadIconContents; // 0x90(0x10)
	struct TArray<struct FParticleSystemContent> ParticleSystemContents; // 0xa0(0x10)
	char pad_B0[0x8]; // 0xb0(0x08)
};

// ScriptStruct Solarland.ParticleSystemContent
// Size: 0x88 (Inherited: 0x00)
struct FParticleSystemContent {
	struct FActorParticleEffectSpawnInfo SpawnInfo; // 0x00(0x70)
	bool bStopOnEnd; // 0x70(0x01)
	char pad_71[0x17]; // 0x71(0x17)
};

// ScriptStruct Solarland.HeadIconContent
// Size: 0x08 (Inherited: 0x00)
struct FHeadIconContent {
	struct FGameplayTag HeadIconTag; // 0x00(0x08)
};

// ScriptStruct Solarland.SoundContent
// Size: 0x08 (Inherited: 0x00)
struct FSoundContent {
	struct FName SoundGroupName; // 0x00(0x08)
};

// ScriptStruct Solarland.BuffEffectContent
// Size: 0x14 (Inherited: 0x00)
struct FBuffEffectContent {
	struct FName BuffEffectID; // 0x00(0x08)
	bool bStopOnEnd; // 0x08(0x01)
	enum class EBuffEffectType BuffEffectType; // 0x09(0x01)
	char pad_A[0xa]; // 0x0a(0x0a)
};

// ScriptStruct Solarland.ActorEffectContent
// Size: 0x20 (Inherited: 0x00)
struct FActorEffectContent {
	struct UActorEffect* ActorEffectClass; // 0x00(0x08)
	enum class EActorEffectAffectedActorType AffectedActorType; // 0x08(0x01)
	bool bHideFX; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	struct FGameplayTag VisibilityFlagTag; // 0x0c(0x08)
	char pad_14[0xc]; // 0x14(0x0c)
};

// ScriptStruct Solarland.CharacterSpecializedComponentInfos
// Size: 0x10 (Inherited: 0x00)
struct FCharacterSpecializedComponentInfos {
	struct TArray<struct FCharacterSpecializedComponentInfo> ComponentInfos; // 0x00(0x10)
};

// ScriptStruct Solarland.CharacterSpecializedComponentInfo
// Size: 0x28 (Inherited: 0x00)
struct FCharacterSpecializedComponentInfo {
	struct TArray<enum class ENetRole> ValidRoles; // 0x00(0x10)
	bool bEnableReplication; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<struct UActorComponent*> ComponentClasses; // 0x18(0x10)
};

// ScriptStruct Solarland.CharacterMontageMappingData
// Size: 0x48 (Inherited: 0x08)
struct FCharacterMontageMappingData : FTableRowBase {
	struct FGameplayTag MontageTag; // 0x08(0x08)
	struct UAnimMontage* MaleMontage; // 0x10(0x08)
	struct UAnimMontage* FemaleMontage; // 0x18(0x08)
	struct TArray<struct FMontageDataByCharacter> CharacterSpecificData; // 0x20(0x10)
	struct UDataTable* WeaponSpecificDataTable; // 0x30(0x08)
	char pad_38[0x10]; // 0x38(0x10)
};

// ScriptStruct Solarland.MontageDataByCharacter
// Size: 0x20 (Inherited: 0x00)
struct FMontageDataByCharacter {
	int32_t CharacterId; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UAnimMontage* Montage; // 0x08(0x08)
	struct TArray<struct FMontageDataByCharacterSkin> SkinSpecificData; // 0x10(0x10)
};

// ScriptStruct Solarland.MontageDataByCharacterSkin
// Size: 0x10 (Inherited: 0x00)
struct FMontageDataByCharacterSkin {
	int32_t CharacterSkinID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UAnimMontage* Montage; // 0x08(0x08)
};

// ScriptStruct Solarland.EmotionMontageMappingData
// Size: 0x50 (Inherited: 0x48)
struct FEmotionMontageMappingData : FCharacterMontageMappingData {
	bool bShowWeapon; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float CameraZOffset; // 0x4c(0x04)
};

// ScriptStruct Solarland.MontageDataByWeapon
// Size: 0x30 (Inherited: 0x08)
struct FMontageDataByWeapon : FTableRowBase {
	int32_t weaponid; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct UAnimMontage* MaleMontage; // 0x10(0x08)
	struct UAnimMontage* FemaleMontage; // 0x18(0x08)
	struct TArray<struct FMontageDataByWeaponSkin> SkinSpecificData; // 0x20(0x10)
};

// ScriptStruct Solarland.MontageDataByWeaponSkin
// Size: 0x18 (Inherited: 0x00)
struct FMontageDataByWeaponSkin {
	int32_t WeaponSkinID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UAnimMontage* MaleMontage; // 0x08(0x08)
	struct UAnimMontage* FemaleMontage; // 0x10(0x08)
};

// ScriptStruct Solarland.ChildActorOrnamentConfig
// Size: 0x80 (Inherited: 0x00)
struct FChildActorOrnamentConfig {
	struct FSoftClassPath OrnamentRes; // 0x00(0x18)
	struct FName OrnamentAttachSocket; // 0x18(0x08)
	struct FTransform OrnamentRelativeTransform; // 0x20(0x30)
	struct FSoftObjectPath OrnamentVisibilityConfig; // 0x50(0x18)
	struct TArray<struct FName> OrnamentComponentTags; // 0x68(0x10)
	char pad_78[0x8]; // 0x78(0x08)
};

// ScriptStruct Solarland.SkeletalMeshOrnamentConfig
// Size: 0xa0 (Inherited: 0x00)
struct FSkeletalMeshOrnamentConfig {
	struct FSoftObjectPath OrnamentRes; // 0x00(0x18)
	struct FSoftClassPath OrnamentABPRes; // 0x18(0x18)
	struct FName OrnamentAttachSocket; // 0x30(0x08)
	char pad_38[0x8]; // 0x38(0x08)
	struct FTransform OrnamentRelativeTransform; // 0x40(0x30)
	struct FSoftObjectPath OrnamentVisibilityConfig; // 0x70(0x18)
	struct TArray<struct FName> OrnamentComponentTags; // 0x88(0x10)
	char pad_98[0x8]; // 0x98(0x08)
};

// ScriptStruct Solarland.StaticMeshOrnamentConfig
// Size: 0x80 (Inherited: 0x00)
struct FStaticMeshOrnamentConfig {
	struct FSoftObjectPath OrnamentRes; // 0x00(0x18)
	struct FName OrnamentAttachSocket; // 0x18(0x08)
	struct FTransform OrnamentRelativeTransform; // 0x20(0x30)
	struct FSoftObjectPath OrnamentVisibilityConfig; // 0x50(0x18)
	struct TArray<struct FName> OrnamentComponentTags; // 0x68(0x10)
	char pad_78[0x8]; // 0x78(0x08)
};

// ScriptStruct Solarland.SoundGroupMappingData
// Size: 0x58 (Inherited: 0x08)
struct FSoundGroupMappingData : FTableRowBase {
	struct TMap<int32_t, struct FSoundGroupDataByCharacter> CharacterSpecificData; // 0x08(0x50)
};

// ScriptStruct Solarland.SoundGroupDataByCharacter
// Size: 0x58 (Inherited: 0x00)
struct FSoundGroupDataByCharacter {
	struct FName DestinationSoundGroup; // 0x00(0x08)
	struct TMap<int32_t, struct FName> SkinSpecificData; // 0x08(0x50)
};

// ScriptStruct Solarland.ChooseWeaponItemData
// Size: 0x88 (Inherited: 0x00)
struct FChooseWeaponItemData {
	struct FName RowName; // 0x00(0x08)
	int32_t weaponid; // 0x08(0x04)
	int32_t WeaponTypeId; // 0x0c(0x04)
	int32_t WeaponSkinID; // 0x10(0x04)
	bool bCollected; // 0x14(0x01)
	char pad_15[0x3]; // 0x15(0x03)
	struct TArray<int32_t> AvailableScopes; // 0x18(0x10)
	int32_t DefaultScope; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct TSet<enum class EWeaponEquipSlot> SelectedSlots; // 0x30(0x50)
	int32_t SelectedScope; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct Solarland.ChooseWeaponItemState
// Size: 0x04 (Inherited: 0x00)
struct FChooseWeaponItemState {
	bool bCollected; // 0x00(0x01)
	bool bSelected; // 0x01(0x01)
	bool bSelectedBySlot1; // 0x02(0x01)
	bool bSelectedBySlot2; // 0x03(0x01)
};

// ScriptStruct Solarland.NodeContainerItem
// Size: 0x18 (Inherited: 0x00)
struct FNodeContainerItem {
	struct UCanvasPanel* RootContainerPanel; // 0x00(0x08)
	struct TArray<struct FNodeContainer> ContainerArray; // 0x08(0x10)
};

// ScriptStruct Solarland.NodeContainer
// Size: 0x28 (Inherited: 0x00)
struct FNodeContainer {
	struct FNodeElement ThisNode; // 0x00(0x10)
	bool bRoot; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
	struct TArray<struct FNodeElement> ChildsNode; // 0x18(0x10)
};

// ScriptStruct Solarland.NodeElement
// Size: 0x10 (Inherited: 0x00)
struct FNodeElement {
	struct UWidget* Widget; // 0x00(0x08)
	enum class ESlateVisibility Visible; // 0x08(0x01)
	bool bIsContainer; // 0x09(0x01)
	char pad_A[0x6]; // 0x0a(0x06)
};

// ScriptStruct Solarland.StateMapItemStruct
// Size: 0x18 (Inherited: 0x00)
struct FStateMapItemStruct {
	struct TArray<struct FStateItemStruct> ChildWidgetConfigList; // 0x00(0x10)
	bool bLoadChildWidgetTool; // 0x10(0x01)
	char pad_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Solarland.StateItemStruct
// Size: 0x10 (Inherited: 0x00)
struct FStateItemStruct {
	struct UWidget* CrosshairChildWidget; // 0x00(0x08)
	enum class ESlateVisibility VisibilityType; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct Solarland.UICrossHairSpreadStruct
// Size: 0x48 (Inherited: 0x00)
struct FUICrossHairSpreadStruct {
	struct UWidget* TargetWidget; // 0x00(0x08)
	enum class ESpreadType SpreadType; // 0x08(0x01)
	bool bPosition; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	float Angle; // 0x0c(0x04)
	bool Pos_UseCustomizeFunc; // 0x10(0x01)
	bool bScale; // 0x11(0x01)
	char pad_12[0x2]; // 0x12(0x02)
	struct FVector2D ScaleFactor; // 0x14(0x08)
	bool Scale_UseCustomizeFunc; // 0x1c(0x01)
	bool bRenderAngle; // 0x1d(0x01)
	char pad_1E[0x2]; // 0x1e(0x02)
	float RenderAngleFactor; // 0x20(0x04)
	bool Angle_UseCustomizeFunc; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	struct FVector2D OrginalVector; // 0x28(0x08)
	struct FVector2D OrginalScale; // 0x30(0x08)
	float OrginalAngle; // 0x38(0x04)
	struct FVector2D Dir; // 0x3c(0x08)
	char pad_44[0x4]; // 0x44(0x04)
};

// ScriptStruct Solarland.UICrossHairAimColorStruct
// Size: 0x28 (Inherited: 0x00)
struct FUICrossHairAimColorStruct {
	struct UImage* TargetImg; // 0x00(0x08)
	struct FLinearColor TargetColor; // 0x08(0x10)
	char pad_18[0x10]; // 0x18(0x10)
};

// ScriptStruct Solarland.CrosshairLayout
// Size: 0x04 (Inherited: 0x00)
struct FCrosshairLayout {
	float InitSpread; // 0x00(0x04)
};

// ScriptStruct Solarland.CrosshairSprite
// Size: 0x30 (Inherited: 0x00)
struct FCrosshairSprite {
	struct FSoftObjectPath Normal; // 0x00(0x18)
	struct FSoftObjectPath Energy; // 0x18(0x18)
};

// ScriptStruct Solarland.NoticeColorData
// Size: 0x30 (Inherited: 0x00)
struct FNoticeColorData {
	struct FLinearColor TextBg; // 0x00(0x10)
	struct FLinearColor IconBg; // 0x10(0x10)
	struct FLinearColor Icon; // 0x20(0x10)
};

// ScriptStruct Solarland.CustomNoticeImageRow
// Size: 0x20 (Inherited: 0x08)
struct FCustomNoticeImageRow : FTableRowBase {
	struct FString Remark; // 0x08(0x10)
	struct UTexture2D* NoticeIcon; // 0x18(0x08)
};

// ScriptStruct Solarland.CustomNoticeRow
// Size: 0x40 (Inherited: 0x08)
struct FCustomNoticeRow : FTableRowBase {
	struct FString Remark; // 0x08(0x10)
	int32_t NoticeText; // 0x18(0x04)
	enum class ECustomNoticeType NoticeType; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	float NoticeTime; // 0x20(0x04)
	enum class ECustomNoticeColor NoticeColor; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	struct UUINoticeBase* NoticeClass; // 0x28(0x08)
	struct FString NoticeIcon; // 0x30(0x10)
};

// ScriptStruct Solarland.CustomNoticeID
// Size: 0x01 (Inherited: 0x00)
struct FCustomNoticeID {
	char pad_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Solarland.BoxChargingInfo
// Size: 0x1c (Inherited: 0x00)
struct FBoxChargingInfo {
	char pad_0[0x1c]; // 0x00(0x1c)
};

// ScriptStruct Solarland.TerminatorNotifyUIConfig
// Size: 0x28 (Inherited: 0x00)
struct FTerminatorNotifyUIConfig {
	int32_t LocalizationID; // 0x00(0x04)
	char pad_4[0x14]; // 0x04(0x14)
	struct UUINoticeBase* TerminatorNotifyUI; // 0x18(0x08)
	enum class ECustomNoticeType NoticeType; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float NoticeTime; // 0x24(0x04)
};

// ScriptStruct Solarland.SkeletalMeshOverride
// Size: 0x50 (Inherited: 0x00)
struct FSkeletalMeshOverride {
	struct TSoftObjectPtr<USkeletalMesh> MeshOverride; // 0x00(0x28)
	struct TSoftObjectPtr<UMaterialInstance> MaterialOverride; // 0x28(0x28)
};

// ScriptStruct Solarland.StaticMeshOverride
// Size: 0x50 (Inherited: 0x00)
struct FStaticMeshOverride {
	struct TSoftObjectPtr<UStaticMesh> MeshOverride; // 0x00(0x28)
	struct TSoftObjectPtr<UMaterialInstance> MaterialOverride; // 0x28(0x28)
};

// ScriptStruct Solarland.DuckRollingCharacterHitConfig
// Size: 0xa0 (Inherited: 0x00)
struct FDuckRollingCharacterHitConfig {
	float MinSelfSpeed; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct USolarCharacterGameplayAbility* EnableCharacterHitAbility; // 0x08(0x08)
	struct UParticleSystem* SpeedEffect; // 0x10(0x08)
	char pad_18[0x8]; // 0x18(0x08)
	struct FTransform SpeedEffectRelativeTransform; // 0x20(0x30)
	float PushUpAngle; // 0x50(0x04)
	float UpBoundingRatio; // 0x54(0x04)
	struct FVector PushBoxExtent; // 0x58(0x0c)
	char pad_64[0x4]; // 0x64(0x04)
	struct UCurveFloat* PushSpeedCurve; // 0x68(0x08)
	bool bTeleportTargetOnPush; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float MinRelativeSpeedForDamage; // 0x74(0x04)
	float MinIntervalForDamage; // 0x78(0x04)
	float BaseDamage; // 0x7c(0x04)
	struct UCurveFloat* RelativeSpeedToDamageMultiplierCurve; // 0x80(0x08)
	struct UParticleSystem* HitEffect; // 0x88(0x08)
	struct FString HitSoundEvent; // 0x90(0x10)
};

// ScriptStruct Solarland.EmojiBubbleConfig
// Size: 0x10 (Inherited: 0x08)
struct FEmojiBubbleConfig : FTableRowBase {
	struct USolarUserWidget* EmojiClassType; // 0x08(0x08)
};

// ScriptStruct Solarland.BoxBurstItemConfig
// Size: 0x08 (Inherited: 0x00)
struct FBoxBurstItemConfig {
	struct UDataTable* ConfigTable; // 0x00(0x08)
};

// ScriptStruct Solarland.BurstItemSplitConfig
// Size: 0x40 (Inherited: 0x08)
struct FBurstItemSplitConfig : FTableRowBase {
	int32_t ID; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TArray<int32_t> Piles; // 0x10(0x10)
	struct TArray<float> ModelScale; // 0x20(0x10)
	int32_t MaxPileNum; // 0x30(0x04)
	struct FRotator Rotator; // 0x34(0x0c)
};

// ScriptStruct Solarland.ExpItemReduceRate
// Size: 0x08 (Inherited: 0x00)
struct FExpItemReduceRate {
	struct UDataTable* ConfigTable; // 0x00(0x08)
};

// ScriptStruct Solarland.ExpItemReduceRateConfig
// Size: 0x10 (Inherited: 0x08)
struct FExpItemReduceRateConfig : FTableRowBase {
	int32_t DeathCount; // 0x08(0x04)
	float Rate; // 0x0c(0x04)
};

// ScriptStruct Solarland.ExpItemConfig
// Size: 0x10 (Inherited: 0x00)
struct FExpItemConfig {
	struct UDataTable* ConfigTable; // 0x00(0x08)
	struct UDataTable* KilledConfigTable; // 0x08(0x08)
};

// ScriptStruct Solarland.ExpItemCountConfig
// Size: 0x18 (Inherited: 0x08)
struct FExpItemCountConfig : FTableRowBase {
	int32_t Lv; // 0x08(0x04)
	int32_t ExpItemCount; // 0x0c(0x04)
	int32_t ShieldMatMaxCount; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Solarland.FeedbackSingleData
// Size: 0x30 (Inherited: 0x00)
struct FFeedbackSingleData {
	struct UUserWidget* AnimationWidget; // 0x00(0x08)
	struct FName AnimationName; // 0x08(0x08)
	float AnimationPlaySpeed; // 0x10(0x04)
	float AnimationStartTime; // 0x14(0x04)
	float AnimationAgainStartTime; // 0x18(0x04)
	int32_t AnimationLoopNumber; // 0x1c(0x04)
	struct FName AudioName; // 0x20(0x08)
	enum class EAnimationType AnimationType; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// ScriptStruct Solarland.SElementLevelStreaming
// Size: 0x10 (Inherited: 0x00)
struct FSElementLevelStreaming {
	bool LoadWithLevel; // 0x00(0x01)
	enum class ELevelLoadType LoadType; // 0x01(0x01)
	char pad_2[0x6]; // 0x02(0x06)
	struct ULevelStreamingDynamic* LevelStreamingDynamic; // 0x08(0x08)
};

// ScriptStruct Solarland.LoadingScreenLevelData
// Size: 0x68 (Inherited: 0x00)
struct FLoadingScreenLevelData {
	struct FVector BackupLevelStreamingLocation; // 0x00(0x0c)
	char pad_C[0x4]; // 0x0c(0x04)
	struct TSet<struct FSoftObjectPath> LockupLevels; // 0x10(0x50)
	float LockupLevelMaxSquaredXYDistance; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
};

// ScriptStruct Solarland.WeaponVibrateDTRow
// Size: 0x80 (Inherited: 0x08)
struct FWeaponVibrateDTRow : FTableRowBase {
	struct FString WeaponDesc; // 0x08(0x10)
	struct TMap<enum class EWeaponVibrateType, struct FVibrateDevicePlayParams> WeaponVibrateMap; // 0x18(0x50)
	struct FChargeVibratePlayParams ChargeVibrateData; // 0x68(0x18)
};

// ScriptStruct Solarland.ChargeVibratePlayParams
// Size: 0x18 (Inherited: 0x00)
struct FChargeVibratePlayParams {
	float ChargingIntervalTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct UCurveFloat* ChargingFactorCurve; // 0x08(0x08)
	struct UCurveFloat* FireFactorCurve; // 0x10(0x08)
};

// ScriptStruct Solarland.VibrateDevicePlayParams
// Size: 0x50 (Inherited: 0x00)
struct FVibrateDevicePlayParams {
	struct TMap<enum class EVibrateDeviceType, struct FVibratePlayParams> DeviceMap; // 0x00(0x50)
};

// ScriptStruct Solarland.VibratePlayParams
// Size: 0x28 (Inherited: 0x00)
struct FVibratePlayParams {
	struct FString ClipToPlay; // 0x00(0x10)
	int32_t Duration; // 0x10(0x04)
	int32_t Loop; // 0x14(0x04)
	int32_t Priority; // 0x18(0x04)
	int32_t Interval; // 0x1c(0x04)
	int32_t Amplitude; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct Solarland.VibrateIntensityPlayParams
// Size: 0x50 (Inherited: 0x00)
struct FVibrateIntensityPlayParams {
	struct TMap<enum class EGameplayVibrateIntensity, struct FVibrateDevicePlayParams> IntensityMap; // 0x00(0x50)
};

// ScriptStruct Solarland.SCMRankListMulticast
// Size: 0x18 (Inherited: 0x00)
struct FSCMRankListMulticast {
	int32_t BeginRank; // 0x00(0x04)
	int32_t EndRank; // 0x04(0x04)
	struct FMulticastInlineDelegate RankListChangeMulticast; // 0x08(0x10)
};

// ScriptStruct Solarland.SCMRankEventHandle
// Size: 0x1c (Inherited: 0x00)
struct FSCMRankEventHandle {
	int32_t BeginRank; // 0x00(0x04)
	int32_t EndRank; // 0x04(0x04)
	struct FDelegate RankListChangeEvent; // 0x08(0x10)
	int32_t Index; // 0x18(0x04)
};

// ScriptStruct Solarland.SCMHostData
// Size: 0x488 (Inherited: 0x00)
struct FSCMHostData {
	struct FHostChangeData DataChangeToGlobal; // 0x00(0xf0)
	struct FHostChangeData DataChangeToSide; // 0xf0(0xf0)
	struct FHostChangeData DataChangeToSelf; // 0x1e0(0xf0)
	struct TMap<struct FString, struct FSCMSaveData> DataMap; // 0x2d0(0x50)
	struct TMap<struct FString, struct FSCMArrayData> ArrayDataMap; // 0x320(0x50)
	struct TMap<struct FString, struct FSCMMapData> MapDataMap; // 0x370(0x50)
	char pad_3C0[0xa0]; // 0x3c0(0xa0)
	struct FMulticastInlineDelegate SCMDataChangeDelegate; // 0x460(0x10)
	struct FString Name; // 0x470(0x10)
	enum class ESCMHostType HostType; // 0x480(0x01)
	char pad_481[0x7]; // 0x481(0x07)
};

// ScriptStruct Solarland.SCMSaveDataBase
// Size: 0x18 (Inherited: 0x00)
struct FSCMSaveDataBase {
	struct FString Name; // 0x00(0x10)
	enum class ESCMDataType Type; // 0x10(0x01)
	enum class ESCMDataReplicateType RepType; // 0x11(0x01)
	char pad_12[0x6]; // 0x12(0x06)
};

// ScriptStruct Solarland.SCMMapData
// Size: 0x68 (Inherited: 0x18)
struct FSCMMapData : FSCMSaveDataBase {
	char pad_18[0x50]; // 0x18(0x50)
};

// ScriptStruct Solarland.SCMArrayData
// Size: 0x28 (Inherited: 0x18)
struct FSCMArrayData : FSCMSaveDataBase {
	char pad_18[0x10]; // 0x18(0x10)
};

// ScriptStruct Solarland.SCMSaveData
// Size: 0x20 (Inherited: 0x18)
struct FSCMSaveData : FSCMSaveDataBase {
	char pad_18[0x8]; // 0x18(0x08)
};

// ScriptStruct Solarland.HostChangeData
// Size: 0xf0 (Inherited: 0x00)
struct FHostChangeData {
	struct TMap<struct FString, enum class ESCMDataChangeType> DataChangeMap; // 0x00(0x50)
	struct TMap<struct FString, struct FSCMChangeDataArray> ArrayChangeMap; // 0x50(0x50)
	struct TMap<struct FString, struct FSCMChangeDataMap> MapChangeMap; // 0xa0(0x50)
};

// ScriptStruct Solarland.SCMChangeDataMap
// Size: 0x20 (Inherited: 0x00)
struct FSCMChangeDataMap {
	struct TArray<enum class ESCMDataChangeType> ChangeType; // 0x00(0x10)
	struct TArray<struct FString> ChangeKeyArray; // 0x10(0x10)
};

// ScriptStruct Solarland.SCMChangeDataArray
// Size: 0x20 (Inherited: 0x00)
struct FSCMChangeDataArray {
	struct TArray<enum class ESCMDataChangeType> ChangeType; // 0x00(0x10)
	struct TArray<uint32_t> ChangeIndexArray; // 0x10(0x10)
};

// ScriptStruct Solarland.SCMDataBoardRow
// Size: 0x88 (Inherited: 0x08)
struct FSCMDataBoardRow : FTableRowBase {
	enum class ESCMDataType Type; // 0x08(0x01)
	enum class ESCMDataSetType DataSetType; // 0x09(0x01)
	char pad_A[0x6]; // 0x0a(0x06)
	struct FString Default; // 0x10(0x10)
	struct TArray<struct FString> DefaultArray; // 0x20(0x10)
	struct TMap<struct FString, struct FString> DefaultMap; // 0x30(0x50)
	enum class ESCMHostType HostType; // 0x80(0x01)
	enum class ESCMDataReplicateType ReplicateType; // 0x81(0x01)
	enum class ESCMDataGatherType_Settle SettleGatherType; // 0x82(0x01)
	enum class ESCMDataRankType Rank; // 0x83(0x01)
	char pad_84[0x4]; // 0x84(0x04)
};

// ScriptStruct Solarland.SCMGeneralDataBoardRow
// Size: 0x98 (Inherited: 0x88)
struct FSCMGeneralDataBoardRow : FSCMDataBoardRow {
	enum class EStatisticsType MapNameType; // 0x88(0x01)
	char pad_89[0xf]; // 0x89(0x0f)
};

// ScriptStruct Solarland.WeaponAttributeGameplayTags
// Size: 0x18 (Inherited: 0x00)
struct FWeaponAttributeGameplayTags {
	struct FGameplayTag Spread; // 0x00(0x08)
	struct FGameplayTag HorizontalRecoil; // 0x08(0x08)
	struct FGameplayTag VerticalRecoil; // 0x10(0x08)
};

// ScriptStruct Solarland.AssitLockBoneWeight
// Size: 0x0c (Inherited: 0x00)
struct FAssitLockBoneWeight {
	struct FName BoneName; // 0x00(0x08)
	float BoneWeight; // 0x08(0x04)
};

// ScriptStruct Solarland.GuidanceConditionTableRow
// Size: 0x30 (Inherited: 0x08)
struct FGuidanceConditionTableRow : FTableRowBase {
	char TriggerType; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
	struct TArray<struct FString> Parameters; // 0x10(0x10)
	struct FString Description; // 0x20(0x10)
};

// ScriptStruct Solarland.GyroscopeDeviceModel
// Size: 0x18 (Inherited: 0x08)
struct FGyroscopeDeviceModel : FTableRowBase {
	struct FString NotHavingGyroscopeDeviceModelName; // 0x08(0x10)
};

// ScriptStruct Solarland.GyroscopeSensitivity
// Size: 0x20 (Inherited: 0x08)
struct FGyroscopeSensitivity : FTableRowBase {
	struct FString Axle; // 0x08(0x10)
	float GyroscopeSensitivityArray; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct Solarland.GyroscopeDTRow
// Size: 0x10 (Inherited: 0x08)
struct FGyroscopeDTRow : FTableRowBase {
	int32_t ID; // 0x08(0x04)
	float GyroscopeFactor; // 0x0c(0x04)
};

// ScriptStruct Solarland.PlayerSelectInfo
// Size: 0x28 (Inherited: 0x00)
struct FPlayerSelectInfo {
	struct ASolarPlayerState* Player; // 0x00(0x08)
	int32_t PlayerPos; // 0x08(0x04)
	int32_t CharacterId; // 0x0c(0x04)
	int32_t SkinId; // 0x10(0x04)
	int32_t HeroExpLevel; // 0x14(0x04)
	bool HasConfirm; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float PlayerSelectTime; // 0x1c(0x04)
	bool IsInHeroPickProcess; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
};

// ScriptStruct Solarland.AIPickHeroInfo
// Size: 0x08 (Inherited: 0x00)
struct FAIPickHeroInfo {
	int32_t CharacterId; // 0x00(0x04)
	int32_t SkinId; // 0x04(0x04)
};

// ScriptStruct Solarland.PlayerSelection
// Size: 0x18 (Inherited: 0x00)
struct FPlayerSelection {
	struct ASolarPlayerState* PlayerState; // 0x00(0x08)
	struct TWeakObjectPtr<struct UHeroPickCharacterData> SelectionData; // 0x08(0x08)
	int32_t CachedPos; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Solarland.AlertConfig
// Size: 0xd0 (Inherited: 0x00)
struct FAlertConfig {
	bool bShowDebug; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	float TickInterval; // 0x04(0x04)
	float HighAlertAngle; // 0x08(0x04)
	float HighAlertRadiusMin; // 0x0c(0x04)
	float HighAlertRadiusMax; // 0x10(0x04)
	struct FVector2D HighAlertBoxExtent; // 0x14(0x08)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct TMap<enum class EAlertDirection, float> AlertCD; // 0x20(0x50)
	float VoiceCD; // 0x70(0x04)
	int32_t VoiceID; // 0x74(0x04)
	float NoticeCD; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct TArray<struct FName> OcclusionCheckBones; // 0x80(0x10)
	struct FGameplayTagContainer SelfBlockTags; // 0x90(0x20)
	struct FGameplayTagContainer EnemyBlockTags; // 0xb0(0x20)
};

// ScriptStruct Solarland.SoundGroupTableDataBase
// Size: 0x08 (Inherited: 0x08)
struct FSoundGroupTableDataBase : FTableRowBase {
};

// ScriptStruct Solarland.SoundGroupHitSoundTableData
// Size: 0x18 (Inherited: 0x08)
struct FSoundGroupHitSoundTableData : FSoundGroupTableDataBase {
	struct FString SoundEvent; // 0x08(0x10)
};

// ScriptStruct Solarland.SoundGroupHitSoundWwiseParams
// Size: 0x40 (Inherited: 0x00)
struct FSoundGroupHitSoundWwiseParams {
	struct FString SwitchGroup; // 0x00(0x10)
	struct FString SwitchState_IAttackOther; // 0x10(0x10)
	struct FString SwitchState_OtherAttackMe; // 0x20(0x10)
	struct FString SwitchState_Other; // 0x30(0x10)
};

// ScriptStruct Solarland.HitSoundTableData
// Size: 0x68 (Inherited: 0x08)
struct FHitSoundTableData : FTableRowBase {
	struct UDataTable* SubTableData; // 0x08(0x08)
	struct FName Default; // 0x10(0x08)
	struct FName CharacterBody; // 0x18(0x08)
	struct FName CharacterHead; // 0x20(0x08)
	struct FName CharacterShieldBody; // 0x28(0x08)
	struct FName CharacterShieldHead; // 0x30(0x08)
	struct FName CharacterHitDown; // 0x38(0x08)
	struct FName CharacterKill; // 0x40(0x08)
	struct FName CharacterKill2; // 0x48(0x08)
	struct FName Vehicle; // 0x50(0x08)
	struct FName SummonItemSolid; // 0x58(0x08)
	struct FName SummonItemVirtual; // 0x60(0x08)
};

// ScriptStruct Solarland.HitTraceMeshWidgetData
// Size: 0x3c (Inherited: 0x00)
struct FHitTraceMeshWidgetData {
	char pad_0[0x4]; // 0x00(0x04)
	struct FHitTraceData HitTraceSourceData; // 0x04(0x18)
	struct FVector2D Position; // 0x1c(0x08)
	float Scale; // 0x24(0x04)
	int32_t Angle; // 0x28(0x04)
	float Opacity; // 0x2c(0x04)
	char IconIndex; // 0x30(0x01)
	char ColorIdx; // 0x31(0x01)
	char pad_32[0x2]; // 0x32(0x02)
	int32_t ArcLength; // 0x34(0x04)
	int32_t SniperLength; // 0x38(0x04)
};

// ScriptStruct Solarland.HitTraceData
// Size: 0x18 (Inherited: 0x00)
struct FHitTraceData {
	enum class EHitTraceType Type; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector TraceDirection; // 0x04(0x0c)
	float Damage; // 0x10(0x04)
	float HitTime; // 0x14(0x04)
};

// ScriptStruct Solarland.ServerMoveData
// Size: 0x50 (Inherited: 0x00)
struct FServerMoveData {
	float Timestamp; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	int64_t ServerTimeStamp; // 0x08(0x08)
	struct FVector Acceleration; // 0x10(0x0c)
	struct FVector Velocity; // 0x1c(0x0c)
	struct FVector Loction; // 0x28(0x0c)
	char CompressedMoveFlags; // 0x34(0x01)
	char RollByte; // 0x35(0x01)
	char pad_36[0x2]; // 0x36(0x02)
	uint32_t YawPitchInt; // 0x38(0x04)
	char MovementMode; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	uint32_t FullBodyAnimationState; // 0x40(0x04)
	uint32_t MontageAnimState; // 0x44(0x04)
	char JetPackFlag; // 0x48(0x01)
	bool bValid; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// ScriptStruct Solarland.SolarAerialReconnaissanceConfig
// Size: 0x08 (Inherited: 0x00)
struct FSolarAerialReconnaissanceConfig {
	int32_t MarkMaximum; // 0x00(0x04)
	bool bMarkTeamMode; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
};

// ScriptStruct Solarland.RichHlinkRow
// Size: 0x870 (Inherited: 0x08)
struct FRichHlinkRow : FTableRowBase {
	char pad_8[0x8]; // 0x08(0x08)
	struct FHyperlinkStyle HlinkStyle; // 0x10(0x860)
};

// ScriptStruct Solarland.InGameLevelingConfig
// Size: 0x08 (Inherited: 0x00)
struct FInGameLevelingConfig {
	struct UDataTable* ExpTable; // 0x00(0x08)
};

// ScriptStruct Solarland.InGameExpConifg
// Size: 0x10 (Inherited: 0x08)
struct FInGameExpConifg : FTableRowBase {
	int32_t Lv; // 0x08(0x04)
	int32_t Exp; // 0x0c(0x04)
};

// ScriptStruct Solarland.JobManagerConfig
// Size: 0x08 (Inherited: 0x00)
struct FJobManagerConfig {
	struct UDataTable* JobTable; // 0x00(0x08)
};

// ScriptStruct Solarland.KeyMapDisplayRowInfo
// Size: 0x18 (Inherited: 0x08)
struct FKeyMapDisplayRowInfo : FTableRowBase {
	struct FString DisplayName; // 0x08(0x10)
};

// ScriptStruct Solarland.KeyMappingJsonData
// Size: 0x10 (Inherited: 0x00)
struct FKeyMappingJsonData {
	struct TArray<struct FKeyMappingRowInfo> JsonData; // 0x00(0x10)
};

// ScriptStruct Solarland.KeyMappingRowInfo
// Size: 0x98 (Inherited: 0x08)
struct FKeyMappingRowInfo : FTableRowBase {
	struct FString Label; // 0x08(0x10)
	struct FString ActionDisplayName; // 0x18(0x10)
	struct FString ActionName; // 0x28(0x10)
	bool Continuity; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float Scale; // 0x3c(0x04)
	struct FString RealAction; // 0x40(0x10)
	struct TArray<struct FString> FirstDefaultKeys; // 0x50(0x10)
	struct TArray<struct FString> SecondDefaultKeys; // 0x60(0x10)
	struct FString Description; // 0x70(0x10)
	struct TArray<struct FString> RelatedActions; // 0x80(0x10)
	bool Stationary; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
};

// ScriptStruct Solarland.KillInfoMessage
// Size: 0x38 (Inherited: 0x00)
struct FKillInfoMessage {
	char pad_0[0x38]; // 0x00(0x38)
};

// ScriptStruct Solarland.KillEffectExtraInfo
// Size: 0x0c (Inherited: 0x00)
struct FKillEffectExtraInfo {
	char pad_0[0xc]; // 0x00(0x0c)
};

// ScriptStruct Solarland.KillExtraInfo
// Size: 0x10 (Inherited: 0x00)
struct FKillExtraInfo {
	char pad_0[0x10]; // 0x00(0x10)
};

// ScriptStruct Solarland.EShopDisplayData
// Size: 0x58 (Inherited: 0x00)
struct FEShopDisplayData {
	int32_t ItemID; // 0x00(0x04)
	float Price; // 0x04(0x04)
	float UndiscountedPrice; // 0x08(0x04)
	int32_t Num; // 0x0c(0x04)
	int32_t ProductID; // 0x10(0x04)
	float CoolDown; // 0x14(0x04)
	int32_t Generation; // 0x18(0x04)
	bool bIsRecommend; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	struct FString Name; // 0x20(0x10)
	struct FString Icon; // 0x30(0x10)
	struct FString Info; // 0x40(0x10)
	int32_t Quality; // 0x50(0x04)
	int32_t ItemType; // 0x54(0x04)
};

// ScriptStruct Solarland.ULoadingDataEntry
// Size: 0xb8 (Inherited: 0x00)
struct FULoadingDataEntry {
	struct FSoftObjectPath LoadingBg; // 0x00(0x18)
	struct TArray<int32_t> TipIntArray; // 0x18(0x10)
	struct TArray<struct FWrappedLocalTextID> TipLocalTitleArray; // 0x28(0x10)
	struct TArray<struct FWrappedLocalTextID> TipLocalLeftArray; // 0x38(0x10)
	struct TArray<struct FWrappedLocalTextID> TipLocalMidArray; // 0x48(0x10)
	struct TArray<struct FWrappedLocalTextID> TipLocalRightArray; // 0x58(0x10)
	struct TArray<struct FString> TipArray; // 0x68(0x10)
	struct TArray<struct FString> TipTitleArray; // 0x78(0x10)
	struct TArray<struct FString> TipLeftArray; // 0x88(0x10)
	struct TArray<struct FString> TipMidArray; // 0x98(0x10)
	struct TArray<struct FString> TipRightArray; // 0xa8(0x10)
};

// ScriptStruct Solarland.MassInvStateTransitionData
// Size: 0x90 (Inherited: 0x00)
struct FMassInvStateTransitionData {
	float TransitionTime; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FRuntimeFloatCurve TransitionCurve; // 0x08(0x88)
};

// ScriptStruct Solarland.MassInvStateMaterialParams
// Size: 0x78 (Inherited: 0x00)
struct FMassInvStateMaterialParams {
	struct FMassInvMaterialParams PrepareParams; // 0x00(0x28)
	struct FMassInvMaterialParams NormalParams; // 0x28(0x28)
	struct FMassInvMaterialParams SprintParams; // 0x50(0x28)
};

// ScriptStruct Solarland.MassInvMaterialParams
// Size: 0x28 (Inherited: 0x00)
struct FMassInvMaterialParams {
	float PatternResolution; // 0x00(0x04)
	float Detail; // 0x04(0x04)
	float MaskBlend; // 0x08(0x04)
	float Opacity; // 0x0c(0x04)
	float StealthAdjust; // 0x10(0x04)
	float Tilling; // 0x14(0x04)
	struct FLinearColor BaseColor; // 0x18(0x10)
};

// ScriptStruct Solarland.MatchResult
// Size: 0x80 (Inherited: 0x00)
struct FMatchResult {
	struct FString BattleID; // 0x00(0x10)
	struct FString BattleAddr; // 0x10(0x10)
	struct FString Token; // 0x20(0x10)
	int32_t ModeID; // 0x30(0x04)
	int32_t RuleID; // 0x34(0x04)
	struct FString SelfPlayerID; // 0x38(0x10)
	struct TArray<struct FMatchResult_Group> Groups; // 0x48(0x10)
	struct FString MapName; // 0x58(0x10)
	struct FSoftObjectPath MapPath; // 0x68(0x18)
};

// ScriptStruct Solarland.MatchResult_Group
// Size: 0x18 (Inherited: 0x00)
struct FMatchResult_Group {
	int32_t groupid; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<struct FMatchResult_Player> Players; // 0x08(0x10)
};

// ScriptStruct Solarland.MatchResult_Player
// Size: 0x58 (Inherited: 0x00)
struct FMatchResult_Player {
	struct FString PlayerId; // 0x00(0x10)
	struct FString playerName; // 0x10(0x10)
	int32_t AvatarID; // 0x20(0x04)
	int32_t fightCharacterID; // 0x24(0x04)
	int32_t fightCharacterSkinID; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct FSoftObjectPath SkinConfigPath; // 0x30(0x18)
	struct FString CharacterName; // 0x48(0x10)
};

// ScriptStruct Solarland.MaterialVariableChange
// Size: 0x18 (Inherited: 0x00)
struct FMaterialVariableChange {
	struct FName Variable; // 0x00(0x08)
	float FromValue; // 0x08(0x04)
	float ToValue; // 0x0c(0x04)
	float BeginProgress; // 0x10(0x04)
	float EndProgress; // 0x14(0x04)
};

// ScriptStruct Solarland.MapMarkElemArray
// Size: 0x10 (Inherited: 0x00)
struct FMapMarkElemArray {
	struct TArray<struct FMapMarkElem> MapMarkElems; // 0x00(0x10)
};

// ScriptStruct Solarland.MapMarkElem
// Size: 0x10 (Inherited: 0x00)
struct FMapMarkElem {
	struct UMapMarkBase* MapMark; // 0x00(0x08)
	bool bUsing; // 0x08(0x01)
	char pad_9[0x7]; // 0x09(0x07)
};

// ScriptStruct Solarland.AirdropMeshWidgetData
// Size: 0x48 (Inherited: 0x00)
struct FAirdropMeshWidgetData {
	struct FConfigMiniMapMeshWidgetData IconData; // 0x00(0x18)
	struct FConfigMiniMapMeshWidgetData DiffuseData; // 0x18(0x18)
	struct FConfigMiniMapMeshWidgetData FlashData; // 0x30(0x18)
};

// ScriptStruct Solarland.ConfigMiniMapMeshWidgetData
// Size: 0x18 (Inherited: 0x00)
struct FConfigMiniMapMeshWidgetData {
	float TimeSpeed; // 0x00(0x04)
	char IconTexId; // 0x04(0x01)
	char ColorOpacityIndex; // 0x05(0x01)
	char pad_6[0x2]; // 0x06(0x02)
	struct FVector2D OpacityCoeff; // 0x08(0x08)
	struct FVector2D ScaleAndRipplingCoeff; // 0x10(0x08)
};

// ScriptStruct Solarland.MiniMapData
// Size: 0x18 (Inherited: 0x00)
struct FMiniMapData {
	bool bUseAsBigMap; // 0x00(0x01)
	bool bOverride; // 0x01(0x01)
	char pad_2[0x2]; // 0x02(0x02)
	float MinFOV; // 0x04(0x04)
	float MaxFOV; // 0x08(0x04)
	float CurrentFOV; // 0x0c(0x04)
	struct FVector2D MapSize; // 0x10(0x08)
};

// ScriptStruct Solarland.MissileBulletConfig
// Size: 0x20 (Inherited: 0x00)
struct FMissileBulletConfig {
	struct FVector EjectDir; // 0x00(0x0c)
	float EjectDelayTime; // 0x0c(0x04)
	struct TArray<int32_t> TrailSpreadIndexArray; // 0x10(0x10)
};

// ScriptStruct Solarland.MissileBullet
// Size: 0x68 (Inherited: 0x00)
struct FMissileBullet {
	char pad_0[0x40]; // 0x00(0x40)
	struct UParticleSystemComponent* BulletEffect; // 0x40(0x08)
	struct UParticleSystemComponent* RibbonTrajectoryEffect; // 0x48(0x08)
	struct AMissileSwarmLauncher* Launcher; // 0x50(0x08)
	char pad_58[0x10]; // 0x58(0x10)
};

// ScriptStruct Solarland.MissileBulletSpawnParameter
// Size: 0x48 (Inherited: 0x00)
struct FMissileBulletSpawnParameter {
	struct FFireUniqueID FireUniqueID; // 0x00(0x04)
	struct FVector EjectLoc; // 0x04(0x0c)
	struct FVector EjectDir; // 0x10(0x0c)
	struct FVector TargetLoc; // 0x1c(0x0c)
	float EjectTimeStamp; // 0x28(0x04)
	float EjectDelayTime; // 0x2c(0x04)
	struct TArray<int32_t> TrailSpreadIndexArray; // 0x30(0x10)
	int32_t SwarmIndex; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// ScriptStruct Solarland.FireUniqueID
// Size: 0x04 (Inherited: 0x00)
struct FFireUniqueID {
	uint32_t Data; // 0x00(0x04)
};

// ScriptStruct Solarland.DetailedTeamListViewInfo
// Size: 0x40 (Inherited: 0x00)
struct FDetailedTeamListViewInfo {
	int32_t TeamID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FString TeamName; // 0x08(0x10)
	int32_t Rank; // 0x18(0x04)
	int32_t Point; // 0x1c(0x04)
	uint32_t PreliminaryRank; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct TArray<struct FDetailedListViewInfo> PlayerDetailInfos; // 0x28(0x10)
	bool bIsTournament; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// ScriptStruct Solarland.DetailedListViewInfo
// Size: 0x40 (Inherited: 0x00)
struct FDetailedListViewInfo {
	bool bIsUsingStructInfo; // 0x00(0x01)
	bool bIsCheater; // 0x01(0x01)
	bool bIsMVP; // 0x02(0x01)
	char pad_3[0x5]; // 0x03(0x05)
	struct FString playerName; // 0x08(0x10)
	int32_t KillNum; // 0x18(0x04)
	int32_t AssistNum; // 0x1c(0x04)
	float CauseDamage; // 0x20(0x04)
	float ReceivedDamage; // 0x24(0x04)
	float HealSelf; // 0x28(0x04)
	float ReceivedHeal; // 0x2c(0x04)
	float LifeTime; // 0x30(0x04)
	float MvpScore; // 0x34(0x04)
	int32_t FlagID; // 0x38(0x04)
	enum class ECommonInputType InputType; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
};

// ScriptStruct Solarland.ConfigMeshData
// Size: 0x18c (Inherited: 0x00)
struct FConfigMeshData {
	bool bTeamVisible; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t TeamID; // 0x04(0x04)
	struct FVector2D TenOffset; // 0x08(0x08)
	struct FVector2D OneOffset; // 0x10(0x08)
	struct FLinearColor MainColor; // 0x18(0x10)
	struct FLinearColor ViceColor; // 0x28(0x10)
	bool bShieldVisible; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	struct FProgressMeshData Shield; // 0x3c(0x1c)
	struct FProgressMeshData ShieldDamage; // 0x58(0x1c)
	struct FProgressMeshData ShieldBG; // 0x74(0x1c)
	bool bHPVisible; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	struct FProgressMeshData HP; // 0x94(0x1c)
	struct FProgressMeshData HPDamage; // 0xb0(0x1c)
	struct FProgressMeshData HPBG; // 0xcc(0x1c)
	struct FMidProgressData MidShield; // 0xe8(0x3c)
	struct FMidProgressData MidHP; // 0x124(0x3c)
	struct FProgressMeshData MidBG; // 0x160(0x1c)
	struct FVector2D ScreenOffset; // 0x17c(0x08)
	char pad_184[0x8]; // 0x184(0x08)
};

// ScriptStruct Solarland.ProgressMeshData
// Size: 0x1c (Inherited: 0x00)
struct FProgressMeshData {
	float Progress; // 0x00(0x04)
	struct FLinearColor Color; // 0x04(0x10)
	struct FVector2D Offset; // 0x14(0x08)
};

// ScriptStruct Solarland.MidProgressData
// Size: 0x3c (Inherited: 0x00)
struct FMidProgressData {
	bool bVisible; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FProgressMeshData Data; // 0x04(0x1c)
	struct FProgressMeshData BGData; // 0x20(0x1c)
};

// ScriptStruct Solarland.ReplayPlayerOverviewData
// Size: 0x60 (Inherited: 0x00)
struct FReplayPlayerOverviewData {
	struct FString playerName; // 0x00(0x10)
	struct FString HeroName; // 0x10(0x10)
	struct TSoftObjectPtr<UTexture2D> SkinResourcePtr; // 0x20(0x28)
	int32_t PlayerNum; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct FString GameModeName; // 0x50(0x10)
};

// ScriptStruct Solarland.TeamPlayerNavArray
// Size: 0x10 (Inherited: 0x00)
struct FTeamPlayerNavArray {
	struct TArray<struct UOBPlayerNavWidget*> NavArray; // 0x00(0x10)
};

// ScriptStruct Solarland.CupViewInfo
// Size: 0x28 (Inherited: 0x00)
struct FCupViewInfo {
	struct FString TournamentName; // 0x00(0x10)
	struct FString TournamentIcon; // 0x10(0x10)
	int32_t GameModeId; // 0x20(0x04)
	int32_t RuleID; // 0x24(0x04)
};

// ScriptStruct Solarland.OpponentPerspectiveMaterialParamsConditional
// Size: 0x270 (Inherited: 0x00)
struct FOpponentPerspectiveMaterialParamsConditional {
	struct FGameplayTagRequirements OpponentTagRequirements; // 0x00(0x50)
	struct FOpponentPerspectiveMaterialParams MaterialParams; // 0x50(0x220)
};

// ScriptStruct Solarland.OpponentPerspectiveMaterialParams
// Size: 0x220 (Inherited: 0x00)
struct FOpponentPerspectiveMaterialParams {
	struct FRuntimeFloatCurve OpacityCurve; // 0x00(0x88)
	struct FRuntimeFloatCurve OutlineSizeCurve; // 0x88(0x88)
	struct FRuntimeFloatCurve OpacityScaleByFOVCurve; // 0x110(0x88)
	struct FRuntimeFloatCurve OutlineSizeScaleByFOVCurve; // 0x198(0x88)
};

// ScriptStruct Solarland.PassiveSkillLevelDescription
// Size: 0x20 (Inherited: 0x00)
struct FPassiveSkillLevelDescription {
	struct FWrappedLocalTextID InnerDescriptionLocalTextID; // 0x00(0x04)
	struct FWrappedLocalTextID ShortDescriptionLocalTextID; // 0x04(0x04)
	struct FSoftObjectPath InnerIconPath; // 0x08(0x18)
};

// ScriptStruct Solarland.BackpackAnimInfo
// Size: 0x0c (Inherited: 0x00)
struct FBackpackAnimInfo {
	int32_t StartFrame; // 0x00(0x04)
	int32_t EndFrame; // 0x04(0x04)
	float Length; // 0x08(0x04)
};

// ScriptStruct Solarland.SwitchEffectInfo
// Size: 0x18 (Inherited: 0x00)
struct FSwitchEffectInfo {
	struct UMeshComponent* MeshComp; // 0x00(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> EffectMat; // 0x08(0x10)
};

// ScriptStruct Solarland.RookieGuidanceTableRow
// Size: 0xc0 (Inherited: 0x08)
struct FRookieGuidanceTableRow : FTableRowBase {
	char groupid; // 0x08(0x01)
	char Tag; // 0x09(0x01)
	bool IfBindedWidget; // 0x0a(0x01)
	char pad_B[0x5]; // 0x0b(0x05)
	struct FString TriggerCondition; // 0x10(0x10)
	float TriggerDelayTime; // 0x20(0x04)
	char TriggerStage; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	struct FString GuideBPName; // 0x28(0x10)
	struct FVector2D GuideBPLocation; // 0x38(0x08)
	int32_t GuideBPScale; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
	struct FString RelatedUI; // 0x48(0x10)
	struct FVector2D RelatedUILocation; // 0x58(0x08)
	int32_t RelatedUIScale; // 0x60(0x04)
	int32_t LocTextID; // 0x64(0x04)
	struct FVector2D LocTextLocation; // 0x68(0x08)
	float LocTextDuration; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct FString EndCondition; // 0x78(0x10)
	float EndDelayTime; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct FString InterruptCondition; // 0x90(0x10)
	char SingleRoundTriggerMax; // 0xa0(0x01)
	char TotalTriggerMax; // 0xa1(0x01)
	char pad_A2[0x6]; // 0xa2(0x06)
	struct FString FinishCondition; // 0xa8(0x10)
	bool IfUpload; // 0xb8(0x01)
	bool IfMandatory; // 0xb9(0x01)
	char pad_BA[0x6]; // 0xba(0x06)
};

// ScriptStruct Solarland.BuildingData
// Size: 0x20 (Inherited: 0x00)
struct FBuildingData {
	struct FString BuildingLocation; // 0x00(0x10)
	struct FString BuildingIconName; // 0x10(0x10)
};

// ScriptStruct Solarland.ChargingZone
// Size: 0x20 (Inherited: 0x00)
struct FChargingZone {
	float Level1; // 0x00(0x04)
	float Level2; // 0x04(0x04)
	float Level3; // 0x08(0x04)
	float Level4; // 0x0c(0x04)
	char pad_10[0x10]; // 0x10(0x10)
};

// ScriptStruct Solarland.SCustomMode_PlayerReport
// Size: 0x4e8 (Inherited: 0x498)
struct FSCustomMode_PlayerReport : FSolarPlayerReport {
	struct TMap<int32_t, int32_t> RewardItems; // 0x498(0x50)
};

// ScriptStruct Solarland.SeparatedPackageInfo
// Size: 0x28 (Inherited: 0x00)
struct FSeparatedPackageInfo {
	int32_t SeparetedPkgID; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct TArray<int32_t> ChunksInPkg; // 0x08(0x10)
	struct TArray<int32_t> DependentPkgID; // 0x18(0x10)
};

// ScriptStruct Solarland.SettlementConfig
// Size: 0x80 (Inherited: 0x08)
struct FSettlementConfig : FTableRowBase {
	int32_t SettlementID; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FSettlementStageConfig StageConfig; // 0x10(0x40)
	struct TSoftClassPtr<UObject> Formula; // 0x50(0x28)
	bool IsValidData; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// ScriptStruct Solarland.SettlementStageConfig
// Size: 0x40 (Inherited: 0x00)
struct FSettlementStageConfig {
	struct TSoftClassPtr<UObject> Page_Die; // 0x00(0x28)
	int32_t Page_SkipIndex; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
	struct TArray<struct TSoftClassPtr<UObject>> SettlementStage; // 0x30(0x10)
};

// ScriptStruct Solarland.SettlementParam_Zomborg
// Size: 0x18 (Inherited: 0x00)
struct FSettlementParam_Zomborg {
	struct ASolarPlayerState* ps; // 0x00(0x08)
	float LifeTime; // 0x08(0x04)
	int32_t PlayerRank; // 0x0c(0x04)
	float GoldPunishRate; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Solarland.SettlementParam_PageParam
// Size: 0x0c (Inherited: 0x00)
struct FSettlementParam_PageParam {
	bool IsMVP; // 0x00(0x01)
	bool IsAce; // 0x01(0x01)
	bool IsVictory; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	int32_t WeaponExpSettlmentNum; // 0x04(0x04)
	bool IsRankFight; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
};

// ScriptStruct Solarland.SettlementParam_KDA
// Size: 0x18 (Inherited: 0x00)
struct FSettlementParam_KDA {
	struct ASolarPlayerState* ps; // 0x00(0x08)
	int32_t KillNum; // 0x08(0x04)
	int32_t DeathNum; // 0x0c(0x04)
	int32_t AssitNum; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Solarland.SettlementParam_MVP
// Size: 0x28 (Inherited: 0x00)
struct FSettlementParam_MVP {
	struct ASolarPlayerState* ps; // 0x00(0x08)
	int32_t KillNum; // 0x08(0x04)
	int32_t DownNum; // 0x0c(0x04)
	int32_t AssitNum; // 0x10(0x04)
	int32_t SaveNum; // 0x14(0x04)
	float LifeTime; // 0x18(0x04)
	float DamageValue; // 0x1c(0x04)
	int32_t Rank; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
};

// ScriptStruct Solarland.SettlementParam_WeaponExp
// Size: 0x20 (Inherited: 0x00)
struct FSettlementParam_WeaponExp {
	struct ASolarPlayerState* ps; // 0x00(0x08)
	float UseTime; // 0x08(0x04)
	int32_t WeaponKillNum; // 0x0c(0x04)
	int32_t WeaponAssitNum; // 0x10(0x04)
	float ExpRatio; // 0x14(0x04)
	float EXPPunishRatio; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct Solarland.SettlementParam_CommonExp
// Size: 0x38 (Inherited: 0x00)
struct FSettlementParam_CommonExp {
	struct ASolarPlayerState* ps; // 0x00(0x08)
	int32_t KillNum; // 0x08(0x04)
	int32_t DownNum; // 0x0c(0x04)
	int32_t AssitNum; // 0x10(0x04)
	int32_t SaveNum; // 0x14(0x04)
	float LifeTime; // 0x18(0x04)
	float DamageValue; // 0x1c(0x04)
	int32_t Rank; // 0x20(0x04)
	float EXPPunishRatio; // 0x24(0x04)
	float CoinPunishRatio; // 0x28(0x04)
	int32_t RankCorePunish; // 0x2c(0x04)
	int32_t BaseExp; // 0x30(0x04)
	float ExpRatio; // 0x34(0x04)
};

// ScriptStruct Solarland.ShootingTargetRing
// Size: 0x1c (Inherited: 0x00)
struct FShootingTargetRing {
	float Radius; // 0x00(0x04)
	float Score; // 0x04(0x04)
	struct FLinearColor ColorHUD; // 0x08(0x10)
	struct FColor Color3D; // 0x18(0x04)
};

// ScriptStruct Solarland.SolarWeaponFireSocketData
// Size: 0x60 (Inherited: 0x00)
struct FSolarWeaponFireSocketData {
	struct TArray<struct FName> MultiBulletSocketNames; // 0x00(0x10)
	struct TArray<struct FName> MuzzleSocketNames; // 0x10(0x10)
	struct TArray<struct FName> AdsMuzzleSocketNames; // 0x20(0x10)
	struct TArray<struct FName> MuzzleBlockCheckSocketNames; // 0x30(0x10)
	struct TArray<struct FName> MultiCastShellSocketNames; // 0x40(0x10)
	struct TArray<struct FName> AdsMultiCastShellSocketNames; // 0x50(0x10)
};

// ScriptStruct Solarland.SolarWeaponFireInputRespondConfig
// Size: 0x0b (Inherited: 0x00)
struct FSolarWeaponFireInputRespondConfig {
	char pad_0[0x1]; // 0x00(0x01)
	bool bAutoCloseScope; // 0x01(0x01)
	bool bShootAtPress; // 0x02(0x01)
	bool bShootAtPressAutoScope; // 0x03(0x01)
	bool bCanAutoShootWhilePress; // 0x04(0x01)
	bool bCanAutoShootWhilePressAutoScope; // 0x05(0x01)
	bool bCanShootWhileScoping; // 0x06(0x01)
	bool bCanShootWhileScopingAutoScope; // 0x07(0x01)
	bool bCanManuallyCanceled; // 0x08(0x01)
	bool bCanManuallyCanceledAutoScope; // 0x09(0x01)
	bool bOpenScopeWhileAutoFire; // 0x0a(0x01)
};

// ScriptStruct Solarland.SolarWeaponCrosshairData
// Size: 0x38 (Inherited: 0x00)
struct FSolarWeaponCrosshairData {
	char HasReload; // 0x00(0x01)
	char HasForbid; // 0x01(0x01)
	char HasOverload; // 0x02(0x01)
	char HasChargeProgress; // 0x03(0x01)
	char HasFeedback; // 0x04(0x01)
	enum class EWeaponType WeaponType; // 0x05(0x01)
	bool bIsEnergyType; // 0x06(0x01)
	char pad_7[0x1]; // 0x07(0x01)
	struct UUserWidget* CrossHairWidget; // 0x08(0x08)
	struct UUserWidget* BulletContainerWidget; // 0x10(0x08)
	struct UUserWidget* WeaponRechamberWidget; // 0x18(0x08)
	struct FSolarNoAmmoAlertWidgetLayout AmmoAlertWidgetLayout; // 0x20(0x18)
};

// ScriptStruct Solarland.SolarNoAmmoAlertWidgetLayout
// Size: 0x18 (Inherited: 0x00)
struct FSolarNoAmmoAlertWidgetLayout {
	bool bOverrideLayout; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FVector2D Offset; // 0x04(0x08)
	float SpinAngle; // 0x0c(0x04)
	struct FVector2D Scale; // 0x10(0x08)
};

// ScriptStruct Solarland.MoveSpeedReduceCurveConfig
// Size: 0xd8 (Inherited: 0x00)
struct FMoveSpeedReduceCurveConfig {
	struct FGameplayTagRequirements TagRequirements; // 0x00(0x50)
	struct FRuntimeFloatCurve MoveSpeedReduceCurveOnHoldingWeapon; // 0x50(0x88)
};

// ScriptStruct Solarland.LaunchDeviceInfo
// Size: 0x20 (Inherited: 0x00)
struct FLaunchDeviceInfo {
	bool bIsUsing; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	struct FName LaunchPadLocSocketName; // 0x04(0x08)
	struct FName PrepareEffectLocSocketName; // 0x0c(0x08)
	char pad_14[0x4]; // 0x14(0x04)
	struct UParticleSystemComponent* AvailableDeviceEffect; // 0x18(0x08)
};

// ScriptStruct Solarland.ReplicateEffectData
// Size: 0x18 (Inherited: 0x00)
struct FReplicateEffectData {
	struct FSoftObjectPath IconPath; // 0x00(0x18)
};

// ScriptStruct Solarland.SolarAttributeModifier
// Size: 0xa0 (Inherited: 0x00)
struct FSolarAttributeModifier {
	enum class ESolarAttributeType SolarAttributeType; // 0x00(0x01)
	enum class ESolarAttributeDurationType AttributeDurationType; // 0x01(0x01)
	enum class ESolarAttributeValueSourceType AttributeDurationSourceType; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	float AttributeModifyDuration; // 0x04(0x04)
	struct FString AttributeModifyDurationSourceKey; // 0x08(0x10)
	float AttributeModifyMinDistance; // 0x18(0x04)
	float AttributeModifyMaxDistance; // 0x1c(0x04)
	struct UCurveFloat* AttributeDistanceScaleCurve; // 0x20(0x08)
	bool AttributeUseTargetValue; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	float AttributeTargetValue; // 0x2c(0x04)
	enum class ESolarAttributeValueSourceType AttributeChangeValueSourceType; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float AttributeChangeValue; // 0x34(0x04)
	float AttributeChangeValueForVehicle; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FString AttributeChangeValueSourceKey; // 0x40(0x10)
	bool AttributeChangeValueIsMultiplier; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
